//JHSZD04  JOB (00,EV),'ID_EXECUTOR',TIME=1440,REGION=0M,
//         CLASS=A,MSGCLASS=T,MSGLEVEL=(1,1)
/*ROUTE PRINT JES2PRD1
//*DIARIA JV1. DATA:DATA_MOVIMENTO
//*DIARIA JV1. PERIODO:PERIODO_MOVIMENTO
//*DIARIA JV1. ANO MES:ANOMES_MOVIMENTO
//*DIARIA JV1. DIA:DIA_MOVIMENTO
//*DIARIA JV1. DATA ANTERIOR:DATA_ANTERIOR
//*2019-03-012019-03-31 o período deve corresponder ao mês
//JOBLIB   DD DISP=SHR,DSN=DSNC10.DB2M.SDSNLOAD
//         DD DISP=SHR,DSN=HOM.V01.LOAD
//*
//**       ========================================================
//**       TOTALIZADOR DE ENCARGOS E DESPESAS
//**       ========================================================
//E0010064 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD *
    DSN    SYSTEM(DB2M)
    RUN    PROGRAM(SZEMB064) PLAN(SIASBAT) -
           LIB('HOM.V01.LOAD')            -
           PARMS('/ABTERMENC(ABEND)')
//SYSIN    DD DUMMY
//**       ========================================================
//**       GERACAO DE ARQUIVOS DE COMISSAO/REMUNERACAO
//**       ========================================================
//******** RESTART=E001DELE
//E001DELE EXEC PGM=IEFBR14
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUT011 DD DISP=(MOD,DELETE),UNIT=SYSALLDA,SPACE=(TRK,(5,5)),
//         DSN=HOM.SZ.DDATA_MOVIMENTO.SZEMB076
//*
//E0020076 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SZEM76S1 DD DSN=HOM.SZ.DDATA_MOVIMENTO.SZEMB076,
//         DISP=(,CATLG,CATLG),DSNTYPE=LARGE,
//         UNIT=SYSALLDA,SPACE=(TRK,(40000,40000),RLSE),
//         DCB=(RECFM=FB,LRECL=1500,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD *
    DSN    SYSTEM(DB2M)
    RUN    PROGRAM(SZEMB076) PLAN(SIASBAT) -
           LIB('HOM.V01.LOAD')            -
           PARMS('/ABTERMENC(ABEND)')
//SYSIN    DD *
PERIODO_MOVIMENTO
//*
//**==================================================================
//**       GERAR ARQUIVO COMISSAO / REMUNERACAO SIGDC HABIT
//**       COM BASE NA TABELA SZ_ENCARG_DESP
//**==================================================================
//******** RESTART=E002DELE
//E002DELE EXEC PGM=IEFBR14
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUT21  DD DISP=(MOD,DELETE),UNIT=SYSALLDA,SPACE=(TRK,(5,5)),
//         DSN=HOM.SZ.DDATA_MOVIMENTO.SZEMB079.SIGDC01
//SYSUT22  DD DISP=(MOD,DELETE),UNIT=SYSALLDA,SPACE=(TRK,(5,5)),
//         DSN=HOM.SZ.DDATA_MOVIMENTO.SZEMB079.SIGDC02
//SYSUT23  DD DISP=(MOD,DELETE),UNIT=SYSALLDA,SPACE=(TRK,(5,5)),
//         DSN=HOM.SZ.DDATA_MOVIMENTO.SZEMB079.SIGDC03
//*
//E0030079 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SZEM79S1 DD DSN=HOM.SZ.DDATA_MOVIMENTO.SZEMB079.SIGDC01,
//         DISP=(,CATLG,CATLG),DSNTYPE=LARGE,
//         UNIT=SYSALLDA,SPACE=(TRK,(10000,10000),RLSE),
//         DCB=(RECFM=FB,LRECL=1500,BLKSIZE=0,DSORG=PS)
//SZEM79S2 DD DSN=HOM.SZ.DDATA_MOVIMENTO.SZEMB079.SIGDC02,
//         DISP=(,CATLG,CATLG),DSNTYPE=LARGE,
//         UNIT=SYSALLDA,SPACE=(TRK,(10000,10000),RLSE),
//         DCB=(RECFM=FB,LRECL=1500,BLKSIZE=0,DSORG=PS)
//SZEM79S3 DD DSN=HOM.SZ.DDATA_MOVIMENTO.SZEMB079.SIGDC03,
//         DISP=(,CATLG,CATLG),DSNTYPE=LARGE,
//         UNIT=SYSALLDA,SPACE=(TRK,(10000,10000),RLSE),
//         DCB=(RECFM=FB,LRECL=1500,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD *
    DSN    SYSTEM(DB2M)
    RUN    PROGRAM(SZEMB079) PLAN(SIASBAT) -
           LIB('HOM.V01.LOAD')            -
           PARMS('/ABTERMENC(ABEND)')
//SYSIN    DD *
PERIODO_MOVIMENTO
//*
//**       ========================================================
//**       INTEERFACE DE COBRANCA GLAO
//**       ========================================================
//******** RESTART=E003DELE
//E003DELE EXEC PGM=IEFBR14
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUT31  DD DISP=(MOD,DELETE),UNIT=SYSALLDA,SPACE=(TRK,(5,5)),
//         DSN=HOM.SZ.DDATA_MOVIMENTO.SZGLB002.SAIDA
//E0040002 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SZGLB0S2 DD DSN=HOM.SZ.DDATA_MOVIMENTO.SZGLB002.SAIDA,
//            UNIT=SYSTQS,DISP=(,CATLG,DELETE),
//            SPACE=(TRK,(500,100),RLSE),
//            DCB=(RECFM=FB,LRECL=750,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSIN    DD *
PERIODO_MOVIMENTO
//SYSTSIN  DD *
    DSN    SYSTEM(DB2M)
    RUN    PROGRAM(SZGLB002) PLAN(SIASBAT) -
           LIB('HOM.V01.LOAD')            -
           PARMS('/ABTERMENC(ABEND)')
//**       ========================================================
//**       INTEERFACE DE COMISSOES/GLAO
//**       ========================================================
//******** RESTART=E004DELE
//E004DELE EXEC PGM=IEFBR14
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUT41  DD DISP=(MOD,DELETE),UNIT=SYSALLDA,SPACE=(TRK,(5,5)),
//         DSN=HOM.SZ.DDATA_MOVIMENTO.SZGLB003.SAIDA
//E0050003 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SZGLB0S3 DD DSN=HOM.SZ.DDATA_MOVIMENTO.SZGLB003.SAIDA,
//            UNIT=SYSTQS,DISP=(,CATLG,DELETE),
//            SPACE=(TRK,(500,100),RLSE),
//            DCB=(RECFM=FB,LRECL=750,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSIN    DD *
PERIODO_MOVIMENTO
//SYSTSIN  DD *
    DSN    SYSTEM(DB2M)
    RUN    PROGRAM(SZGLB003) PLAN(SIASBAT) -
           LIB('HOM.V01.LOAD')            -
           PARMS('/ABTERMENC(ABEND)')
//**       ========================================================
//**       INTEERFACE COSSEGURO/CEDIDO
//**       ========================================================
//******** RESTART=E005DELE
//E005DELE EXEC PGM=IEFBR14
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUT51  DD DISP=(MOD,DELETE),UNIT=SYSALLDA,SPACE=(TRK,(5,5)),
//         DSN=HOM.SZ.DDATA_MOVIMENTO.SZGLB004.SAIDA
//E0060004 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SZGLB0S4 DD DSN=HOM.SZ.DDATA_MOVIMENTO.SZGLB004.SAIDA,
//            UNIT=SYSTQS,DISP=(,CATLG,DELETE),
//            SPACE=(TRK,(500,100),RLSE),
//            DCB=(RECFM=FB,LRECL=750,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSIN    DD *
PERIODO_MOVIMENTO
//SYSTSIN  DD *
    DSN    SYSTEM(DB2M)
    RUN    PROGRAM(SZGLB004) PLAN(SIASBAT) -
           LIB('HOM.V01.LOAD')            -
           PARMS('/ABTERMENC(ABEND)')
//**       ========================================================
//**       INTERFACE - SINISTRO NL/C
//**       ========================================================
//******** RESTART=E006DELE
//E006DELE EXEC PGM=IEFBR14
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUT61  DD DISP=(MOD,DELETE),UNIT=SYSALLDA,SPACE=(TRK,(5,5)),
//         DSN=HOM.SZ.DDATA_MOVIMENTO.SZGLB001.GLSINLCA
//E0070001 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SZGLB0S1 DD DSN=HOM.SZ.DDATA_MOVIMENTO.SZGLB001.GLSINLCA,
//            UNIT=SYSTQS,DISP=(,CATLG,DELETE),
//            SPACE=(TRK,(500,100),RLSE),
//            DCB=(RECFM=FB,LRECL=750,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSIN    DD *
PERIODO_MOVIMENTO
//SYSTSIN  DD *
    DSN    SYSTEM(DB2M)
    RUN    PROGRAM(SZGLB001) PLAN(SIASBAT) -
           LIB('HOM.V01.LOAD')            -
           PARMS('/ABTERMENC(ABEND)')
//**       ========================================================
//**       INTEERFACE SINISTRO COSSEGURO/CEDIDO
//**       ========================================================
//******** RESTART=E007DELE
//E007DELE EXEC PGM=IEFBR14
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUT71  DD DISP=(MOD,DELETE),UNIT=SYSALLDA,SPACE=(TRK,(5,5)),
//         DSN=HOM.SZ.DDATA_MOVIMENTO.SZGLB006.GLSICCED
//E0080006 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SZGLB0S6 DD DSN=HOM.SZ.DDATA_MOVIMENTO.SZGLB006.GLSICCED,
//            UNIT=SYSTQS,DISP=(,CATLG,DELETE),
//            SPACE=(TRK,(500,100),RLSE),
//            DCB=(RECFM=FB,LRECL=750,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSIN    DD *
PERIODO_MOVIMENTO
//SYSTSIN  DD *
    DSN    SYSTEM(DB2M)
    RUN    PROGRAM(SZGLB006) PLAN(SIASBAT) -
           LIB('HOM.V01.LOAD')            -
           PARMS('/ABTERMENC(ABEND)')
//**       ========================================================
//**       REPLICA SSC
//**       ========================================================
//E009INS  EXEC PGM=IKJEFT01,DYNAMNBR=50
//SYSTSPRT DD  SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD  SYSOUT=*
//SYSTSIN  DD  *
  DSN SYSTEM(DB2M)
  RUN PROGRAM(DSNTEP2) PLAN(DSNTEP12) LIB('DSNC10.DB2M.RUNLIB.LOAD')
//SYSIN DD *
  INSERT INTO SEGUROS.GE_CONTROLE_REPLICA
  (NOM_PROCESSO_ORIG,DTH_PROC_LEGADO)
  VALUES('FINAL_DIARIA_SMART-SZ', CURRENT TIMESTAMP);
//**       ========================================================
//**       GERACAO DE ARQUIVO DE PREMIO PARA CONSORCIO
//**       ========================================================
//******** RESTART=E008DELE
//E008DELE EXEC PGM=IEFBR14
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUT81  DD DISP=(MOD,DELETE),UNIT=SYSALLDA,SPACE=(TRK,(5,5)),
//         DSN=HOM.SZ.DDATA_MOVIMENTO.SZEMB069.PREMIO
//E0090069 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SZEMB69P DD DSN=HOM.SZ.DDATA_MOVIMENTO.SZEMB069.PREMIO,
//         DISP=(NEW,CATLG,DELETE),SPACE=(TRK,(5000,5000),RLSE),
//         UNIT=SYSALLDA,DCB=(RECFM=FB,LRECL=300,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSIN    DD *
PERIODO_MOVIMENTO
//SYSTSIN  DD *
    DSN    SYSTEM(DB2M)
    RUN    PROGRAM(SZEMB069) PLAN(SIASBAT) -
           LIB('HOM.V01.LOAD')            -
           PARMS('/ABTERMENC(ABEND)')
//**       ========================================================
//**       GERACAO ARQUIVO PREVISUL
//**       ========================================================
//******** RESTART=E009DELE
//E009DELE EXEC PGM=IEFBR14
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUT91  DD DISP=(MOD,DELETE),UNIT=SYSALLDA,SPACE=(TRK,(5,5)),
//         DSN=HOM.SZ.DDATA_MOVIMENTO.SZEMB080.SINI
//SYSUT92  DD DISP=(MOD,DELETE),UNIT=SYSALLDA,SPACE=(TRK,(5,5)),
//         DSN=HOM.SZ.DDATA_MOVIMENTO.SZEMB080.HIST
//SYSUT93  DD DISP=(MOD,DELETE),UNIT=SYSALLDA,SPACE=(TRK,(5,5)),
//         DSN=HOM.SZ.DDATA_MOVIMENTO.SZEMB080.APOL
//E0090080 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SZEM80SN DD DSN=HOM.SZ.DDATA_MOVIMENTO.SZEMB080.SINI,
//         DISP=(NEW,CATLG,DELETE),SPACE=(TRK,(5000,5000),RLSE),
//         UNIT=SYSALLDA,DCB=(RECFM=FB,LRECL=273,BLKSIZE=0,DSORG=PS)
//SZEM80HP DD DSN=HOM.SZ.DDATA_MOVIMENTO.SZEMB080.HIST,
//         DISP=(NEW,CATLG,DELETE),SPACE=(TRK,(5000,5000),RLSE),
//         UNIT=SYSALLDA,DCB=(RECFM=FB,LRECL=164,BLKSIZE=0,DSORG=PS)
//SZEM80AP DD DSN=HOM.SZ.DDATA_MOVIMENTO.SZEMB080.APOL,
//         DISP=(NEW,CATLG,DELETE),SPACE=(TRK,(5000,5000),RLSE),
//         UNIT=SYSALLDA,DCB=(RECFM=FB,LRECL=334,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSIN    DD *
PERIODO_MOVIMENTO
//SYSTSIN  DD *
    DSN    SYSTEM(DB2M)
    RUN    PROGRAM(SZEMB080) PLAN(SIASBAT) -
           LIB('HOM.V01.LOAD')            -
           PARMS('/ABTERMENC(ABEND)')
//**       ========================================================
//**       GERACAO DE ARQUIVO DE PREMIO PARA CONSORCIO
//**       ========================================================
//******** RESTART=E010DELE
//E010DELE EXEC PGM=IEFBR14
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUT101 DD DISP=(MOD,DELETE),UNIT=SYSALLDA,SPACE=(TRK,(5,5)),
//         DSN=HOM.SZ.DDATA_MOVIMENTO.SZEMB019.ENTRADA
//E011LIST EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//STEPLIB  DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
LOCSITE TRACKS
LOCSITE PRIMARY=500
LOCSITE SECONDARY=1500
LOCSITE LRECL=405 BLKSIZE=0 RECFM=FB
CD /UPLOAD/JV1/JDSZD04/ENTRADA
GET PRD.SX.DDATA_MOVIMENTO.SXEMB019.ENTRADA +
   'HOM.SZ.DDATA_MOVIMENTO.SZEMB019.ENTRADA'

QUIT
/*
//E001TEST EXEC PGM=IKJEFT01,
//         PARM=('HOMFULL HOM.SZ.DDATA_MOVIMENTO.SZEMB019.ENTRADA')
//SYSPROC  DD DSN=HOM.V01.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//E01IF    IF E001TEST.RC = 00 THEN
//E0120019 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SZ03019F DD DSN=HOM.SZ.DDATA_MOVIMENTO.SZEMB019.ENTRADA,DISP=SHR
//SYSOUT   DD SYSOUT=*
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSIN    DD DUMMY
//SYSTSIN  DD *
    DSN    SYSTEM(DB2M)
    RUN    PROGRAM(SZEMB019) PLAN(SIASBAT) -
           LIB('HOM.V01.LOAD')            -
           PARMS('/ABTERMENC(ABEND)')
//E01IFEND ENDIF
//**       ========================================================
//**       ARQUIVO COMPLEMENTAR ENVIADO PELA CEF
//**       COM INFORMAÃ§ÃµES DO CCA E INDICADOR
//**       ========================================================
//******** RESTART=E011DELE
//E011DELE EXEC PGM=IEFBR14
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUT101 DD DISP=(MOD,DELETE),UNIT=SYSALLDA,SPACE=(TRK,(5,5)),
//         DSN=HOM.SZ.DDATA_MOVIMENTO.SZEMB084.ENTRADA
//SYSUT102 DD DISP=(MOD,DELETE),UNIT=SYSALLDA,SPACE=(TRK,(5,5)),
//         DSN=HOM.SZ.DDATA_MOVIMENTO.SZEMB084.CXERRO
//*
//E012LIST EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//STEPLIB  DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
LOCSITE TRACKS
LOCSITE PRIMARY=500
LOCSITE SECONDARY=1500
LOCSITE LRECL=200 BLKSIZE=0 RECFM=FB
CD /UPLOAD/JV1/JDSZD04/ENTRADA
GET  PRD.ACI.MZ.BBA2.SEG61180.DDATA_MOVIMENTO    +
    'HOM.SZ.DDATA_MOVIMENTO.SZEMB084.ENTRADA' (REPLACE
QUIT
//*
//E002TEST EXEC PGM=IKJEFT01,
//         PARM=('HOMFULL HOM.SZ.DDATA_MOVIMENTO.SZEMB084.ENTRADA')
//SYSPROC  DD DSN=HOM.V01.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//E02IF    IF E002TEST.RC = 00 THEN
//E012B084 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//CXENTRA  DD DSN=HOM.SZ.DDATA_MOVIMENTO.SZEMB084.ENTRADA,
//         DISP=(,CATLG,DELETE),SPACE=(TRK,(5000,5000),RLSE),
//         UNIT=SYSALLDA,DCB=(RECFM=FB,LRECL=200,BLKSIZE=0,DSORG=PS)
//CXERRO   DD DSN=HOM.SZ.DDATA_MOVIMENTO.SZEMB084.CXERRO,
//         DISP=(,CATLG,DELETE),SPACE=(TRK,(5000,5000),RLSE),
//         UNIT=SYSALLDA,DCB=(RECFM=FB,LRECL=250,BLKSIZE=0,DSORG=PS)
//SYSOUT   DD SYSOUT=*
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSIN    DD *
20DATA_MOVIMENTOHOM.SZ.DDATA_MOVIMENTO.SZEMB084.CXERRO
//SYSTSIN  DD *
    DSN    SYSTEM(DB2M)
    RUN    PROGRAM(SZEMB084) PLAN(SIASBAT) -
           LIB('HOM.V01.LOAD')            -
           PARMS('/ABTERMENC(ABEND)')
//E02IFEND ENDIF
//**       ========================================================
//**       REGISTRAR DPS - Arquivo Complementar
//**       ========================================================
//******** RESTART=E012DELE
//E012DELE EXEC PGM=IEFBR14
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUT121 DD DISP=(MOD,DELETE),UNIT=SYSALLDA,SPACE=(TRK,(5,5)),
//         DSN=HOM.SZ.DDATA_MOVIMENTO.SZEMB035.COMPLINE
//SYSUT122 DD DISP=(MOD,DELETE),UNIT=SYSALLDA,SPACE=(TRK,(5,5)),
//         DSN=HOM.SZ.DDATA_MOVIMENTO.SZEMB035.SAIDA1
//SYSUT123 DD DISP=(MOD,DELETE),UNIT=SYSALLDA,SPACE=(TRK,(5,5)),
//         DSN=HOM.SZ.DDATA_MOVIMENTO.SZEMB035.SAIDA2
//*
//E013GET  EXEC PGM=FTP,REGION=4096K,PARM='10.100.2.144'
//STEPLIB  DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD /UPLOAD/JV1/JDSZD04/ENTRADA
LOCSITE TRACKS
LOCSITE PRIMARY=500
LOCSITE SECONDARY=500
LOCSITE LRECL=76 BLKSIZE=0 RECFM=FB
GET PRD.SX.DDATA_MOVIMENTO.SZEMB035.COMPLINE  +
   'HOM.SZ.DDATA_MOVIMENTO.SZEMB035.COMPLINE' (REPLACE
QUIT
//E003TEST EXEC PGM=IKJEFT01,
//         PARM=('HOMFULL HOM.SZ.DDATA_MOVIMENTO.SZEMB035.COMPLINE')
//SYSPROC  DD DSN=HOM.V01.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//E03IF    IF E002TEST.RC = 00 THEN
//E0150035 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SZ035E1  DD DSN=HOM.SZ.DDATA_MOVIMENTO.SZEMB035.COMPLINE,DISP=SHR
//*
F //SZ035S1  DD DSN=HOM.SZ.DDATA_MOVIMENTO.SZEMB035.SAIDA1,
//            UNIT=SYSALLDA,DISP=(,CATLG,DELETE),
//            SPACE=(TRK,(500,100),RLSE),
//            DCB=(RECFM=FB,LRECL=96,BLKSIZE=0,DSORG=PS)
//SZ035S2  DD DSN=HOM.SZ.DDATA_MOVIMENTO.SZEMB035.SAIDA2,
//            UNIT=SYSALLDA,DISP=(,CATLG,DELETE),
//            SPACE=(TRK,(500,100),RLSE),
//            DCB=(RECFM=FB,LRECL=56,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSIN    DD DUMMY
//SYSTSIN  DD *
    DSN    SYSTEM(DB2M)
    RUN    PROGRAM(SZEMB035) PLAN(SIASBAT) -
           LIB('HOM.V01.LOAD')            -
           PARMS('/ABTERMENC(ABEND)')
//E02IFEND ENDIF
//**       ========================================================
//**       RELATORIO DE APOLICES EMITIDAS PRESTAMISTA
//**       ========================================================
//******** RESTART=E013DELE
//E013DELE EXEC PGM=IEFBR14
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUT131 DD DISP=(MOD,DELETE),UNIT=SYSALLDA,SPACE=(TRK,(5,5)),
//         DSN=HOM.SZ.D190109.SZEMB189.APOL
//*
//E0150189 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SZB189S1 DD DSN=HOM.SZ.D190109.SZEMB189.APOL,
//         UNIT=SYSDA,DISP=(,CATLG,DELETE),
//         SPACE=(TRK,(1000,100),RLSE),
//         DCB=(RECFM=FB,LRECL=200,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSIN    DD *
//SYSTSIN  DD *
 DSN    SYSTEM(DB2M)
 RUN    PROGRAM(SZEMB189) PLAN(SIASBAT) -
        LIB('HOM.V01.LOAD')            -
        PARMS('/ABTERMENC(ABEND)')
//**       ========================================================
//**       GRAVACAO DOS ARQUIVOS DE SAIDA NA REDE
//**       ========================================================
//E015FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144 (EXIT'
//STEPLIB  DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD /UPLOAD/JV1/JDSZD04/SAIDA

PUT 'HOM.SZ.DDATA_MOVIMENTO.SZGLB002.SAIDA' +
     HOM.CGL_AX.C010.SMART_SZ.DDATA_MOVIMENTO.GLPRNLCA.01.TXT

PUT 'HOM.SZ.DDATA_MOVIMENTO.SZGLB003.SAIDA' +
     HOM.CGL_AX.C010.SMART_SZ.DDATA_MOVIMENTO.GLDESPCO.01.TXT

PUT 'HOM.SZ.DDATA_MOVIMENTO.SZGLB004.SAIDA' +
     HOM.CGL_AX.C010.SMART_SZ.DDATA_MOVIMENTO.GLPRCCED.01.TXT

PUT 'HOM.SZ.DDATA_MOVIMENTO.SZGLB001.GLSINLCA' +
     HOM.CGL_AX.C010.SMART_SZ.DDATA_MOVIMENTO.GLSINLCA.01.TXT

PUT 'HOM.SZ.DDATA_MOVIMENTO.SZGLB006.GLSICCED' +
     HOM.CGL_AX.C010.SMART_SZ.DDATA_MOVIMENTO.GLSICCED.01.TXT

PUT 'HOM.SZ.DDATA_MOVIMENTO.SZEMB076' +
     DC00.SIS06.20DATA_MOVIMENTO.ENVIO_SIGDC.01.TXT

PUT 'HOM.SZ.DDATA_MOVIMENTO.SZEMB069.PREMIO'  +
     HOM.SZ.DDATA_MOVIMENTO.SZEMB069.PREMIO.TXT

PUT 'HOM.SZ.DDATA_MOVIMENTO.SZEMB080.SINI' +
     HOM.SZ.DDATA_MOVIMENTO.SZEMB080.SINI.TXT

PUT 'HOM.SZ.DDATA_MOVIMENTO.SZEMB080.HIST' +
     HOM.SZ.DDATA_MOVIMENTO.SZEMB080.HIST.TXT

PUT 'HOM.SZ.DDATA_MOVIMENTO.SZEMB080.APOL' +
     HOM.SZ.DDATA_MOVIMENTO.SZEMB080.APOL.TXT

PUT 'HOM.SZ.DDATA_MOVIMENTO.SZEMB084.CXERRO' +
     HOM.SZ.DDATA_MOVIMENTO.SZEMB084.CXERRO.TXT

PUT 'HOM.SZ.DDATA_MOVIMENTO.SZEMB079.SIGDC01' +
     DC00.SIS06.D20DATA_MOVIMENTO.ENVIO_SIGDC.03.TXT

PUT 'HOM.SZ.DDATA_MOVIMENTO.SZEMB079.SIGDC02' +
     DC00.SIS06.D20DATA_MOVIMENTO.ENVIO_SIGDC.04.TXT

PUT 'HOM.SZ.DDATA_MOVIMENTO.SZEMB079.SIGDC03' +
     DC00.SIS06.D20DATA_MOVIMENTO.ENVIO_SIGDC.05.TXT

QUIT
//
