//VHSID03  JOB (00,PN),'ID_EXECUTOR',TIME=1440,
//         CLASS=A,MSGCLASS=T,MSGLEVEL=(1,1)
//*
/*ROUTE PRINT JES2PRD1
//*
//*DIARIA JV1. DATA:DATA_MOVIMENTO
//*DIARIA JV1. PERIODO:PERIODO_MOVIMENTO
//*DIARIA JV1. ANO MES:ANOMES_MOVIMENTO
//*DIARIA JV1. DIA:DIA_MOVIMENTO
//*DIARIA JV1. DATA ANTERIOR:DATA_ANTERIOR 
//*
//*********************************************************************
//JOBLIB   DD DISP=SHR,DSN=DSNC10.DB2H.SDSNLOAD
//         DD DISP=SHR,DSN=HOM.JV1.LOAD
//*********************************************************************
//*E000MAIL EXEC EMAIL1,R=JPSID03,P=$(C,TIME,HHMM),Q=2220
//*
//*******************************************************************
//**       DELECAO                                                ***
//*******************************************************************
//E000DL01 EXEC PGM=IEFBR14
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//DELETE01 DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0101B.L1VZ6,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE02 DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0102B.L1VZ6,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE03 DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0103B.L2VZ6,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE04 DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0104B.L1VZ6,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE05 DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0105B.L1VZ6,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE06 DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0106B.L1VZ6,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE07 DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0107B.L2VZ6,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE08 DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0108B.L1VZ6,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE09 DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0109B.L1VZ6,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE10 DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0110B.L1VZ6,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE11 DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0112B.L2VZ6,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE12 DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0120B.L1VZ6,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE13 DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0803B.L1VZ6,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE14 DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0805B.L1VZ6,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE15 DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0111B.L1VZ6,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE16 DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0806B.RENOSLID.L1VZ6,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE17 DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0807B.REEXTAVI,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE18 DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0808B.REEXTPAG,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE19 DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0809B.REEXTPCO,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE20 DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0810B.REEXTCAN,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE21 DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0811B.REEXTPEN,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE22 DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0812B.REAVIAPO.L1VZ6,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE23 DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0814B.REPGPERI.L1VZ6,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE24 DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0818B.SEGURO,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE25 DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0820B.RESINCI.L1VZ6,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE26 DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0836B.SIPGTAZU.L1VZ6,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE27 DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0077B.SIHAPLAN.L2V80,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE28 DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0078B.L1VZ6,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE29 DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0140B.L1VZ6,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE30 DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0843B,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE31 DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0843B.L1VZ6,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE32 DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0844B.L1VZ6,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE33 DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0845B.L1VZ6,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE34 DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0847B.L1VZ6,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE35 DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0848B.PGT.CRED.HABIT.TXT,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE36 DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0846B.L1VZ6,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE37 DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0029B.ARQCDG1,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE38 DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0029B.ARQCDG2,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE39 DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0850B.L1VZ6,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE40 DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0851B,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE41 DD DSN=HOM.INTERNET.DDATA_MOVIMENTO.SID03.NOVAPT,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE42 DD DSN=HOM.INTERNET.DDATA_MOVIMENTO.SID03.PPPT,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE43 DD DSN=HOM.INTERNET.DDATA_MOVIMENTO.SID03.PTPP,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE44 DD DSN=HOM.INTERNET.DDATA_MOVIMENTO.SID03.PTPT,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE45 DD DSN=HOM.INTERNET.DDATA_MOVIMENTO.SID03.SI0860B.CESTA, 
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE46 DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0861B,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE47 DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0133B,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE48 DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0863B,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE49 DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0863B.SORT,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE50 DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0868B,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE51 DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0867B,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE52 DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0869B,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE53 DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0095B,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE54 DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0862B,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE55 DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0864B,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE56 DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0045B,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE57 DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0032B,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE58 DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0033B,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE59 DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0034B,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE60 DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0035B,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE61 DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0036B,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE62 DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0037B,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE63 DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0038B,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE64 DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0874B.ARQANAL.DIARIO,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE65 DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0882B.ARQCALC.TXT,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE66 DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0896B.ARQMATC,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE67 DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0857B.ARQGETER.DIA,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE68 DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0857B.ARQGITER.DIA,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE69 DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0857B.ARQGILIE.DIA,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE70 DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0857B.ARQGEPOI.DIA,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE71 DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0857B.ARQFUNCE.DIA,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE72 DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0857B.ARQCONSO.DIA,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE73 DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0884B.FASES.ANTIGOS,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE74 DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0888B,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE75 DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0891B.FENAE01,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE76 DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0890B.LOTER01,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE77 DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0901B.FENASEG,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE78 DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0901B.L1VZ6,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE79 DD DSN=HOM.INTERNET.DDATA_MOVIMENTO.SID03.SI0201B,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE80 DD DSN=HOM.INTERNET.DDATA_MOVIMENTO.SID03.SI0202B,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE81 DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0042B,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE82 DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0048B,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE83 DD DSN=HOM.SI.DDATA_MOVIMENTO.SI2010B,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE84 DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0234B.SAIDA,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE85 DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0134B.PRELIB,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE86 DD DSN=HOM.SI.DDATA_MOVIMENTO.SI9111B.CVPAGSIN,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE88 DD DSN=HOM.SI.DDATA_MOVIMENTO.SI9115B.CVPAGSIN.SEMNSGD,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE89 DD   DSN=HOM.SI.DDATA_MOVIMENTO.SI9147B.CVPAGSIN,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE90 DD   DSN=HOM.SI.DDATA_MOVIMENTO.SI9147B.CVPAGSIN.SEMNSGD,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE91 DD DSN=HOM.SI.DDATA_MOVIMENTO.SI9148B.CVPAGSIN,  
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE92 DD DSN=HOM.SI.DDATA_MOVIMENTO.SI9148B.CVPAGSIN.SEMNSGD,
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE93 DD DSN=HOM.SI.DDATA_MOVIMENTO.SI9168B.CVPAGSIN,  
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE94 DD DSN=HOM.SI.DDATA_MOVIMENTO.SI9169B.CVPAGSIN, 
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE95 DD DSN=HOM.SI.DDATA_MOVIMENTO.SI9211B.CSPAGSIN,  
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE96 DD DSN=HOM.SI.DDATA_MOVIMENTO.SI9215B.CSPAGSIN, 
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE97 DD DSN=HOM.SI.DDATA_MOVIMENTO.SI9247B.CSPAGSIN, 
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE98 DD DSN=HOM.SI.DDATA_MOVIMENTO.SI9248B.CSPAGSIN,   
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELETE99 DD DSN=HOM.SI.DDATA_MOVIMENTO.SI9268B.CSPAGSIN,  
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//DELET100 DD DSN=HOM.SI.DDATA_MOVIMENTO.SI9269B.CSPAGSIN,  
//         DISP=(MOD,DELETE,DELETE),UNIT=3390,SPACE=(TRK,(1,1))
//*
//*************************************************************
//E0010000 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0000B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//E0020101 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//PRINTER  DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0101B.L1VZ6,DISP=(,CATLG),
//         SPACE=(TRK,(1,150),RLSE),UNIT=SYSDA,
//         DCB=(RECFM=FB,LRECL=133,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0101B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//E0030102 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//PRINTER  DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0102B.L1VZ6,DISP=(,CATLG),
//         SPACE=(TRK,(1,150),RLSE),UNIT=SYSDA,
//         DCB=(RECFM=FB,LRECL=133,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0102B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//E0040103 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//PRINTER  DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0103B.L2VZ6,DISP=(,CATLG),
//         SPACE=(TRK,(1,150),RLSE),UNIT=SYSDA,
//         DCB=(RECFM=FB,LRECL=133,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0103B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//E0050104 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//PRINTER  DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0104B.L1VZ6,DISP=(,CATLG),
//         SPACE=(TRK,(1,150),RLSE),UNIT=SYSDA,
//         DCB=(RECFM=FB,LRECL=133,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0104B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//E0060105 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//PRINTER  DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0105B.L1VZ6,DISP=(,CATLG),
//         SPACE=(TRK,(1,150),RLSE),UNIT=SYSDA,
//         DCB=(RECFM=FB,LRECL=133,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0105B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//E0070106 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//PRINTER  DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0106B.L1VZ6,DISP=(,CATLG),
//         SPACE=(TRK,(1,150),RLSE),UNIT=SYSDA,
//         DCB=(RECFM=FB,LRECL=133,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0106B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//E0080107 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//PRINTER  DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0107B.L2VZ6,DISP=(,CATLG),
//         SPACE=(TRK,(1,150),RLSE),UNIT=SYSDA,
//         DCB=(RECFM=FB,LRECL=133,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0107B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//E0090108 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//PRINTER  DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0108B.L1VZ6,DISP=(,CATLG),
//         SPACE=(TRK,(1,150),RLSE),UNIT=SYSDA,
//         DCB=(RECFM=FB,LRECL=133,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0108B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//E0100109 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//PRINTER  DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0109B.L1VZ6,DISP=(,CATLG),
//         SPACE=(TRK,(1,150),RLSE),UNIT=SYSDA,
//         DCB=(RECFM=FB,LRECL=133,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0109B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//E0110110 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//PRINTER  DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0110B.L1VZ6,DISP=(,CATLG),
//         SPACE=(TRK,(1,150),RLSE),UNIT=SYSDA,
//         DCB=(RECFM=FB,LRECL=133,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0110B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//E0120112 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//PRINTER  DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0112B.L2VZ6,DISP=(,CATLG),
//         SPACE=(TRK,(50,50),RLSE),UNIT=SYSDA,
//         DCB=(RECFM=FB,LRECL=133,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0112B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//E0130120 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//PRINTER  DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0120B.L1VZ6,DISP=(,CATLG),
//         SPACE=(TRK,(50,50),RLSE),UNIT=SYSDA,
//         DCB=(RECFM=FB,LRECL=133,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0120B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//E0140803 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//PRINTER  DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0803B.L1VZ6,DISP=(,CATLG),
//         SPACE=(TRK,(50,50),RLSE),UNIT=SYSDA,
//         DCB=(RECFM=FB,LRECL=133,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0803B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//***  PROGRAMA DESATIVADO RM040149-1014 - DIEGO DIAS - 11/05/2015   **
//*********************************************************************
//*E0150804 EXEC PGM=IKJEFT01,DYNAMNBR=20
//*SYSTSPRT DD SYSOUT=*
//*SYSPRINT DD SYSOUT=*
//*SYSUDUMP DD SYSOUT=Z
//*SYSOUT   DD SYSOUT=*
//*PRINTER  DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0804B.L1VZ6,DISP=(,CATLG),
//*         SPACE=(TRK,(50,50),RLSE),UNIT=SYSDA,
//*         DCB=(RECFM=FB,LRECL=133,BLKSIZE=0,DSORG=PS)
//*SYSDBOUT DD SYSOUT=*
//*SYSABOUT DD SYSOUT=*
//*SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0804B),DISP=SHR
//*SYSIN    DD DUMMY
//*
//*********************************************************************
//E0160805 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//PRINTER  DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0805B.L1VZ6,DISP=(,CATLG),
//         SPACE=(TRK,(50,50),RLSE),UNIT=SYSDA,
//         DCB=(RECFM=FB,LRECL=133,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0805B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//E0170111 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//PRINTER  DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0111B.L1VZ6,DISP=(,CATLG),
//         SPACE=(TRK,(50,50),RLSE),UNIT=SYSDA,
//         DCB=(RECFM=FB,LRECL=133,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0111B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//E0180806 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//PRINTER  DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0806B.RENOSLID.L1VZ6,
//         UNIT=SYSDA,DISP=(,CATLG,DELETE),
//         SPACE=(TRK,(50,50),RLSE),
//         DCB=(RECFM=FB,LRECL=132,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0806B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//E0190807 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0807B),DISP=SHR
//SYSIN    DD DUMMY
//PRINTER  DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0807B.REEXTAVI,
//         UNIT=SYSDA,DISP=(,CATLG,DELETE),
//         SPACE=(TRK,(50,50),RLSE),
//         DCB=(RECFM=FB,LRECL=150,BLKSIZE=0,DSORG=PS)
//SYSOUT   DD SYSOUT=*
//*
//*********************************************************************
//E0200808 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0808B),DISP=SHR
//SYSIN    DD DUMMY
//PRINTER  DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0808B.REEXTPAG,
//         UNIT=SYSDA,DISP=(,CATLG,DELETE),
//         SPACE=(TRK,(50,50),RLSE),
//         DCB=(RECFM=FB,LRECL=150,BLKSIZE=0,DSORG=PS)
//SYSOUT   DD SYSOUT=*
//*
//*********************************************************************
//E0210809 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0809B),DISP=SHR
//SYSIN    DD DUMMY
//PRINTER  DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0809B.REEXTPCO,
//         UNIT=SYSDA,DISP=(,CATLG,DELETE),
//         SPACE=(TRK,(50,50),RLSE),
//         DCB=(RECFM=FB,LRECL=150,BLKSIZE=0,DSORG=PS)
//SYSOUT   DD SYSOUT=*
//*
//*********************************************************************
//E0220810 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0810B),DISP=SHR
//SYSIN    DD DUMMY
//PRINTER  DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0810B.REEXTCAN,
//         UNIT=SYSDA,DISP=(,CATLG,DELETE),
//         SPACE=(TRK,(50,50),RLSE),
//         DCB=(RECFM=FB,LRECL=150,BLKSIZE=0,DSORG=PS)
//SYSOUT   DD SYSOUT=*
//*
//*********************************************************************
//E0230811 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0811B),DISP=SHR
//SYSIN    DD DUMMY
//PRINTER  DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0811B.REEXTPEN,
//         UNIT=SYSDA,DISP=(,CATLG,DELETE),
//         SPACE=(TRK,(50,50),RLSE),
//         DCB=(RECFM=FB,LRECL=150,BLKSIZE=0,DSORG=PS)
//SYSOUT   DD SYSOUT=*
//*
//*********************************************************************
//E0240812 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0812B),DISP=SHR
//SYSIN    DD DUMMY
//PRINTER  DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0812B.REAVIAPO.L1VZ6,
//         UNIT=SYSDA,DISP=(,CATLG,DELETE),
//         SPACE=(TRK,(50,50),RLSE),
//         DCB=(RECFM=FB,LRECL=133,BLKSIZE=0,DSORG=PS)
//*
//*********************************************************************
//E0250814 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//PRINTER  DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0814B.REPGPERI.L1VZ6,
//         UNIT=SYSDA,DISP=(,CATLG,DELETE),
//         SPACE=(TRK,(50,50),RLSE),
//         DCB=(RECFM=FB,LRECL=133,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0814B),DISP=SHR
//SYSIN    DD DUMMY
//*
//E0260818 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0818B),DISP=SHR
//SYSIN    DD DUMMY
//SI0818A1 DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0818B.SEGURO,
//         UNIT=SYSDA,DISP=(,CATLG,DELETE),
//         SPACE=(TRK,(1,150),RLSE),
//         DCB=(RECFM=FBA,LRECL=346,BLKSIZE=0,DSORG=PS)
//SI0818A2 DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0818B.COSSEGUR,
//         UNIT=SYSDA,DISP=(,CATLG,DELETE),
//         SPACE=(TRK,(1,150),RLSE),
//         DCB=(RECFM=FBA,LRECL=346,BLKSIZE=0,DSORG=PS)
//*
//*********************************************************************
//E0270820 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0820B),DISP=SHR
//SYSIN    DD DUMMY
//PRINTER  DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0820B.RESINCI.L1VZ6,
//         UNIT=SYSDA,DISP=(,CATLG,DELETE),
//         SPACE=(TRK,(50,50),RLSE),
//         DCB=(RECFM=FB,LRECL=133,BLKSIZE=0,DSORG=PS)
//*
//*********************************************************************
//E0280836 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SIPGTAZU DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0836B.SIPGTAZU.L1VZ6,
//         UNIT=SYSDA,DISP=(,CATLG,DELETE),
//         SPACE=(TRK,(50,50),RLSE),
//         DCB=(RECFM=FB,LRECL=133,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0836B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//E0290077 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0077B),DISP=SHR
//SYSIN    DD DUMMY
//SIHAPLAN DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0077B.SIHAPLAN.L2V80,
//         UNIT=SYSDA,DISP=(,CATLG,DELETE),
//         SPACE=(TRK,(50,50),RLSE),
//         DCB=(RECFM=FB,LRECL=81,BLKSIZE=0,DSORG=PS)
//*
//*********************************************************************
//E0300078 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SI0078BR DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0078B.L1VZ6,
//         UNIT=SYSDA,DISP=(,CATLG,DELETE),
//         SPACE=(TRK,(50,50),RLSE),
//         DCB=(RECFM=FB,LRECL=133,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0078B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//E0310140 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//PRINTER  DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0140B.L1VZ6,
//         UNIT=SYSDA,DISP=(,CATLG,DELETE),
//         SPACE=(TRK,(50,50),RLSE),
//         DCB=(RECFM=FB,LRECL=133,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0140B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//E0320843 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SI0843   DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0843B,
//         UNIT=SYSDA,DISP=(,CATLG,DELETE),
//         SPACE=(TRK,(50,50),RLSE),
//         DCB=(RECFM=FB,LRECL=133,BLKSIZE=0,DSORG=PS)
//PRINTER  DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0843B.L1VZ6,
//         UNIT=SYSDA,DISP=(,CATLG,DELETE),
//         SPACE=(TRK,(50,50),RLSE),
//         DCB=(RECFM=FB,LRECL=132,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0843B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//E0330844 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//PRINTER  DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0844B.L1VZ6,
//         UNIT=SYSDA,DISP=(,CATLG,DELETE),
//         SPACE=(TRK,(50,50),RLSE),
//         DCB=(RECFM=FB,LRECL=133,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0844B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//E0340845 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//PRINTER  DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0845B.L1VZ6,
//         UNIT=SYSDA,DISP=(,CATLG,DELETE),
//         SPACE=(TRK,(50,50),RLSE),
//         DCB=(RECFM=FB,LRECL=133,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0845B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//E0350847 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//PRINTER  DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0847B.L1VZ6,
//         UNIT=SYSDA,DISP=(,CATLG,DELETE),
//         SPACE=(TRK,(50,50),RLSE),
//         DCB=(RECFM=FB,LRECL=133,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0847B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//E0360848 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//ARQSAIDA DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0848B.PGT.CRED.HABIT.TXT,
//         UNIT=SYSDA,DISP=(,CATLG,DELETE),
//         SPACE=(TRK,(50,50),RLSE),
//         DCB=(RECFM=FB,LRECL=202,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0848B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//E0370846 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//PRINTER  DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0846B.L1VZ6,
//         UNIT=SYSDA,DISP=(,CATLG,DELETE),
//         SPACE=(TRK,(50,50),RLSE),
//         DCB=(RECFM=FB,LRECL=133,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0846B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//E0380029 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//ARQCDG1  DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0029B.ARQCDG1,
//         UNIT=SYSDA,DISP=(,CATLG,DELETE),
//         SPACE=(TRK,(1,500),RLSE),
//         DCB=(RECFM=FB,LRECL=400,BLKSIZE=0,DSORG=PS)
//ARQCDG2  DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0029B.ARQCDG2,
//         UNIT=SYSDA,DISP=(,CATLG,DELETE),
//         SPACE=(TRK,(1,500),RLSE),
//         DCB=(RECFM=FB,LRECL=388,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0029B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//E0390850 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//PRINTER  DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0850B.L1VZ6,
//         UNIT=SYSDA,DISP=(,CATLG,DELETE),
//         SPACE=(TRK,(50,50),RLSE),
//         DCB=(RECFM=FB,LRECL=133,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0850B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//E0400851 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//ARQMOV   DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0851B,DISP=(,CATLG,),
//         SPACE=(TRK,(100,50),RLSE),UNIT=SYSDA,
//         DCB=(RECFM=FB,LRECL=600,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0851B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//E0410853 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//NOVAPT   DD DSN=HOM.INTERNET.DDATA_MOVIMENTO.SID03.NOVAPT,DISP=(,CATLG,),
//         SPACE=(TRK,(100,50),RLSE),UNIT=SYSDA,
//         DCB=(RECFM=FB,LRECL=288,BLKSIZE=0,DSORG=PS)
//PPPT     DD DSN=HOM.INTERNET.DDATA_MOVIMENTO.SID03.PPPT,DISP=(,CATLG,),
//         SPACE=(TRK,(100,50),RLSE),UNIT=SYSDA,
//         DCB=(RECFM=FB,LRECL=288,BLKSIZE=0,DSORG=PS)
//PTPP     DD DSN=HOM.INTERNET.DDATA_MOVIMENTO.SID03.PTPP,DISP=(,CATLG,),
//         SPACE=(TRK,(100,50),RLSE),UNIT=SYSDA,
//         DCB=(RECFM=FB,LRECL=288,BLKSIZE=0,DSORG=PS)
//PTPT     DD DSN=HOM.INTERNET.DDATA_MOVIMENTO.SID03.PTPT,DISP=(,CATLG,),
//         SPACE=(TRK,(100,50),RLSE),UNIT=SYSDA,
//         DCB=(RECFM=FB,LRECL=288,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0853B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//E0420860 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SI0860BA DD DISP=(,CATLG,),
//         DSN=HOM.INTERNET.DDATA_MOVIMENTO.SID03.SI0860B.CESTA,
//         SPACE=(TRK,(10,50),RLSE),UNIT=SYSDA,
//         DCB=(RECFM=FB,LRECL=360,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0860B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//E0430861 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SAIDA    DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0861B,DISP=(,CATLG,),
//         SPACE=(TRK,(10,50),RLSE),UNIT=SYSDA,
//         DCB=(RECFM=FB,LRECL=150,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0861B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//E0440133 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//RSI0133B DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0133B,
//         UNIT=SYSDA,DISP=(,CATLG,DELETE),
//         SPACE=(TRK,(150,50),RLSE),
//         DCB=(RECFM=FB,LRECL=133,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0133B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//E0450900 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0900B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//E0460863 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//PRINTER  DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0863B,
//         DISP=(,CATLG,DELETE),UNIT=SYSDA,
//         SPACE=(TRK,(50,50),RLSE),
//         DCB=(,RECFM=FB,LRECL=3500,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0863B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//         IF E0460863.RC = 00 THEN
//E047SORT EXEC PGM=SORT,REGION=0M
//SYSPRINT DD SYSOUT=*
//SORTMSG  DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SORTIN   DD DISP=SHR,
//         DSN=HOM.SI.DDATA_MOVIMENTO.SI0863B
//SORTOUT  DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0863B.SORT,
//         DISP=(,CATLG,DELETE),
//         UNIT=SYSDA,SPACE=(TRK,(50,50),RLSE),
//         DCB=(RECFM=FB,LRECL=3500,BLKSIZE=0,DSORG=PS)
//SORTWK01 DD UNIT=SYSALLDA,SPACE=(CYL,(15,15))
//SORTWK02 DD UNIT=SYSALLDA,SPACE=(CYL,(15,15))
//SORTWK03 DD UNIT=SYSALLDA,SPACE=(CYL,(15,15))
//SYSIN    DD DISP=SHR,DSN=HOM.JV1.SYSIN(PSEMD01)
//         ENDIF
//*
//*********************************************************************
//E0480038 EXEC PGM=IKJEFT01,DYNAMNBR=20,REGION=0M
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//IFC0038B DD DISP=SHR,
//         DSN=HOM.SI.DDATA_MOVIMENTO.SI0863B.SORT
//RFC038B1 DD DUMMY
//RFC038B2 DD DUMMY
//CEPERROS DD DUMMY
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(FC0038B),DISP=SHR
//SYSIN    DD DUMMY
//PARAM    DD *
02
//*
//*********************************************************************
//E0490868 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SAIDA    DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0868B,
//         DISP=(,CATLG,DELETE),UNIT=SYSDA,
//         SPACE=(TRK,(50,50),RLSE),
//         DCB=(,RECFM=FB,LRECL=400,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0868B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//E0500867 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SAIDA    DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0867B,
//         DISP=(,CATLG,DELETE),UNIT=SYSDA,
//         SPACE=(TRK,(250,50),RLSE),
//         DCB=(,RECFM=FB,LRECL=950,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0867B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//E0510869 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SAIDA    DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0869B,
//         DISP=(,CATLG,DELETE),UNIT=SYSDA,
//         SPACE=(TRK,(250,50),RLSE),
//         DCB=(,RECFM=FB,LRECL=700,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0869B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//E0520095 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//PRINTER  DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0095B,
//         DISP=(,CATLG,DELETE),UNIT=SYSDA,
//         SPACE=(TRK,(250,50),RLSE),
//         DCB=(,RECFM=FB,LRECL=80,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0095B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//E0530862 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SAIDA    DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0862B,
//         DISP=(,CATLG,DELETE),UNIT=SYSDA,
//         SPACE=(TRK,(250,50),RLSE),
//         DCB=(,RECFM=FB,LRECL=170,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0862B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//E0540864 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SAIDA    DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0864B,
//         DISP=(,CATLG,DELETE),UNIT=SYSDA,
//         SPACE=(TRK,(250,50),RLSE),
//         DCB=(,RECFM=FB,LRECL=650,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0864B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//E0550031 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0031B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//*===================================================================*
//*   FUNCAO :                                                        *
//*   - GERA O CANCELAMENTO DOS SINISTROS COM DOCUMENTOS PENDENTES    *
//*   (TED) APOS 30 DIAS DA EMISSAO DA 3ª REITECAO DO TED, SOLICI-    *
//*   TANDO OS DOCUMENTOS PENDENTES. FAZ O CANCELAMENTO SOMENTE       *
//*   PARA ARQUIVO DO PROCESSO PODENDO SER O SINISTRO REATIVADO A     *
//*   QUALQUER MOMENTO.                                               *
//*   - FAZ EMISSAO DE RELATORIO COM ESSES SINISTROS CANCELADOS       *
//*   PARA GEPOC                                                      *
//*   ARQUIVO SAIDA..: "PRINTER" TAMANHO=132, SERA IMRRESSO E ENVIADO *
//*                    PARA A GEPOC AOS CUIDADOS DA DANIELLA          *
//*   CASO ABEND.....: PULAR PARA O ESTEPE SEGUINTE                   *
//*===================================================================*
//E0560045 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//PRINTER  DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0045B,
//         DISP=(,CATLG,DELETE),UNIT=SYSDA,
//         SPACE=(TRK,(50,50),RLSE),
//         DCB=(,RECFM=FB,LRECL=133,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0045B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//E0570032 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SI0032B1 DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0032B,
//         DISP=(,CATLG,DELETE),UNIT=SYSDA,
//         SPACE=(TRK,(50,50),RLSE),
//         DCB=(,RECFM=FB,LRECL=200,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0032B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//E0580033 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SI0033B1 DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0033B,
//         DISP=(,CATLG,DELETE),UNIT=SYSDA,
//         SPACE=(TRK,(50,50),RLSE),
//         DCB=(,RECFM=FB,LRECL=200,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0033B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//E0590034 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SI0034B1 DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0034B,
//         DISP=(,CATLG,DELETE),UNIT=SYSDA,
//         SPACE=(TRK,(50,50),RLSE),
//         DCB=(,RECFM=FB,LRECL=200,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0034B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//E0600035 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SI0035B1 DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0035B,
//         DISP=(,CATLG,DELETE),UNIT=SYSDA,
//         SPACE=(TRK,(50,50),RLSE),
//         DCB=(,RECFM=FB,LRECL=200,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0035B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//E0610036 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SI0036B1 DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0036B,
//         DISP=(,CATLG,DELETE),UNIT=SYSDA,
//         SPACE=(TRK,(50,50),RLSE),
//         DCB=(,RECFM=FB,LRECL=200,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0036B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//E0620037 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SI0037B1 DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0037B,
//         DISP=(,CATLG,DELETE),UNIT=SYSDA,
//         SPACE=(TRK,(50,50),RLSE),
//         DCB=(,RECFM=FB,LRECL=200,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0037B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//*###################################################################
//* ATENCAO ATENCAO ATENCAO ATENCAO
//*
//* ESTE STEP LIBERA ROTINAS NO ZEKE , CASO SEJA RENUMERADO
//* ALTERAR NO ZEKE ANTES DE INICIAR... OK EXEMPLO - LIBERA A HBD00
//*                                                  LIBERA A SID05
//*###################################################################
//E0630038 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SI0038B1 DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0038B,
//         DISP=(,CATLG,DELETE),UNIT=SYSDA,
//         SPACE=(TRK,(50,50),RLSE),
//         DCB=(,RECFM=FB,LRECL=200,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0038B),DISP=SHR
//SYSIN    DD DUMMY
//*
//******************************************************************
//E0640874 EXEC  PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//ARQANAL DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0874B.ARQANAL.DIARIO,
//         DISP=(,CATLG),
//         SPACE=(TRK,(1500,100),RLSE),UNIT=SYSDA,
//         DCB=(RECFM=FB,LRECL=800,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0874B),DISP=SHR
//         DD DSN=HOM.JV1.SYSIN(SI0874B1),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//E0650882 EXEC  PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//ARQCALC DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0882B.ARQCALC.TXT,
//         DISP=(,CATLG),
//         SPACE=(TRK,(1,500),RLSE),UNIT=SYSDA,
//         DCB=(RECFM=FB,LRECL=600,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0882B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//E0660896 EXEC  PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//ARQMATC  DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0896B.ARQMATC,
//         DISP=(,CATLG),
//         SPACE=(TRK,(1,500),RLSE),UNIT=SYSDA,
//         DCB=(RECFM=FB,LRECL=600,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0896B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//E0680857 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//ARQGEMAN DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0857B.ARQGETER.DIA,DISP=(,CATLG,),
//         SPACE=(TRK,(10,50),RLSE),UNIT=SYSDA,
//         DCB=(RECFM=FB,LRECL=250,BLKSIZE=0,DSORG=PS)
//ARQGEHAB DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0857B.ARQGITER.DIA,DISP=(,CATLG,),
//         SPACE=(TRK,(10,50),RLSE),UNIT=SYSDA,
//         DCB=(RECFM=FB,LRECL=250,BLKSIZE=0,DSORG=PS)
//ARQGILIE DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0857B.ARQGILIE.DIA,DISP=(,CATLG,),
//         SPACE=(TRK,(10,50),RLSE),UNIT=SYSDA,
//         DCB=(RECFM=FB,LRECL=250,BLKSIZE=0,DSORG=PS)
//ARQGEPOI DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0857B.ARQGEPOI.DIA,DISP=(,CATLG,),
//         SPACE=(TRK,(250,50),RLSE),UNIT=SYSDA,
//         DCB=(RECFM=FB,LRECL=250,BLKSIZE=0,DSORG=PS)
//ARQFUNCE DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0857B.ARQFUNCE.DIA,DISP=(,CATLG,),
//         SPACE=(TRK,(250,50),RLSE),UNIT=SYSDA,
//         DCB=(RECFM=FB,LRECL=250,BLKSIZE=0,DSORG=PS)
//ARQCONSO DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0857B.ARQCONSO.DIA,DISP=(,CATLG,),
//         SPACE=(TRK,(250,50),RLSE),UNIT=SYSDA,
//         DCB=(RECFM=FB,LRECL=250,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0857B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//E0690884 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//RSICV23B DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0884B.FASES.ANTIGOS,
//         DISP=(,CATLG,),
//         SPACE=(TRK,(350,50),RLSE),UNIT=SYSDA,
//         DCB=(RECFM=FB,LRECL=200,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0884B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//E0700888 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//ARQESTOR DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0888B,DISP=(,CATLG,),
//         SPACE=(TRK,(350,50),RLSE),UNIT=SYSDA,
//         DCB=(RECFM=FB,LRECL=200,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSIN    DD DUMMY
//SYSTSIN  DD *
  DSN SYSTEM(DB2H)
    RUN PROGRAM(SI0888B) PLAN(SIASBAT) LIB('HOM.JV1.LOAD') -
    PARMS('/ABTERMENC(ABEND)') PARM('D')
  END
//*
//**
//*********************************************************************
//E0730891 EXEC  PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//FENAE01  DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0891B.FENAE01,
//         DISP=(,CATLG),
//         SPACE=(TRK,(350,50),RLSE),UNIT=SYSDA,
//         DCB=(RECFM=FB,LRECL=600,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0891B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//E0740890 EXEC  PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//LOTER01  DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0890B.LOTER01,DISP=(,CATLG),
//         SPACE=(TRK,(350,50),RLSE),UNIT=SYSDA,
//         DCB=(RECFM=FB,LRECL=615,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0890B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//E0750901 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//*
//MOVPREV  DD DISP=SHR,
//         DSN=HOM.DEL.SID03.MOVPREV
//*
//MOVFENAS DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0901B.FENASEG,
//         UNIT=SYSDA,DISP=(,CATLG,DELETE),
//         SPACE=(TRK,(500,50),RLSE),
//         DCB=(RECFM=FBA,LRECL=380,BLKSIZE=0,DSORG=PS)
//RSI0901B DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0901B.L1VZ6,
//         UNIT=SYSDA,DISP=(,CATLG,DELETE),
//         SPACE=(TRK,(50,050),RLSE),
//         DCB=(RECFM=FBA,LRECL=132,BLKSIZE=0,DSORG=PS)
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0901B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//E0760201 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SAIDA    DD DISP=(,CATLG,),
//         DSN=HOM.INTERNET.DDATA_MOVIMENTO.SID03.SI0201B,
//         SPACE=(TRK,(1500,500),RLSE),UNIT=SYSDA,
//         DCB=(RECFM=FB,LRECL=600,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0201B),DISP=SHR
//         DD DSN=HOM.JV1.SYSIN(SI0201B1),DISP=SHR
//SYSIN    DD DUMMY
//*
//*******************************************************************
//E0770202 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SAIDA    DD DISP=(,CATLG,),
//         DSN=HOM.INTERNET.DDATA_MOVIMENTO.SID03.SI0202B,
//         SPACE=(TRK,(5000,1500),RLSE),UNIT=SYSDA,
//         DCB=(RECFM=FB,LRECL=600,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0202B),DISP=SHR
//         DD DSN=HOM.JV1.SYSIN(SI0202B1),DISP=SHR
//SYSIN    DD DUMMY
//*
//******************************************************************
//E0780042 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SI0042B1 DD DISP=(,CATLG,),
//         DSN=HOM.REL.DDATA_MOVIMENTO.SI0042B,
//         SPACE=(TRK,(500,50),RLSE),UNIT=SYSDA,
//         DCB=(RECFM=FB,LRECL=190,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0042B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//E0790048 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SI0048B1 DD DISP=(,CATLG),
//         DSN=HOM.SI.DDATA_MOVIMENTO.SI0048B,
//         SPACE=(TRK,(1,300),RLSE),UNIT=SYSDA,
//         DCB=(RECFM=FBA,LRECL=215,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0048B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//***  PROGRAMA INIBIDO -  RM066234-0618 - JULIANA LACERDA
//*********************************************************************
//* E0800044 EXEC PGM=IKJEFT01,DYNAMNBR=20
//* SYSTSPRT DD SYSOUT=*
//* SYSPRINT DD SYSOUT=*
//* SYSUDUMP DD SYSOUT=Z
//* SYSOUT   DD SYSOUT=*
//* RELJURID DD DISP=(,CATLG),
//*          DSN=HOM.REL.DDATA_MOVIMENTO.SI0044B.RELJURID,
//*          SPACE=(TRK,(500,50),RLSE),UNIT=SYSDA,
//*          DCB=(RECFM=FBA,LRECL=232,BLKSIZE=0,DSORG=PS)
//* RELJUXLS DD DISP=(,CATLG),
//*         DSN=HOM.REL.DDATA_MOVIMENTO.SI0044B.RELJUXLS,
//*         SPACE=(TRK,(500,50),RLSE),UNIT=SYSDA,
//*         DCB=(RECFM=FBA,LRECL=250,BLKSIZE=0,DSORG=PS)
//* SYSDBOUT DD SYSOUT=*
//* SYSABOUT DD SYSOUT=*
//* SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0044B),DISP=SHR
//* SYSIN    DD DUMMY
//*
//*********************************************************************
//***  PROGRAMA INIBIDO -  RM022248-1011  - JEFFERSON PRADO
//*********************************************************************
//*E0810099 EXEC PGM=IKJEFT01,DYNAMNBR=20
//*SYSTSPRT DD SYSOUT=*
//*SYSPRINT DD SYSOUT=*
//*SYSUDUMP DD SYSOUT=Z
//*SYSOUT   DD SYSOUT=*
//*SI0099B1 DD DISP=(,CATLG,DELETE),
//*         DSN=HOM.REL.DDATA_MOVIMENTO.SI0099B1,
//*         SPACE=(TRK,(500,50),RLSE),UNIT=SYSDA,
//*         DCB=(RECFM=FB,LRECL=3500,BLKSIZE=0,DSORG=PS)
//*
//*SI0099B2 DD DUMMY,
//*         DISP=(,CATLG,DELETE),
//*         DSN=HOM.REL.DDATA_MOVIMENTO.SI0099B2,
//*         SPACE=(TRK,(500,50),RLSE),UNIT=SYSDA,
//*         DCB=(RECFM=FBA,LRECL=133,BLKSIZE=0,DSORG=PS)
//*
//*RELERRO  DD DISP=(,CATLG,DELETE),
//*        DSN=HOM.REL.DDATA_MOVIMENTO.SI0099B.RELERRO,
//*        SPACE=(TRK,(500,50),RLSE),UNIT=SYSDA,
//*        DCB=(RECFM=FB,LRECL=132,BLKSIZE=0,DSORG=PS)
//*
//*SORTCNTL DD DSN=HOM.JV1.SYSIN(SORTCNTL),DISP=SHR
//*SORTWK01 DD UNIT=SYSALLDA,SPACE=(CYL,(50,50),RLSE)
//*SORTWK02 DD UNIT=SYSALLDA,SPACE=(CYL,(50,50),RLSE)
//*SORTWK03 DD UNIT=SYSALLDA,SPACE=(CYL,(50,50),RLSE)
//*SYSDBOUT DD SYSOUT=*
//*SYSABOUT DD SYSOUT=*
//*SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0099B),DISP=SHR
//*SYSIN    DD DUMMY
//*
//*********************************************************************
//E0822010 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SI2010B1 DD DISP=(,CATLG,DELETE),
//         DSN=HOM.SI.DDATA_MOVIMENTO.SI2010B,
//         SPACE=(TRK,(500,50),RLSE),UNIT=SYSDA,
//         DCB=(RECFM=FB,LRECL=230,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI2010B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//*#################################################################
//**- CAPTURA O ARQUIVO : NTSERVERCPD\RESSARCIMENTOWEB\
//**- \SOLICITA_RECIBO_INDENIZACAO_SI0234B.TXT
//**- NAO EH OBRIGADO A EXISTIR NA BAIXA. NAO PODE COLOCAR (EXIT
//*#################################################################
//E083GET  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//STEPLIB  DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
LOCSITE UNIT=SYSDA
LOCSITE TRACKS
LOCSITE PRIMARY=5
LOCSITE SECONDARY=50
LOCSITE LRECL=100 BLKSIZE=0 RECFM=FB
CD UPLOAD\JV1-SIAS\ENTRADA_RECUPERADA\DATA_MOVIMENTO
GET HOM.SI.DDATA_MOVIMENTO.SI0234B.RECIBO.INDENI.TXT +
    'HOM.SI.DDATA_MOVIMENTO.SI0234B.RECIBO.INDENI.TXT'
QUIT
//*
//*********************************************************************
//E084LIST EXEC  PGM=IKJEFT01,
// PARM=('PRDFULL HOM.SI.DDATA_MOVIMENTO.SI0234B.RECIBO.INDENI.TXT')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//*********************************************************************
//         IF E084LIST.RC = 00 THEN
//E0850034 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//*
//ARQENT   DD DISP=SHR,
//         DSN=HOM.SI.DDATA_MOVIMENTO.SI0234B.RECIBO.INDENI.TXT
//*
//ARQRET   DD DISP=(,CATLG,CATLG),
//         DSN=HOM.SI.DDATA_MOVIMENTO.SI0234B.SAIDA,
//         SPACE=(TRK,(50,50),RLSE),UNIT=SYSDA,
//         DCB=(RECFM=FB,LRECL=100,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0234B),DISP=SHR
//SYSIN    DD DUMMY
//         ENDIF
//*
//*********************************************************************
//E0860134 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SAI0134B DD DSN=HOM.REL.DDATA_MOVIMENTO.SI0134B.PRELIB,
//         UNIT=SYSDA,DISP=(,CATLG,DELETE),
//         SPACE=(TRK,(500,50),RLSE),
//         DCB=(RECFM=FB,LRECL=133,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI0134B),DISP=SHR
//SYSIN    DD DUMMY
//*
//*********************************************************************
//***** RM027808-0812  ************************************************
//*********************************************************************
//*E0870883 EXEC PGM=IKJEFT01,DYNAMNBR=20
//*SYSTSPRT DD SYSOUT=*
//*SYSPRINT DD SYSOUT=*
//*SYSUDUMP DD SYSOUT=Z
//*SYSOUT  DD SYSOUT=*
//*RSICV19B DD DSN=HOM.SI.DDATA_MOVIMENTO.SI0883B.FASES.NOVOS,
//*        DISP=(,CATLG,DELETE),
//*        SPACE=(TRK,(2500,1500),RLSE),UNIT=SYSDA,
//*        DCB=(RECFM=FB,LRECL=428,BLKSIZE=0,DSORG=PS)
//*SYSDBOUT DD SYSOUT=*
//*SYSABOUT DD SYSOUT=*
//*SYSTSIN DD DSN=HOM.JV1.SYSIN(SI0883B),DISP=SHR
//*SYSIN   DD DUMMY
//**
//**
//*********************************************************************
//E0909111 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//CVPAGSIN DD DISP=(,CATLG,DELETE),
//         DSN=HOM.SI.DDATA_MOVIMENTO.SI9111B.CVPAGSIN,
//         UNIT=SYSDA,SPACE=(TRK,(50,50),RLSE),
//         DCB=(RECFM=FB,LRECL=1321,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI9111B),DISP=SHR
//SYSIN    DD DUMMY
//*
//E090SORT EXEC PGM=SORT,REGION=0K
//SYSPRINT DD   SYSOUT=*
//SORTMSG  DD   SYSOUT=*
//SYSOUT   DD   SYSOUT=*
//SORTIN   DD   DSN=HOM.SI.DDATA_MOVIMENTO.SI9111B.CVPAGSIN,DISP=SHR
//SORTOUT  DD   DSN=HOM.SI.DDATA_MOVIMENTO.SI9111B.CVPAGSIN.SEMNSGD,
//         UNIT=SYSDA,DISP=(,CATLG,DELETE),
//         SPACE=(TRK,(100,50),RLSE),
//         DCB=(RECFM=FB,LRECL=1320,BLKSIZE=0,DSORG=PS)
//SYSIN    DD   *
    SORT FIELDS=COPY
    INREC IFTHEN=(WHEN=(1,1,CH,EQ,C'1'),
    BUILD=(0001,1314,
    1316,0006)),
    IFTHEN=(WHEN=(1,1,CH,EQ,C'2'),
    BUILD=(0001,0615,
    0617,0705)),
    IFTHEN=(WHEN=(1,1,CH,EQ,C'3'),
    BUILD=(0001,1314,
    1316,0006))
//**
//*********************************************************************
//E0921115 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//CVPAGSIN DD DISP=(,CATLG,DELETE),
//         DSN=HOM.SI.DDATA_MOVIMENTO.SI9115B.CVPAGSIN,
//         UNIT=SYSDA,SPACE=(TRK,(50,50),RLSE),
//         DCB=(RECFM=FB,LRECL=1321,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI9115B),DISP=SHR
//SYSIN    DD DUMMY
//*
//******************************************************************
//*        FAZ RENAME SOMENTE SE O ANTERIOR DER ERRO               *
//******************************************************************
//         IF E0921115.RC NE 0 THEN
//E093REN  EXEC PGM=IDCAMS
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  ALTER HOM.SI.DDATA_MOVIMENTO.SI9115B.CVPAGSIN -
  NEWNAME (HOM.SI.DDATA_MOVIMENTO.SI9115B.CVPAGSIN.ERRO.JV1ERROR)
/*
//         ENDIF
//*
//         IF E0921115.RC = 0 THEN
//E093SORT EXEC PGM=SORT,REGION=0K
//SYSPRINT DD   SYSOUT=*
//SORTMSG  DD   SYSOUT=*
//SYSOUT   DD   SYSOUT=*
//SORTIN   DD   DSN=HOM.SI.DDATA_MOVIMENTO.SI9115B.CVPAGSIN,DISP=SHR
//SORTOUT  DD   DSN=HOM.SI.DDATA_MOVIMENTO.SI9115B.CVPAGSIN.SEMNSGD,
//         UNIT=SYSDA,DISP=(,CATLG,DELETE),
//         SPACE=(TRK,(100,50),RLSE),
//         DCB=(RECFM=FB,LRECL=1320,BLKSIZE=0,DSORG=PS)
//SYSIN    DD   *
    SORT FIELDS=COPY
    INREC IFTHEN=(WHEN=(1,1,CH,EQ,C'1'),
    BUILD=(0001,1314,
    1316,0006)),
    IFTHEN=(WHEN=(1,1,CH,EQ,C'2'),
    BUILD=(0001,0615,
    0617,0705)),
    IFTHEN=(WHEN=(1,1,CH,EQ,C'3'),
    BUILD=(0001,1314,
    1316,0006))
//         ENDIF
//**
//********************************************************************
//E0949147 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//CVPAGSIN DD DISP=(,CATLG,DELETE),
//         DSN=HOM.SI.DDATA_MOVIMENTO.SI9147B.CVPAGSIN,
//         UNIT=SYSDA,SPACE=(TRK,(50,50),RLSE),
//         DCB=(RECFM=FB,LRECL=1321,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI9147B),DISP=SHR
//SYSIN    DD DUMMY
//*
//******************************************************************
//*        FAZ RENAME SOMENTE SE O ANTERIOR DER ERRO               *
//******************************************************************
//         IF E0949147.RC NE 0 THEN
//E095REN  EXEC PGM=IDCAMS
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  ALTER HOM.SI.DDATA_MOVIMENTO.SI9147B.CVPAGSIN -
  NEWNAME (HOM.SI.DDATA_MOVIMENTO.SI9147B.CVPAGSIN.ERRO.JV1ERROR)
/*
//         ENDIF
//*
//         IF E0949147.RC = 0 THEN
//E095SORT EXEC PGM=SORT,REGION=0K
//SYSPRINT DD   SYSOUT=*
//SORTMSG  DD   SYSOUT=*
//SYSOUT   DD   SYSOUT=*
//SORTIN   DD   DSN=HOM.SI.DDATA_MOVIMENTO.SI9147B.CVPAGSIN,DISP=SHR
//SORTOUT  DD   DSN=HOM.SI.DDATA_MOVIMENTO.SI9147B.CVPAGSIN.SEMNSGD,
//         UNIT=SYSDA,DISP=(,CATLG,DELETE),
//         SPACE=(TRK,(100,50),RLSE),
//         DCB=(RECFM=FB,LRECL=1320,BLKSIZE=0,DSORG=PS)
//SYSIN    DD   *
    SORT FIELDS=COPY
    INREC IFTHEN=(WHEN=(1,1,CH,EQ,C'1'),
    BUILD=(0001,1314,
    1316,0006)),
    IFTHEN=(WHEN=(1,1,CH,EQ,C'2'),
    BUILD=(0001,0615,
    0617,0705)),
    IFTHEN=(WHEN=(1,1,CH,EQ,C'3'),
    BUILD=(0001,1314,
    1316,0006))
//         ENDIF
//**
//********************************************************************
//E0969148 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//CVPAGSIN DD DISP=(,CATLG,DELETE),
//         DSN=HOM.SI.DDATA_MOVIMENTO.SI9148B.CVPAGSIN,
//         UNIT=SYSDA,SPACE=(TRK,(50,50),RLSE),
//         DCB=(RECFM=FB,LRECL=1321,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI9148B),DISP=SHR
//SYSIN    DD DUMMY
//*
//******************************************************************
//*        FAZ RENAME SOMENTE SE O ANTERIOR DER ERRO               *
//******************************************************************
//         IF E0969148.RC NE 0 THEN
//E097REN  EXEC PGM=IDCAMS
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  ALTER HOM.SI.DDATA_MOVIMENTO.SI9148B.CVPAGSIN -
  NEWNAME (HOM.SI.DDATA_MOVIMENTO.SI9148B.CVPAGSIN.ERRO.JV1ERROR)
/*
//         ENDIF
//*
//         IF E0969148.RC = 0 THEN
//E098SORT EXEC PGM=SORT,REGION=0K
//SYSPRINT DD   SYSOUT=*
//SORTMSG  DD   SYSOUT=*
//SYSOUT   DD   SYSOUT=*
//SORTIN   DD   DSN=HOM.SI.DDATA_MOVIMENTO.SI9148B.CVPAGSIN,DISP=SHR
//SORTOUT  DD   DSN=HOM.SI.DDATA_MOVIMENTO.SI9148B.CVPAGSIN.SEMNSGD,
//         UNIT=SYSDA,DISP=(,CATLG,DELETE),
//         SPACE=(TRK,(100,50),RLSE),
//         DCB=(RECFM=FB,LRECL=1320,BLKSIZE=0,DSORG=PS)
//SYSIN    DD   *
    SORT FIELDS=COPY
    INREC IFTHEN=(WHEN=(1,1,CH,EQ,C'1'),
    BUILD=(0001,1314,
    1316,0006)),
    IFTHEN=(WHEN=(1,1,CH,EQ,C'2'),
    BUILD=(0001,0615,
    0617,0705)),
    IFTHEN=(WHEN=(1,1,CH,EQ,C'3'),
    BUILD=(0001,1314,
    1316,0006))
//         ENDIF
//**
//********************************************************************
//E0989168 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//CVPAGSIN DD DISP=(,CATLG,DELETE),
//         DSN=HOM.SI.DDATA_MOVIMENTO.SI9168B.CVPAGSIN,
//         UNIT=SYSDA,SPACE=(TRK,(50,50),RLSE),
//         DCB=(RECFM=FB,LRECL=1321,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI9168B),DISP=SHR
//SYSIN    DD DUMMY
//*
//******************************************************************
//*        FAZ RENAME SOMENTE SE O ANTERIOR DER ERRO               *
//******************************************************************
//         IF E0989168.RC NE 0 THEN
//E099REN  EXEC PGM=IDCAMS
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  ALTER HOM.SI.DDATA_MOVIMENTO.SI9168B.CVPAGSIN -
  NEWNAME (HOM.SI.DDATA_MOVIMENTO.SI9168B.CVPAGSIN.ERRO.JV1ERROR)
/*
//         ENDIF
//*
//**
//********************************************************************
//E1009169 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//CVPAGSIN DD DISP=(,CATLG,DELETE),
//         DSN=HOM.SI.DDATA_MOVIMENTO.SI9169B.CVPAGSIN,
//         UNIT=SYSDA,SPACE=(TRK,(50,50),RLSE),
//         DCB=(RECFM=FB,LRECL=1321,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI9169B),DISP=SHR
//SYSIN    DD DUMMY
//*
//******************************************************************
//*        FAZ RENAME SOMENTE SE O ANTERIOR DER ERRO               *
//******************************************************************
//         IF E1009169.RC NE 0 THEN
//E101REN  EXEC PGM=IDCAMS
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  ALTER HOM.SI.DDATA_MOVIMENTO.SI9169B.CVPAGSIN -
  NEWNAME (HOM.SI.DDATA_MOVIMENTO.SI9169B.CVPAGSIN.ERRO.JV1ERROR)
/*
//         ENDIF
//*
//**  RM019874-0611
//********************************************************************
//E1029211 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//CSPAGSIN DD DISP=(,CATLG,DELETE),
//         DSN=HOM.SI.DDATA_MOVIMENTO.SI9211B.CSPAGSIN,
//         UNIT=SYSDA,SPACE=(TRK,(50,50),RLSE),
//         DCB=(RECFM=FB,LRECL=1745,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI9211B),DISP=SHR
//SYSIN    DD DUMMY
//*
//**
//******************************************************************
//*        FAZ RENAME SOMENTE SE O ANTERIOR DER ERRO               *
//******************************************************************
//         IF E1029211.RC NE 0 THEN
//E103REN  EXEC PGM=IDCAMS
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  ALTER HOM.SI.DDATA_MOVIMENTO.SI9211B.CSPAGSIN -
  NEWNAME (HOM.SI.DDATA_MOVIMENTO.SI9211B.CSPAGSIN.ERRO.JV1ERROR)
/*
//         ENDIF
//*
//**
//*********************************************************************
//E1041115 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//CSPAGSIN DD DISP=(,CATLG,DELETE),
//         DSN=HOM.SI.DDATA_MOVIMENTO.SI9215B.CSPAGSIN,
//         UNIT=SYSDA,SPACE=(TRK,(50,50),RLSE),
//         DCB=(RECFM=FB,LRECL=1745,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI9215B),DISP=SHR
//SYSIN    DD DUMMY
//*
//******************************************************************
//*        FAZ RENAME SOMENTE SE O ANTERIOR DER ERRO               *
//******************************************************************
//         IF E1041115.RC NE 0 THEN
//E105REN  EXEC PGM=IDCAMS
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  ALTER HOM.SI.DDATA_MOVIMENTO.SI9215B.CSPAGSIN -
  NEWNAME (HOM.SI.DDATA_MOVIMENTO.SI9215B.CSPAGSIN.ERRO.JV1ERROR)
/*
//         ENDIF
//*
//**
//********************************************************************
//E1069247 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//CSPAGSIN DD DISP=(,CATLG,DELETE),
//         DSN=HOM.SI.DDATA_MOVIMENTO.SI9247B.CSPAGSIN,
//         UNIT=SYSDA,SPACE=(TRK,(50,50),RLSE),
//         DCB=(RECFM=FB,LRECL=1745,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI9247B),DISP=SHR
//SYSIN    DD DUMMY
//*
//******************************************************************
//*        FAZ RENAME SOMENTE SE O ANTERIOR DER ERRO               *
//******************************************************************
//         IF E1069247.RC NE 0 THEN
//E107REN  EXEC PGM=IDCAMS
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  ALTER HOM.SI.DDATA_MOVIMENTO.SI9247B.CSPAGSIN -
  NEWNAME (HOM.SI.DDATA_MOVIMENTO.SI9247B.CSPAGSIN.ERRO.JV1ERROR)
/*
//         ENDIF
//*
//**
//********************************************************************
//E1089248 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//CSPAGSIN DD DISP=(,CATLG,DELETE),
//         DSN=HOM.SI.DDATA_MOVIMENTO.SI9248B.CSPAGSIN,
//         UNIT=SYSDA,SPACE=(TRK,(50,50),RLSE),
//         DCB=(RECFM=FB,LRECL=1745,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI9248B),DISP=SHR
//SYSIN    DD DUMMY
//*
//******************************************************************
//*        FAZ RENAME SOMENTE SE O ANTERIOR DER ERRO               *
//******************************************************************
//         IF E1089248.RC NE 0 THEN
//E109REN  EXEC PGM=IDCAMS
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  ALTER HOM.SI.DDATA_MOVIMENTO.SI9248B.CSPAGSIN -
  NEWNAME (HOM.SI.DDATA_MOVIMENTO.SI9248B.CSPAGSIN.ERRO.JV1ERROR)
/*
//         ENDIF
//*
//**
//********************************************************************
//E1109268 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//CSPAGSIN DD DISP=(,CATLG,DELETE),
//         DSN=HOM.SI.DDATA_MOVIMENTO.SI9268B.CSPAGSIN,
//         UNIT=SYSDA,SPACE=(TRK,(50,50),RLSE),
//         DCB=(RECFM=FB,LRECL=1745,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI9268B),DISP=SHR
//SYSIN    DD DUMMY
//*
//******************************************************************
//*        FAZ RENAME SOMENTE SE O ANTERIOR DER ERRO               *
//******************************************************************
//         IF E1109268.RC NE 0 THEN
//E111REN  EXEC PGM=IDCAMS
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  ALTER HOM.SI.DDATA_MOVIMENTO.SI9268B.CSPAGSIN -
  NEWNAME (HOM.SI.DDATA_MOVIMENTO.SI9268B.CSPAGSIN.ERRO.JV1ERROR)
/*
//         ENDIF
//*
//**
//********************************************************************
//E1129269 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//CSPAGSIN DD DISP=(,CATLG,DELETE),
//         DSN=HOM.SI.DDATA_MOVIMENTO.SI9269B.CSPAGSIN,
//         UNIT=SYSDA,SPACE=(TRK,(50,50),RLSE),
//         DCB=(RECFM=FB,LRECL=1745,BLKSIZE=0,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(SI9269B),DISP=SHR
//SYSIN    DD DUMMY
//*
//******************************************************************
//*        FAZ RENAME SOMENTE SE O ANTERIOR DER ERRO               *
//******************************************************************
//         IF E1129269.RC NE 0 THEN
//E113REN  EXEC PGM=IDCAMS
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  ALTER HOM.SI.DDATA_MOVIMENTO.SI9269B.CSPAGSIN -
  NEWNAME (HOM.SI.DDATA_MOVIMENTO.SI9269B.CSPAGSIN.ERRO.JV1ERROR)
/*
//         ENDIF
//*
//*********************************************************************
//** STEP DE ENVIO DE MENSAGEM SOBRE JOB COM  ERRO NO ZEKE.          **
//*********************************************************************
//*   IF (ABEND | ABEND | RC EQ 99 | RC EQ 09 | RC EQ 08 | RC EQ 12) THEN
//* ABEND EXEC PPSEND,N=JPSID03
//*   ENDIF
//*
//*
//*
//*
//*
//F001LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.SI.DDATA_MOVIMENTO.SI0868B')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F001LIST.RC = 00 THEN
//F002FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=A
//SYSPRINT DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.SI.DDATA_MOVIMENTO.SI0868B'              +
  SINISTRO_PENDENTE_EM_DDATA_MOVIMENTO.TXT
QUIT
//  ENDIF
//*
//*
//**********************************************************************
//F003LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.INTERNET.DDATA_MOVIMENTO.SID03.SI0860B.CESTA')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F003LIST.RC = 00 THEN
//F004FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.INTERNET.DDATA_MOVIMENTO.SID03.SI0860B.CESTA'   +
  DDATA_MOVIMENTO_CESTA.TXT
PUT 'HOM.INTERNET.DDATA_MOVIMENTO.SID03.SI0860B.CESTA'   +
  DDATA_MOVIMENTO_SI0860B_CESTA.TXT
QUIT
//  ENDIF
//*
//*
//**********************************************************************
//F005LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.INTERNET.DDATA_MOVIMENTO.SID03.NOVAPT')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F005LIST.RC = 00 THEN
//F006FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.INTERNET.DDATA_MOVIMENTO.SID03.NOVAPT'           +
  DDATA_MOVIMENTO_NOVAPT.TXT
QUIT
//  ENDIF
//*
//**********************************************************************
//F007LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.INTERNET.DDATA_MOVIMENTO.SID03.PPPT')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F007LIST.RC = 00 THEN
//F008FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.INTERNET.DDATA_MOVIMENTO.SID03.PPPT'             +
  DDATA_MOVIMENTO_PPPT.TXT
QUIT
//  ENDIF
//*
//*
//**********************************************************************
//F009LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.INTERNET.DDATA_MOVIMENTO.SID03.PTPP')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F009LIST.RC = 00 THEN
//F010FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.INTERNET.DDATA_MOVIMENTO.SID03.PTPP'             +
  DDATA_MOVIMENTO_PTPP.TXT
QUIT
//  ENDIF
//*
//*
//**********************************************************************
//F011LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.INTERNET.DDATA_MOVIMENTO.SID03.PTPT')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F011LIST.RC = 00 THEN
//F012FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.INTERNET.DDATA_MOVIMENTO.SID03.PTPT'             +
  DDATA_MOVIMENTO_PTPT.TXT
QUIT
//  ENDIF
//*
//*
//**********************************************************************
//F013LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.REL.DDATA_MOVIMENTO.SI0805B.L1VZ6')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F013LIST.RC = 00 THEN
//F014FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.REL.DDATA_MOVIMENTO.SI0805B.L1VZ6'               +
  DDATA_MOVIMENTO_SI0805B.TXT
QUIT
//  ENDIF
//*
//*
//**********************************************************************
//F015LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.SI.DDATA_MOVIMENTO.SI0029B.ARQCDG1')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F015LIST.RC = 00 THEN
//F016FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.SI.DDATA_MOVIMENTO.SI0029B.ARQCDG1'            +
  DDATA_MOVIMENTO_SI0029B_ARQCDG1.TXT
QUIT
//  ENDIF
//*
//**********************************************************************
//F017LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.SI.DDATA_MOVIMENTO.SI0029B.ARQCDG2')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F017LIST.RC = 00 THEN
//F018FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.SI.DDATA_MOVIMENTO.SI0029B.ARQCDG2'            +
  DDATA_MOVIMENTO_SI0029B_ARQCDG2.TXT
QUIT
//  ENDIF
//*
//*
//**********************************************************************
//F019LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.SI.DDATA_MOVIMENTO.SI0867B')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F019LIST.RC = 00 THEN
//F020FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.SI.DDATA_MOVIMENTO.SI0867B'                      +
    ACOMPANHAMENTO_DE_SINISTRO_$(ODATE).TXT
QUIT
//  ENDIF
//*
//**********************************************************************
//F021LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.SI.DDATA_MOVIMENTO.SI0095B')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F021LIST.RC = 00 THEN
//F022FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.SI.DDATA_MOVIMENTO.SI0095B'                      +
    ACOMPANHAMENTO_DE_SINISTRO_$(ODATE).XLS
PUT 'HOM.SI.DDATA_MOVIMENTO.SI0095B'                      +
  DDATA_MOVIMENTO_RECIBO_SI0095B.TXT
QUIT
//  ENDIF
//*
//**********************************************************************
//F023LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.SI.DDATA_MOVIMENTO.SI0862B')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F023LIST.RC = 00 THEN
//F024FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.SI.DDATA_MOVIMENTO.SI0862B'                      +
    PLANILHA_SINISTRALIDADE_$(ODATE).TXT
QUIT
//  ENDIF
//*
//*
//**********************************************************************
//F025LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.SI.DDATA_MOVIMENTO.SI0864B')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F025LIST.RC = 00 THEN
//F026FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.SI.DDATA_MOVIMENTO.SI0864B'                      +
    INFORMACOES_LOTERICO01_$(ODATE).TXT
QUIT
//  ENDIF
//*
//*
//**********************************************************************
//F027LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.SI.DDATA_MOVIMENTO.SI0869B')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F027LIST.RC = 00 THEN
//F028FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.SI.DDATA_MOVIMENTO.SI0869B'                      +
  DDATA_MOVIMENTO_LT.TXT
QUIT
//  ENDIF
//*
//**********************************************************************
//F029LIST EXEC  PGM=IKJEFT01,
//        PARM=('PRDFULL HOM.SI.DDATA_MOVIMENTO.SI0848B.PGT.CRED.HABIT.TXT')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F029LIST.RC = 00 THEN
//F030FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.SI.DDATA_MOVIMENTO.SI0848B.PGT.CRED.HABIT.TXT'   +
    DDATA_MOVIMENTO._SI0848B.TXT
QUIT
//  ENDIF
//*
//*
//**********************************************************************
//F031LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.REL.DDATA_MOVIMENTO.SI0851B')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F031LIST.RC = 00 THEN
//F032FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.REL.DDATA_MOVIMENTO.SI0851B'  DDATA_MOVIMENTO.SI0851B.TXT
QUIT
//  ENDIF
//*
//*
//**********************************************************************
//F033LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.SI.DDATA_MOVIMENTO.SI0818B.SEGURO')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F033LIST.RC = 00 THEN
//F034FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.SI.DDATA_MOVIMENTO.SI0818B.SEGURO'               +
    SI0818B_SEGURO_DDATA_MOVIMENTO.TXT
QUIT
//  ENDIF
//*
//*
//**********************************************************************
//F035LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.SI.DDATA_MOVIMENTO.SI0818B.COSSEGUR')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F035LIST.RC = 00 THEN
//F036FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.SI.DDATA_MOVIMENTO.SI0818B.COSSEGUR'             +
    SI0818B_COSSEGUR_DDATA_MOVIMENTO.TXT
QUIT
//  ENDIF
//*
//**********************************************************************
//F037LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.SI.DDATA_MOVIMENTO.SI0807B.REEXTAVI')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F037LIST.RC = 00 THEN
//F038FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.SI.DDATA_MOVIMENTO.SI0807B.REEXTAVI'               +
    SI0807B_REEXTAVI_DDATA_MOVIMENTO.TXT
QUIT
//  ENDIF
//*
//*
//**********************************************************************
//F039LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.SI.DDATA_MOVIMENTO.SI0808B.REEXTPAG')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F039LIST.RC = 00 THEN
//F040FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.SI.DDATA_MOVIMENTO.SI0808B.REEXTPAG'              +
    SI0808B_REEXTPAG_DDATA_MOVIMENTO.TXT
QUIT
//  ENDIF
//*
//*
//**********************************************************************
//F041LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.SI.DDATA_MOVIMENTO.SI0809B.REEXTPCO')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F041LIST.RC = 00 THEN
//F042FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.SI.DDATA_MOVIMENTO.SI0809B.REEXTPCO'              +
    SI0809B_REEXTPCO_DDATA_MOVIMENTO.TXT
QUIT
//  ENDIF
//*
//**********************************************************************
//F043LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.SI.DDATA_MOVIMENTO.SI0810B.REEXTCAN')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F043LIST.RC = 00 THEN
//F044FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.SI.DDATA_MOVIMENTO.SI0810B.REEXTCAN'             +
    SI0810B_REEXTCAN_DDATA_MOVIMENTO.TXT
QUIT
//  ENDIF
//*
//**********************************************************************
//F045LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.SI.DDATA_MOVIMENTO.SI0811B.REEXTPEN')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F045LIST.RC = 00 THEN
//F046FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.SI.DDATA_MOVIMENTO.SI0811B.REEXTPEN'             +
    SI0811B_REEXTPEN_DDATA_MOVIMENTO.TXT
QUIT
//  ENDIF
//*
//**********************************************************************
//F047LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.SI.DDATA_MOVIMENTO.SI0818B.COSSEGUR')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F047LIST.RC = 00 THEN
//F048FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.SI.DDATA_MOVIMENTO.SI0818B.COSSEGUR'             +
    SI0818B_COSSEGUR_DDATA_MOVIMENTO.TXT
QUIT
//  ENDIF
//*
//**********************************************************************
//F049LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.SI.DDATA_MOVIMENTO.SI0818B.SEGURO')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F049LIST.RC = 00 THEN
//F050FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.SI.DDATA_MOVIMENTO.SI0818B.SEGURO'               +
    SI0818B_SEGURO_DDATA_MOVIMENTO.TXT
QUIT
//  ENDIF
//*
//**********************************************************************
//F051LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.SI.DDATA_MOVIMENTO.SI0874B.ARQANAL.DIARIO')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F051LIST.RC = 00 THEN
//F052FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//          PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.SI.DDATA_MOVIMENTO.SI0874B.ARQANAL.DIARIO'      +
   SI0874B_DESP_HONO_DIARIO.TXT
QUIT
//   ENDIF
//*
//**********************************************************************
//F053LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.SI.DDATA_MOVIMENTO.SI0882B.ARQCALC.TXT')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F053LIST.RC = 00 THEN
//F054FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//          PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.SI.DDATA_MOVIMENTO.SI0882B.ARQCALC.TXT'         +
    SI0882B_ARQCALC_DDATA_MOVIMENTO.TXT
QUIT
//   ENDIF
//*
//**********************************************************************
//F057LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.SI.DDATA_MOVIMENTO.SI0160B.MATEPEND')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F057LIST.RC = 00 THEN
//F058FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//          PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.SI.DDATA_MOVIMENTO.SI0160B.MATEPEND'             +
    DDATA_MOVIMENTO_SI0160B_MATEPEND.TXT
PUT 'HOM.SI.DDATA_MOVIMENTO.SI0160B.MATEREAT'             +
    DDATA_MOVIMENTO_SI0160B_MATEREAT.TXT
QUIT
//   ENDIF
//*
//**********************************************************************
//F059LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.SI.DDATA_MOVIMENTO.SI0857B.ARQGETER.DIA')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F059LIST.RC = 00 THEN
//F060FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.SI.DDATA_MOVIMENTO.SI0857B.ARQGETER.DIA'   +
    DDATA_MOVIMENTO_SI0857B_ARQGETER_DIA.TXT
QUIT
//  ENDIF
//*
//**********************************************************************
//F061LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.SI.DDATA_MOVIMENTO.SI0857B.ARQGITER.DIA')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F061LIST.RC = 00 THEN
//F062FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.SI.DDATA_MOVIMENTO.SI0857B.ARQGITER.DIA'   +
    DDATA_MOVIMENTO_SI0857B_ARQGITER_DIA.TXT
QUIT
//  ENDIF
//*
//**
//**********************************************************************
//F065LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.SI.DDATA_MOVIMENTO.SI0884B.FASES.ANTIGOS')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F065LIST.RC = 00 THEN
//F066FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.SI.DDATA_MOVIMENTO.SI0884B.FASES.ANTIGOS'  +
    DDATA_MOVIMENTO_SI0884B_FASES_ANTIGOS.TXT
QUIT
//  ENDIF
//*
//**********************************************************************
//F067LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.SI.DDATA_MOVIMENTO.SI0891B.FENAE01')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F067LIST.RC = 00 THEN
//F068FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.SI.DDATA_MOVIMENTO.SI0891B.FENAE01'        +
  DDATA_MOVIMENTO_SI0891B.TXT
QUIT
//  ENDIF
//*
//**********************************************************************
//F069LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.SI.DDATA_MOVIMENTO.SI0890B.LOTER01')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F069LIST.RC = 00 THEN
//F070FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.SI.DDATA_MOVIMENTO.SI0890B.LOTER01'        +
    DDATA_MOVIMENTO_LOTERICO_SI0890B.TXT
QUIT
//  ENDIF
//*
//**********************************************************************
//F071LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.SI.DDATA_MOVIMENTO.SI0901B.FENASEG')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F071LIST.RC = 00 THEN
//F072FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.SI.DDATA_MOVIMENTO.SI0901B.FENASEG'        +
  DDATA_MOVIMENTO_SI0901B.TXT
QUIT
//  ENDIF
//*
//**********************************************************************
//F073LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.SI.DDATA_MOVIMENTO.SI0861B')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F073LIST.RC = 00 THEN
//F074FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,COND=(00,NE),
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=A
//SYSPRINT DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.SI.DDATA_MOVIMENTO.SI0861B'              +
    SINISTRO_PAGO_PENDENTE_$(ODATE).TXT
QUIT
//  ENDIF
//*
//**********************************************************************
//F075LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.INTERNET.DDATA_MOVIMENTO.SID03.SI0201B')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F075LIST.RC = 00 THEN
//F076FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.INTERNET.DDATA_MOVIMENTO.SID03.SI0201B'  +
   SINISTRO_INDENIZADO_SI0201B.TXT
QUIT
//  ENDIF
//*
//**********************************************************************
//F077LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.INTERNET.DDATA_MOVIMENTO.SID03.SI0202B')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F077LIST.RC = 00 THEN
//F078FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.INTERNET.DDATA_MOVIMENTO.SID03.SI0202B'  +
   SINISTRO_INDENIZADO_SI0202B.TXT
QUIT
//  ENDIF
//*
//***********************************************************************
//*E079LIST EXEC PGM=IKJEFT01,
//*        PARM=('PRDFULL HOM.SI.DDATA_MOVIMENTO.SI0895B.SINISTRO')
//*SYSPROC DD DSN=HOM.JV1.CLIST,DISP=SHR
//*SYSTSIN DD DUMMY
//*SYSPRINT DD SYSOUT=*
//*SYSTSPRT DD SYSOUT=*
//**
//*        IF F079LIST.RC = 00 THEN
//*E080FTP EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//*        PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//*SYSTCPD DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//*SYSFTPD DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//*SYSMDUMP DD SYSOUT=Z
//*SYSPRINT DD SYSOUT=*
//*SYSOUT  DD SYSOUT=*
//*INPUT   DD *
//* USERPROD USRPRD
//*  PUT 'HOM.SI.DDATA_MOVIMENTO.SI0895B.SINISTRO'   +
//*            DDATA_MOVIMENTO_SI0895B.TXT
//* QUIT
//* ENDIF
//*
//**********************************************************************
//F081ENER EXEC PGM=ICEGENER
//SYSUT1   DD DISP=SHR,DSN=NULLFILE,
//         DCB=(RECFM=FB,LRECL=300,BLKSIZE=27900)
//*
//SYSUT2   DD DSN=HOM.INTERNET.DDATA_MOVIMENTO.SID03.INDENIZA,
//         UNIT=SYSDA,SPACE=(TRK,(2500,2500),RLSE),
//         DCB=(RECFM=FB,LRECL=600,BLKSIZE=0,DSORG=PS),
//         DISP=(,CATLG,CATLG)
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DUMMY
//*
//**********************************************************************
//         IF F075LIST.RC = 00 THEN
//F082JUNC EXEC PGM=ICEGENER
//SYSUT1   DD DSN=HOM.INTERNET.DDATA_MOVIMENTO.SID03.SI0201B,DISP=SHR
//SYSUT2   DD DSN=HOM.INTERNET.DDATA_MOVIMENTO.SID03.INDENIZA,
//         UNIT=SYSDA,SPACE=(TRK,(3500,500),RLSE),
//         DCB=*.SYSUT1,DISP=(MOD)
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DUMMY
//         ENDIF
//*
//**********************************************************************
//         IF F077LIST.RC = 00 THEN
//F083JUNC EXEC PGM=ICEGENER
//SYSUT1   DD DSN=HOM.INTERNET.DDATA_MOVIMENTO.SID03.SI0202B,DISP=SHR
//SYSUT2   DD DSN=HOM.INTERNET.DDATA_MOVIMENTO.SID03.INDENIZA,
//         UNIT=SYSDA,SPACE=(TRK,(3500,500),RLSE),
//         DCB=*.SYSUT1,DISP=(MOD)
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DUMMY
//         ENDIF
//*
//**********************************************************************
//F084LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.INTERNET.DDATA_MOVIMENTO.SID03.INDENIZA')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F084LIST.RC = 00 THEN
//F085FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.INTERNET.DDATA_MOVIMENTO.SID03.INDENIZA' +
   SINISTRO_INDENIZADO.TXT
//  ENDIF
//*
//**********************************************************************
//F086LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.REL.DDATA_MOVIMENTO.SI0044B.RELJUXLS')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F086LIST.RC = 00 THEN
//F087FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.REL.DDATA_MOVIMENTO.SI0044B.RELJUXLS'    +
    DDATA_MOVIMENTO_SI0044B_RELJUXLS.TXT
QUIT
//  ENDIF
//*
//**********************************************************************
//F088LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.SI.DDATA_MOVIMENTO.SI0857B.ARQGILIE.DIA')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F088LIST.RC = 00 THEN
//F089FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.SI.DDATA_MOVIMENTO.SI0857B.ARQGILIE.DIA'               +
    DDATA_MOVIMENTO_SI0857B_ARQGILIE_DIA.TXT
QUIT
//  ENDIF
//*
//**********************************************************************
//F090LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.SI.DDATA_MOVIMENTO.SI0857B.ARQGEPOC.DIA')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F090LIST.RC = 00 THEN
//F091FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.SI.DDATA_MOVIMENTO.SI0857B.ARQGEPOC.DIA'               +
    DDATA_MOVIMENTO_SI0857B_ARQGEPOC_DIA.TXT
QUIT
//  ENDIF
//*
//**********************************************************************
//F092LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.SI.DDATA_MOVIMENTO.SI0857B.ARQCONSO.DIA')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F092LIST.RC = 00 THEN
//F093FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.SI.DDATA_MOVIMENTO.SI0857B.ARQCONSO.DIA'               +
    DDATA_MOVIMENTO_SI0857B_ARQCONSO_DIA.TXT
PUT 'HOM.SI.DDATA_MOVIMENTO.SI0857B.ARQCONSO.DIA'               +
    DDATA_MOVIMENTO_SI0857B_ARQCONSO_V2.TXT
QUIT
//  ENDIF
//*
//**********************************************************************
//F094LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.SI.DDATA_MOVIMENTO.SI0857B.ARQFUNCE.DIA')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F094LIST.RC = 00 THEN
//F095FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.SI.DDATA_MOVIMENTO.SI0857B.ARQFUNCE.DIA'               +
    DDATA_MOVIMENTO_SI0857B_ARQFUNCE_DIA.TXT
QUIT
//  ENDIF
//*
//**********************************************************************
//F096LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.REL.DDATA_MOVIMENTO.SI0099B1')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F096LIST.RC = 00 THEN
//F097FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.REL.DDATA_MOVIMENTO.SI0099B1'               +
               DDATA_MOVIMENTO_SI0099B1.TXT
QUIT
//  ENDIF
//*
//**********************************************************************
//F098LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.REL.DDATA_MOVIMENTO.SI0099B.RELERRO')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F098LIST.RC = 00 THEN
//F099FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.REL.DDATA_MOVIMENTO.SI0099B.RELERRO'        +
    DDATA_MOVIMENTO_SI0099B_RELERRO.TXT
QUIT
//  ENDIF
//*
//**********************************************************************
//F100LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.REL.DDATA_MOVIMENTO.SI0888B')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F100LIST.RC = 00 THEN
//F101FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.REL.DDATA_MOVIMENTO.SI0888B'   +
     DDATA_MOVIMENTO_SI0888B_SIN_ESTORNOS_DIA.TXT
PUT 'HOM.REL.DDATA_MOVIMENTO.SI0888B'   +
     DDATA_MOVIMENTO_SI0888B_SIN_ESTORNOS_DIA.TXT
PUT 'HOM.REL.DDATA_MOVIMENTO.SI0888B'   +
     DDATA_MOVIMENTO_SI0888B_SIN_ESTORNOS_DIA.TXT
PUT 'HOM.REL.DDATA_MOVIMENTO.SI0888B'   +
     DDATA_MOVIMENTO_SI0888B_SIN_ESTORNOS_DIA.TXT
PUT 'HOM.REL.DDATA_MOVIMENTO.SI0888B'   +
     DDATA_MOVIMENTO_SI0888B_SIN_ESTORNOS_DIA.TXT
PUT 'HOM.REL.DDATA_MOVIMENTO.SI0888B'   +
     DDATA_MOVIMENTO_SI0888B_SIN_ESTORNOS_DIA.TXT
PUT 'HOM.REL.DDATA_MOVIMENTO.SI0888B'   +
     DDATA_MOVIMENTO_SI0888B_SIN_ESTORNOS_DIA.TXT
QUIT
//  ENDIF
//*
//**********************************************************************
//F102LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.SI.DDATA_MOVIMENTO.SI0896B.ARQMATC')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F102LIST.RC = 00 THEN
//F103FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.SI.DDATA_MOVIMENTO.SI0896B.ARQMATC' +
     DDATA_MOVIMENTO_SI0896B_ARQMATC.TXT
PUT 'HOM.SI.DDATA_MOVIMENTO.SI0896B.ARQMATC' +
     DDATA_MOVIMENTO_SI0896B_ARQMATC.TXT
QUIT
//  ENDIF
//*
//**********************************************************************
//* INIBIDO EM 24/11/2008 POR SOLICITACAO SR.RILDO - RM002783-1108     *
//**********************************************************************
//*E104LIST EXEC  PGM=IKJEFT01,
//*         PARM=('PRDFULL HOM.SI.DDATA_MOVIMENTO.SI0892B.ARQAMSS')
//*SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//*SYSTSIN  DD DUMMY
//*SYSPRINT DD SYSOUT=*
//*SYSTSPRT DD SYSOUT=*
//*
//*         IF F104LIST.RC = 00 THEN
//*E105FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//*         PARM='10.100.2.144'
//*STEPLIB  DD DSN=TCPIP.SEZALOAD,DISP=SHR
//*SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//*SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//*SYSMDUMP DD SYSOUT=Z
//*SYSPRINT DD SYSOUT=*
//*SYSOUT   DD SYSOUT=*
//*INPUT    DD *
//*USERPROD USRPRD
//*PUT 'HOM.SI.DDATA_MOVIMENTO.SI0892B.ARQAMSS' +
//*  SINISTROS_AVISADOS_ESTORNADOS/DDATA_MOVIMENTO_SI0892B_ARQAMSS.TXT
//*QUIT
//*  ENDIF
//*
//EXXXPDF  EXEC PDF,D=$(ODATE),P=SI0032B,A=GEPOC
//*
//F106MRE  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.REL.DDATA_MOVIMENTO.SI0103B.L2VZ6'         +
    DDATA_MOVIMENTO.SI0103B.GEAUT
PUT 'HOM.REL.DDATA_MOVIMENTO.SI0107B.L2VZ6'         +
    DDATA_MOVIMENTO.SI0107B.GERID
PUT 'HOM.REL.DDATA_MOVIMENTO.SI0107B.L2VZ6'         +
    DDATA_MOVIMENTO.SI0107B.GEATU
PUT 'HOM.REL.DDATA_MOVIMENTO.SI0110B.L1VZ6'         +
    DDATA_MOVIMENTO.SI0110B.GEPES
PUT 'HOM.REL.DDATA_MOVIMENTO.SI0803B.L1VZ6'         +
    DDATA_MOVIMENTO.SI0803B.GERES
PUT 'HOM.REL.DDATA_MOVIMENTO.SI0804B.L1VZ6'         +
    DDATA_MOVIMENTO.SI0804B.PRODUCAO
PUT 'HOM.REL.DDATA_MOVIMENTO.SI0820B.RESINCI.L1VZ6' +
    DDATA_MOVIMENTO.SI0820B.GEATU
PUT 'HOM.REL.DDATA_MOVIMENTO.SI0820B.RESINCI.L1VZ6' +
    DDATA_MOVIMENTO.SI0820B.GEATU
PUT 'HOM.REL.DDATA_MOVIMENTO.SI0077B.SIHAPLAN.L2V80' +
    DDATA_MOVIMENTO.SI0077B.GEPOC
PUT 'HOM.REL.DDATA_MOVIMENTO.SI0078B.L1VZ6'          +
    DDATA_MOVIMENTO.SI0078B.GEPOC
PUT 'HOM.REL.DDATA_MOVIMENTO.SI0843B.L1VZ6'          +
    DDATA_MOVIMENTO.SI0843B.GEATU
PUT 'HOM.REL.DDATA_MOVIMENTO.SI0844B.L1VZ6'          +
    DDATA_MOVIMENTO.SI0844B.GEINV
PUT 'HOM.REL.DDATA_MOVIMENTO.SI0845B.L1VZ6'          +
    DDATA_MOVIMENTO.SI0845B.GEINV
PUT 'HOM.REL.DDATA_MOVIMENTO.SI0847B.L1VZ6'         +
    DDATA_MOVIMENTO.SI0847B.PRODUCAO
PUT 'HOM.REL.DDATA_MOVIMENTO.SI0846B.L1VZ6'          +
    DDATA_MOVIMENTO.SI0846B.GERES
PUT 'HOM.REL.DDATA_MOVIMENTO.SI0850B.L1VZ6'          +
    DDATA_MOVIMENTO.SI0850B.GEAUT
PUT 'HOM.REL.DDATA_MOVIMENTO.SI0901B.L1VZ6'          +
    DDATA_MOVIMENTO.SI0901B.GESIS
PUT 'HOM.REL.DDATA_MOVIMENTO.SI0044B.RELJURID'       +
    DDATA_MOVIMENTO.SI0044B.GEPOC
PUT 'HOM.REL.DDATA_MOVIMENTO.SI0133B'       +
    DDATA_MOVIMENTO.SI0133B.GEPOC
PUT 'HOM.REL.DDATA_MOVIMENTO.SI0133B'       +
    DDATA_MOVIMENTO.SI0133B.GERAR
PUT 'HOM.REL.DDATA_MOVIMENTO.SI0033B'       +
    DDATA_MOVIMENTO.SI0033B.GEPOC
PUT 'HOM.REL.DDATA_MOVIMENTO.SI0034B'       +
    DDATA_MOVIMENTO.SI0034B.GEPOC
PUT 'HOM.REL.DDATA_MOVIMENTO.SI0035B'       +
    DDATA_MOVIMENTO.SI0035B.GEPOC
PUT 'HOM.REL.DDATA_MOVIMENTO.SI0036B'       +
    DDATA_MOVIMENTO.SI0036B.GEPOC
PUT 'HOM.REL.DDATA_MOVIMENTO.SI0037B'       +
    DDATA_MOVIMENTO.SI0037B.GEPOC
PUT 'HOM.REL.DDATA_MOVIMENTO.SI0038B'       +
    DDATA_MOVIMENTO.SI0038B.GEPOC
PUT 'HOM.REL.DDATA_MOVIMENTO.SI0042B'       +
    DDATA_MOVIMENTO.SI0042B.GEPOC
PUT 'HOM.REL.DDATA_MOVIMENTO.SI0045B'       +
    DDATA_MOVIMENTO.SI0045B.GEPOC
PUT 'HOM.REL.DDATA_MOVIMENTO.SI0045B'       +
  DDATA_MOVIMENTO_SI0045B.TXT
QUIT
//*
//**********************************************************************
//F107LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.SI.DDATA_MOVIMENTO.SI2010B')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F107LIST.RC = 00 THEN
//F108FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.SI.DDATA_MOVIMENTO.SI2010B' +
  DDATA_MOVIMENTO_SI2010B.TXT
QUIT
//  ENDIF
//*
//**********************************************************************
//F109LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.SI.DDATA_MOVIMENTO.SI0048B')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F109LIST.RC = 00 THEN
//F110FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.SI.DDATA_MOVIMENTO.SI0048B' +
  HOM.SI.DDATA_MOVIMENTO.SI0048B.TXT
QUIT
//  ENDIF
//*
//*
//**
//**********************************************************************
//F111LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.SI.DDATA_MOVIMENTO.SI0234B.SAIDA')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F111LIST.RC = 00 THEN
//F112FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.SI.DDATA_MOVIMENTO.SI0234B.SAIDA' +
 SOLICITA_RECIBO_INDENIZACAO_SI0234B_PROCESSADO.TXT
PUT 'HOM.SI.DDATA_MOVIMENTO.SI0234B.SAIDA' +
 SOLICITA_RECIBO_INDENIZACAO_SI0234B.PROCESSADO_DDATA_MOVIMENTO.TXT
QUIT
//  ENDIF
//*
//**
//**********************************************************************
//F113LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.REL.DDATA_MOVIMENTO.SI0134B.PRELIB')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F113LIST.RC = 00 THEN
//F114FTP  EXEC PGM=FTP,REGION=4096K,PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD 
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.REL.DDATA_MOVIMENTO.SI0134B.PRELIB'              +
             DDATA_MOVIMENTO_SI0134B_PRELIB_GEPOC.TXT
QUIT
//*
//         ENDIF
//*
//**********************************************************************
//*E115LIST EXEC PGM=IKJEFT01,
//*        PARM=('PRDFULL HOM.SI.DDATA_MOVIMENTO.SI0883B.FASES.NOVOS')
//*SYSPROC DD DSN=HOM.JV1.CLIST,DISP=SHR
//*SYSTSIN DD DUMMY
//*SYSPRINT DD SYSOUT=*
//*SYSTSPRT DD SYSOUT=*
//**
//*        IF F115LIST.RC = 00 THEN
//*E116FTP EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//*        PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//*SYSTCPD DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//*SYSFTPD DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//*SYSMDUMP DD SYSOUT=Z
//*SYSPRINT DD SYSOUT=*
//*SYSOUT  DD SYSOUT=*
//*INPUT   DD *
//*USERPROD USRPRD
//*PUT 'HOM.SI.DDATA_MOVIMENTO.SI0883B.FASES.NOVOS'    +
//*    DDATA_MOVIMENTO_SI0883B_FASES_NOVOS.TXT
//*QUIT
//* ENDIF
//**
//**
//******************************************************************
//F117LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.SI.DDATA_MOVIMENTO.SI9111B.CVPAGSIN.SEMNSGD')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F117LIST.RC = 00 THEN
//F118FTP  EXEC PGM=FTP,REGION=4M,PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.SI.DDATA_MOVIMENTO.SI9111B.CVPAGSIN.SEMNSGD' +
   SINISTRO_SI9111B_CXSEG_DDATA_MOVIMENTO_RET01.TXT
QUIT
//*
//         ENDIF
//**
//*********************************************************************
//F119LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.SI.DDATA_MOVIMENTO.SI9115B.CVPAGSIN.SEMNSGD')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F119LIST.RC = 00 THEN
//F120FTP  EXEC PGM=FTP,REGION=4M,PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.SI.DDATA_MOVIMENTO.SI9115B.CVPAGSIN.SEMNSGD'                 +
    SINISTRO_SI9115B_CXSEG_DDATA_MOVIMENTO_RET01.TXT
QUIT
//*
//         ENDIF
//**
//**********************************************************************
//F121LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.SI.DDATA_MOVIMENTO.SI9147B.CVPAGSIN.SEMNSGD')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F121LIST.RC = 00 THEN
//F122FTP  EXEC PGM=FTP,REGION=4M,PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.SI.DDATA_MOVIMENTO.SI9147B.CVPAGSIN.SEMNSGD' +
    SINISTRO_SI9147B_CXSEG_DDATA_MOVIMENTO_RET01.TXT
QUIT
//*
//         ENDIF
//**
//**********************************************************************
//F123LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.SI.DDATA_MOVIMENTO.SI9148B.CVPAGSIN.SEMNSGD')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F123LIST.RC = 00 THEN
//F124FTP  EXEC PGM=FTP,REGION=4M,PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.SI.DDATA_MOVIMENTO.SI9148B.CVPAGSIN.SEMNSGD' +
    SINISTRO_SI9148B_CXSEG_DDATA_MOVIMENTO_RET01.TXT
QUIT
//*
//         ENDIF
//**
//**********************************************************************
//F125LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.SI.DDATA_MOVIMENTO.SI9168B.CVPAGSIN')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F125LIST.RC = 00 THEN
//F126FTP  EXEC PGM=FTP,REGION=4M,PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.SI.DDATA_MOVIMENTO.SI9168B.CVPAGSIN' +
    SINISTRO_SI9168B_CXSEG_DDATA_MOVIMENTO_RET01.TXT
QUIT
//*
//         ENDIF
//**
//**********************************************************************
//F127LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.SI.DDATA_MOVIMENTO.SI9169B.CVPAGSIN')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F127LIST.RC = 00 THEN
//F128FTP  EXEC PGM=FTP,REGION=4M,PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.SI.DDATA_MOVIMENTO.SI9169B.CVPAGSIN' +
    SINISTRO_SI9169B_CXSEG_DDATA_MOVIMENTO_RET01.TXT
QUIT
//*
//         ENDIF
//*
//**
//*********************************************************************
//F129LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.SI.DDATA_MOVIMENTO.SI9211B.CSPAGSIN')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F129LIST.RC = 00 THEN
//F130FTP  EXEC PGM=FTP,REGION=4M,PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.SI.DDATA_MOVIMENTO.SI9211B.CSPAGSIN' +
   SINISTRO_SI9211B_CXSEG_DDATA_MOVIMENTO_RET01.TXT
QUIT
//*
//         ENDIF
//**
//*********************************************************************
//F131LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.SI.DDATA_MOVIMENTO.SI9215B.CSPAGSIN')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F131LIST.RC = 00 THEN
//F132FTP  EXEC PGM=FTP,REGION=4M,PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.SI.DDATA_MOVIMENTO.SI9215B.CSPAGSIN'    +
   SINISTRO_SI9215B_CXSEG_DDATA_MOVIMENTO_RET01.TXT
QUIT
//*
//         ENDIF
//**
//**********************************************************************
//F133LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.SI.DDATA_MOVIMENTO.SI9247B.CSPAGSIN')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F133LIST.RC = 00 THEN
//F134FTP  EXEC PGM=FTP,REGION=4M,PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.SI.DDATA_MOVIMENTO.SI9247B.CSPAGSIN' +
   SINISTRO_SI9247B_CXSEG_DDATA_MOVIMENTO_RET01.TXT
QUIT
//*
//         ENDIF
//**
//**********************************************************************
//F135LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.SI.DDATA_MOVIMENTO.SI9248B.CSPAGSIN')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F135LIST.RC = 00 THEN
//F136FTP  EXEC PGM=FTP,REGION=4M,PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.SI.DDATA_MOVIMENTO.SI9248B.CSPAGSIN' +
   SINISTRO_SI9248B_CXSEG_DDATA_MOVIMENTO_RET01.TXT
QUIT
//*
//         ENDIF
//**
//**********************************************************************
//F138FTP  EXEC PGM=FTP,REGION=4M,PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.SI.DDATA_MOVIMENTO.SI9268B.CSPAGSIN' +
   SINISTRO_RESSARC_RETORNO_D$(YYYYODATE).TXT
QUIT
//*
//**
//**********************************************************************
//F139LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.SI.DDATA_MOVIMENTO.SI9269B.CSPAGSIN')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F139LIST.RC = 00 THEN
//F140FTP  EXEC PGM=FTP,REGION=4M,PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.SI.DDATA_MOVIMENTO.SI9269B.CSPAGSIN' +
   SINISTRO_SI9269B_CXSEG_DDATA_MOVIMENTO_RET01.TXT
QUIT
//*
//         ENDIF
//*
//**********************************************************************
//F141FTP  EXEC PGM=FTP,REGION=4M,PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.SI.DDATA_MOVIMENTO.SI9211B.CSPAGSIN' +
     sinistro_pagto_sin_retorno_d20$(ODATE).txt
PUT 'HOM.SI.DDATA_MOVIMENTO.SI9215B.CSPAGSIN' +
     sinistro_estor_pagto_sin_retorno_d20$(ODATE).txt
PUT 'HOM.SI.DDATA_MOVIMENTO.SI9247B.CSPAGSIN' +
     sinistro_pagto_judic_retorno_d20$(ODATE).txt
PUT 'HOM.SI.DDATA_MOVIMENTO.SI9248B.CSPAGSIN' +
     sinistro_estor_pagto_judic_retorno_d20$(ODATE).txt
QUIT
//*
//**
//**********************************************************************
//F142LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.REL.DDATA_MOVIMENTO.SI0888B')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//         IF F142LIST.RC = 00 THEN
//F143PUT  EXEC PGM=FTP,REGION=4M,PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.REL.DDATA_MOVIMENTO.SI0888B' +
     DDATA_MOVIMENTO_SI0888B.TXT
PUT 'HOM.REL.DDATA_MOVIMENTO.SI0888B' +
     DDATA_MOVIMENTO_SI0888B.TXT
QUIT
//*
//         ENDIF
//*
