//VHVGD09  JOB (00,PN),'ID_EXECUTOR',MSGLEVEL=(1,1),
//         CLASS=A,MSGCLASS=T,TIME=1339
//*
/*ROUTE PRINT JES2PRD1
//*
//*DIARIA JV1. DATA:DATA_MOVIMENTO
//*DIARIA JV1. PERIODO:PERIODO_MOVIMENTO
//*DIARIA JV1. ANO MES:ANOMES_MOVIMENTO
//*DIARIA JV1. DIA:DIA_MOVIMENTO
//*DIARIA JV1. DATA ANTERIOR:DATA_ANTERIOR 
//*
//*********************************************************************
//JOBLIB   DD DISP=SHR,DSN=DSNC10.DB2H.SDSNLOAD
//         DD DISP=SHR,DSN=HOM.JV1.LOAD
//*********************************************************************
//E001GET  EXEC PGM=FTP,REGION=0M,PARM='10.100.2.144'
//STEPLIB  DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD UPLOAD\JV1-SIAS\ENTRADA_RECUPERADA\DATA_MOVIMENTO
LOCSITE TRACKS
LOCSITE PRIMARY=1
LOCSITE SECONDARY=20
LOCSITE LRECL=120 BLKSIZE=0 RECFM=FB
GET HOM.VG.DDATA_MOVIMENTO.CADSEG01 +  
 'HOM.VG.DDATA_MOVIMENTO.CADSEG01' (REPLACE
GET HOM.VG.DDATA_MOVIMENTO.CADSEG02 + 
 'HOM.VG.DDATA_MOVIMENTO.CADSEG02' (REPLACE
GET HOM.VG.DDATA_MOVIMENTO.CADSEG03 + 
 'HOM.VG.DDATA_MOVIMENTO.CADSEG03' (REPLACE
GET HOM.VG.DDATA_MOVIMENTO.CADSEG04 + 
 'HOM.VG.DDATA_MOVIMENTO.CADSEG04' (REPLACE
GET HOM.VG.DDATA_MOVIMENTO.CADSEG05 + 
 'HOM.VG.DDATA_MOVIMENTO.CADSEG05' (REPLACE
GET HOM.VG.DDATA_MOVIMENTO.CADSEG06 + 
 'HOM.VG.DDATA_MOVIMENTO.CADSEG06' (REPLACE
GET HOM.VG.DDATA_MOVIMENTO.CADSEG07 + 
 'HOM.VG.DDATA_MOVIMENTO.CADSEG07' (REPLACE
GET HOM.VG.DDATA_MOVIMENTO.CADSEG08 + 
 'HOM.VG.DDATA_MOVIMENTO.CADSEG08' (REPLACE
GET HOM.VG.DDATA_MOVIMENTO.CADSEG09 + 
 'HOM.VG.DDATA_MOVIMENTO.CADSEG09' (REPLACE
GET HOM.VG.DDATA_MOVIMENTO.CADSEG10 + 
 'HOM.VG.DDATA_MOVIMENTO.CADSEG10' (REPLACE
QUIT
//*
//********************************************************************
//E002LIST EXEC PPEXIST,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0010B.ABEND
//********************************************************************
//         IF E002LIST.E001LIST.RC = 02 THEN
//E0020010 EXEC PGM=IKJEFT01,DYNAMNBR=20,
//         COND=(00,NE)
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//DVG0010S DD DSN=HOM.VG.DDATA_MOVIMENTO.VG0010B1.VGD09.EXE01,
//         DISP=(,CATLG,DELETE),
//         UNIT=SYSDA,SPACE=(TRK,(50,50),RLSE),
//         DCB=(RECFM=FB,LRECL=250,BLKSIZE=0,DSORG=PS)
//DVG0010D DD DSN=HOM.VG.DDATA_MOVIMENTO.VG0010B2.VGD09.EXE01,
//         DISP=(,CATLG,DELETE),
//         UNIT=SYSDA,SPACE=(TRK,(50,50),RLSE),
//         DCB=(RECFM=FB,LRECL=200,BLKSIZE=0,DSORG=PS)
//SORTCNTL DD DSN=HOM.JV1.SYSIN(SORTCNTL),DISP=SHR
//SORTWK01 DD UNIT=SYSALLDA,SPACE=(CYL,(50,100),RLSE)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG0010B),DISP=SHR
//SYSIN    DD DUMMY
//  ENDIF
//*
//********************************************************************
//         IF E0020010.RC NE 0 THEN
//E002CRIA EXEC PPCRIA,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0010B.ABEND
//         ENDIF
//*********************************************************************
//E003LIST EXEC PPEXIST,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0020B.ABEND
//********************************************************************
//         IF E003LIST.E001LIST.RC = 02 THEN
//E0030020 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG0020B),DISP=SHR
//SYSIN    DD DUMMY
//         ENDIF
//********************************************************************
//         IF E0030020.RC NE 0 THEN
//E003CRIA EXEC PPCRIA,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0020B.ABEND
//         ENDIF
//*********************************************************************
//E0040040 EXEC PGM=IKJEFT01,DYNAMNBR=20,
//         COND=(00,NE)
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG0040B),DISP=SHR
//SYSIN    DD DUMMY
//*
//********************************************************************
//E005LIST EXEC PPEXIST,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0030B.ABEND
//********************************************************************
//         IF E005LIST.E001LIST.RC = 02 THEN
//E0050030 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG0030B),DISP=SHR
//SYSIN    DD DUMMY
//         ENDIF
//********************************************************************
//         IF E0050030.RC NE 0 THEN
//E005CRIA EXEC PPCRIA,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0030B.ABEND
//         ENDIF
//*********************************************************************
//E006LIST EXEC PGM=IKJEFT01,DYNAMNBR=20,
//          PARM=('PRDEXIST HOM.VG.DDATA_MOVIMENTO.CADSEG01')
//SYSTSPRT DD SYSOUT=*
//SYSPROC  DD DISP=SHR,DSN=HOM.JV1.CLIST
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSTSIN  DD DUMMY
//SYSIN    DD DUMMY
//*
//**
//*********************************************************************
//E0071610 EXEC PGM=IKJEFT01,DYNAMNBR=20,
//         COND=(00,NE,E006LIST)
//SYSTSPRT DD  SYSOUT=*
//SYSPRINT DD  SYSOUT=*
//SYSUDUMP DD  SYSOUT=Z
//SYSOUT   DD  SYSOUT=*
//DVG1610B DD  DISP=SHR,DSN=HOM.VG.DDATA_MOVIMENTO.CADSEG01
//DVG1610C DD  DSN=HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610C.CADSEG01,
//         DISP=(,CATLG),SPACE=(TRK,(50,50),RLSE),UNIT=SYSDA,
//         DCB=(LRECL=400,BLKSIZE=0,RECFM=FB,DSORG=PS)
//DVG1610D DD  DSN=HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610D.CADSEG01,
//         DISP=(,CATLG),SPACE=(TRK,(50,50),RLSE),UNIT=SYSDA,
//         DCB=(LRECL=200,BLKSIZE=0,RECFM=FB,DSORG=PS)
//DVG1610S DD  DSN=HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610S.CADSEG01,
//         DISP=(,CATLG),SPACE=(TRK,(50,50),RLSE),UNIT=SYSDA,
//         DCB=(LRECL=250,BLKSIZE=0,RECFM=FB,DSORG=PS)
//SYSDBOUT DD  SYSOUT=*
//SYSABOUT DD  SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG1610B),DISP=SHR
//SYSIN    DD  DUMMY
//*
//**
//*********************************************************************
//E0081600 EXEC PGM=IKJEFT01,DYNAMNBR=20,
//         COND=((00,NE,E006LIST),(00,NE,E0071610))
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//ARQGRAV  DD DISP=SHR,
//         DSN=HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610C.CADSEG01
//DVG1600D DD  DSN=HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG01,
//         DISP=(,CATLG),SPACE=(TRK,(50,50),RLSE),UNIT=SYSDA,
//         DCB=(LRECL=200,BLKSIZE=0,RECFM=FB,DSORG=PS)
//DVG1600S DD  DSN=HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG01,
//         DISP=(,CATLG),SPACE=(TRK,(50,50),RLSE),UNIT=SYSDA,
//         DCB=(LRECL=250,BLKSIZE=0,RECFM=FB,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG1600B),DISP=SHR
//SYSIN    DD DUMMY
//*
//********************************************************************
//E009LIST EXEC PPEXIST,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0010B.ABEND
//********************************************************************
//         IF E009LIST.E001LIST.RC = 02 AND E006LIST.RC = 00 AND
//            E0071610.RC = 00 AND E0081600.RC = 00  THEN
//E0090010 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//DVG0010S DD DSN=HOM.VG.DDATA_MOVIMENTO.VG0010B1.VGD09.EXE02,
//         DISP=(,CATLG,DELETE),
//         UNIT=SYSDA,SPACE=(TRK,(50,50),RLSE),
//         DCB=(RECFM=FB,LRECL=250,BLKSIZE=0,DSORG=PS)
//DVG0010D DD DSN=HOM.VG.DDATA_MOVIMENTO.VG0010B2.VGD09.EXE02,
//         DISP=(,CATLG,DELETE),
//         UNIT=SYSDA,SPACE=(TRK,(50,50),RLSE),
//         DCB=(RECFM=FB,LRECL=200,BLKSIZE=0,DSORG=PS)
//SORTCNTL DD DSN=HOM.JV1.SYSIN(SORTCNTL),DISP=SHR
//SORTWK01 DD UNIT=SYSALLDA,SPACE=(CYL,(50,100),RLSE)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG0010B),DISP=SHR
//SYSIN    DD DUMMY
//         ENDIF
//*
//********************************************************************
//         IF E0090010.RC NE 0 THEN
//E009CRIA EXEC PPCRIA,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0010B.ABEND
//         ENDIF
//********************************************************************
//E0100040 EXEC PGM=IKJEFT01,DYNAMNBR=20,
//         COND=((00,NE,E006LIST),(00,NE,E0071610),(00,NE,E0081600),
//         (00,NE,E0090010))
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG0040B),DISP=SHR
//SYSIN    DD DUMMY
//*
//********************************************************************
//E011LIST EXEC PPEXIST,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0020B.ABEND
//********************************************************************
//         IF E011LIST.E001LIST.RC = 02 AND E006LIST.RC = 00 AND
//            E0071610.RC = 00 AND E0081600.RC = 00 AND
//            E0090010.RC = 00 AND E0100040.RC = 00 THEN
//E0110020 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG0020B),DISP=SHR
//SYSIN    DD DUMMY
//         ENDIF
//********************************************************************
//         IF E0110020.RC NE 0 THEN
//E011CRIA EXEC PPCRIA,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0020B.ABEND
//         ENDIF
//********************************************************************
//E0121601 EXEC PGM=IKJEFT01,DYNAMNBR=20,
//         COND=((00,NE,E006LIST),(00,NE,E0071610),(00,NE,E0081600),
//         (00,NE,E0090010),(00,NE,E0100040),(00,NE,E0110020))
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//ARQGRAV  DD DISP=SHR,
//         DSN=HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610C.CADSEG01
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG1601B),DISP=SHR
//SYSIN    DD DUMMY
//*
//********************************************************************
//E013LIST EXEC PPEXIST,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0030B.ABEND
//********************************************************************
//         IF E013LIST.E001LIST.RC = 02 AND E006LIST.RC = 00 AND
//            E0071610.RC = 00 AND E0081600.RC = 00 AND
//            E0090010.RC = 00 AND E0100040.RC = 00 AND
//            E0121601.RC = 00 THEN
//E0130030 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG0030B),DISP=SHR
//SYSIN    DD DUMMY
//         ENDIF
//********************************************************************
//         IF E0130030.RC NE 0 THEN
//E013CRIA EXEC PPCRIA,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0030B.ABEND
//         ENDIF
//*********************************************************************
//*********************************************************************
//E017LIST EXEC PGM=IKJEFT01,DYNAMNBR=20,
//          PARM=('PRDEXIST HOM.VG.DDATA_MOVIMENTO.CADSEG02')
//SYSTSPRT DD SYSOUT=*
//SYSPROC  DD DISP=SHR,DSN=HOM.JV1.CLIST
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSTSIN  DD DUMMY
//SYSIN    DD DUMMY
//*
//**
//*********************************************************************
//E0181610 EXEC PGM=IKJEFT01,DYNAMNBR=20,
//         COND=(00,NE,E017LIST)
//SYSTSPRT DD  SYSOUT=*
//SYSPRINT DD  SYSOUT=*
//SYSUDUMP DD  SYSOUT=Z
//SYSOUT   DD  SYSOUT=*
//DVG1610B DD  DISP=SHR,DSN=HOM.VG.DDATA_MOVIMENTO.CADSEG02
//DVG1610C DD  DSN=HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610C.CADSEG02,
//         DISP=(,CATLG),SPACE=(TRK,(50,50),RLSE),UNIT=SYSDA,
//         DCB=(LRECL=400,BLKSIZE=0,RECFM=FB,DSORG=PS)
//DVG1610D DD  DSN=HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610D.CADSEG02,
//         DISP=(,CATLG),SPACE=(TRK,(50,50),RLSE),UNIT=SYSDA,
//         DCB=(LRECL=200,BLKSIZE=0,RECFM=FB,DSORG=PS)
//DVG1610S DD  DSN=HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610S.CADSEG02,
//         DISP=(,CATLG),SPACE=(TRK,(50,50),RLSE),UNIT=SYSDA,
//         DCB=(LRECL=250,BLKSIZE=0,RECFM=FB,DSORG=PS)
//SYSDBOUT DD  SYSOUT=*
//SYSABOUT DD  SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG1610B),DISP=SHR
//SYSIN    DD  DUMMY
//*
//**
//*********************************************************************
//E0191600 EXEC PGM=IKJEFT01,DYNAMNBR=20,
//         COND=((00,NE,E017LIST),(00,NE,E0181610))
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//ARQGRAV  DD DISP=SHR,
//         DSN=HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610C.CADSEG02
//DVG1600D DD  DSN=HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG02,
//         DISP=(,CATLG),SPACE=(TRK,(50,50),RLSE),UNIT=SYSDA,
//         DCB=(LRECL=200,BLKSIZE=0,RECFM=FB,DSORG=PS)
//DVG1600S DD  DSN=HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG02,
//         DISP=(,CATLG),SPACE=(TRK,(50,50),RLSE),UNIT=SYSDA,
//         DCB=(LRECL=250,BLKSIZE=0,RECFM=FB,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG1600B),DISP=SHR
//SYSIN    DD DUMMY
//*
//********************************************************************
//E020LIST EXEC PPEXIST,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0010B.ABEND
//********************************************************************
//         IF E020LIST.E001LIST.RC = 02 AND E017LIST.RC = 00 AND
//            E0181610.RC = 00 AND E0191600.RC = 00  THEN
//E0200010 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//DVG0010S DD DSN=HOM.VG.DDATA_MOVIMENTO.VG0010B1.VGD09.EXE03,
//         DISP=(,CATLG,DELETE),
//         UNIT=SYSDA,SPACE=(TRK,(50,50),RLSE),
//         DCB=(RECFM=FB,LRECL=250,BLKSIZE=0,DSORG=PS)
//DVG0010D DD DSN=HOM.VG.DDATA_MOVIMENTO.VG0010B2.VGD09.EXE03,
//         DISP=(,CATLG,DELETE),
//         UNIT=SYSDA,SPACE=(TRK,(50,50),RLSE),
//         DCB=(RECFM=FB,LRECL=200,BLKSIZE=0,DSORG=PS)
//SORTCNTL DD DSN=HOM.JV1.SYSIN(SORTCNTL),DISP=SHR
//SORTWK01 DD UNIT=SYSALLDA,SPACE=(CYL,(50,100),RLSE)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG0010B),DISP=SHR
//SYSIN    DD DUMMY
//         ENDIF
//*
//********************************************************************
//         IF E0200010.RC NE 0 THEN
//E020CRIA EXEC PPCRIA,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0010B.ABEND
//         ENDIF
//*********************************************************************
//E0210040 EXEC PGM=IKJEFT01,DYNAMNBR=20,
//         COND=((00,NE,E017LIST),(00,NE,E0181610),(00,NE,E0191600),
//         (00,NE,E0200010))
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG0040B),DISP=SHR
//SYSIN    DD DUMMY
//*
//**
//********************************************************************
//E022LIST EXEC PPEXIST,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0020B.ABEND
//********************************************************************
//         IF E022LIST.E001LIST.RC = 02 AND E017LIST.RC = 00 AND
//            E0181610.RC = 00 AND E0191600.RC = 00  AND
//            E0200010.RC = 00 AND E0210040.RC = 00  THEN
//E0220020 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG0020B),DISP=SHR
//SYSIN    DD DUMMY
//         ENDIF
//********************************************************************
//         IF E0220020.RC NE 0 THEN
//E022CRIA EXEC PPCRIA,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0020B.ABEND
//         ENDIF
//*********************************************************************
//E0231601 EXEC PGM=IKJEFT01,DYNAMNBR=20,
//         COND=((00,NE,E017LIST),(00,NE,E0181610),(00,NE,E0191600),
//         (00,NE,E0200010),(00,NE,E0210040),(00,NE,E0220020))
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//ARQGRAV  DD DISP=SHR,
//         DSN=HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610C.CADSEG02
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG1601B),DISP=SHR
//SYSIN    DD DUMMY
//*
//********************************************************************
//E024LIST EXEC PPEXIST,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0030B.ABEND
//********************************************************************
//         IF E024LIST.E001LIST.RC = 02 AND E017LIST.RC = 00 AND
//            E0181610.RC = 00 AND E0191600.RC = 00  AND
//            E0200010.RC = 00 AND E0210040.RC = 00  AND
//            E0231601.RC = 00 THEN
//E0240030 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG0030B),DISP=SHR
//SYSIN    DD DUMMY
//         ENDIF
//********************************************************************
//         IF E0240030.RC NE 0 THEN
//E024CRIA EXEC PPCRIA,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0030B.ABEND
//         ENDIF
//*********************************************************************
//*********************************************************************
//E028LIST EXEC PGM=IKJEFT01,DYNAMNBR=20,
//          PARM=('PRDEXIST HOM.VG.DDATA_MOVIMENTO.CADSEG03')
//SYSTSPRT DD SYSOUT=*
//SYSPROC  DD DISP=SHR,DSN=HOM.JV1.CLIST
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSTSIN  DD DUMMY
//SYSIN    DD DUMMY
//*
//**
//*********************************************************************
//E0291610 EXEC PGM=IKJEFT01,DYNAMNBR=20,
//         COND=(00,NE,E028LIST)
//SYSTSPRT DD  SYSOUT=*
//SYSPRINT DD  SYSOUT=*
//SYSUDUMP DD  SYSOUT=Z
//SYSOUT   DD  SYSOUT=*
//DVG1610B DD  DISP=SHR,DSN=HOM.VG.DDATA_MOVIMENTO.CADSEG03
//DVG1610C DD  DSN=HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610C.CADSEG03,
//         DISP=(,CATLG),SPACE=(TRK,(50,50),RLSE),UNIT=SYSDA,
//         DCB=(LRECL=400,BLKSIZE=0,RECFM=FB,DSORG=PS)
//DVG1610D DD  DSN=HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610D.CADSEG03,
//         DISP=(,CATLG),SPACE=(TRK,(50,50),RLSE),UNIT=SYSDA,
//         DCB=(LRECL=200,BLKSIZE=0,RECFM=FB,DSORG=PS)
//DVG1610S DD  DSN=HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610S.CADSEG03,
//         DISP=(,CATLG),SPACE=(TRK,(50,50),RLSE),UNIT=SYSDA,
//         DCB=(LRECL=250,BLKSIZE=0,RECFM=FB,DSORG=PS)
//SYSDBOUT DD  SYSOUT=*
//SYSABOUT DD  SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG1610B),DISP=SHR
//SYSIN    DD  DUMMY
//*
//**
//*********************************************************************
//E0301600 EXEC PGM=IKJEFT01,DYNAMNBR=20,
//         COND=((00,NE,E028LIST),(00,NE,E0291610))
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//ARQGRAV  DD DISP=SHR,
//         DSN=HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610C.CADSEG03
//DVG1600D DD  DSN=HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG03,
//         DISP=(,CATLG),SPACE=(TRK,(50,50),RLSE),UNIT=SYSDA,
//         DCB=(LRECL=200,BLKSIZE=0,RECFM=FB,DSORG=PS)
//DVG1600S DD  DSN=HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG03,
//         DISP=(,CATLG),SPACE=(TRK,(50,50),RLSE),UNIT=SYSDA,
//         DCB=(LRECL=250,BLKSIZE=0,RECFM=FB,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG1600B),DISP=SHR
//SYSIN    DD DUMMY
//*
//********************************************************************
//E031LIST EXEC PPEXIST,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0010B.ABEND
//********************************************************************
//         IF E031LIST.E001LIST.RC = 02 AND E028LIST.RC = 00 AND
//            E0291610.RC = 00 AND E0301600.RC = 00  THEN
//E0310010 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//DVG0010S DD DSN=HOM.VG.DDATA_MOVIMENTO.VG0010B1.VGD09.EXE04,
//         DISP=(,CATLG,DELETE),
//         UNIT=SYSDA,SPACE=(TRK,(50,50),RLSE),
//         DCB=(RECFM=FB,LRECL=250,BLKSIZE=0,DSORG=PS)
//DVG0010D DD DSN=HOM.VG.DDATA_MOVIMENTO.VG0010B2.VGD09.EXE04,
//         DISP=(,CATLG,DELETE),
//         UNIT=SYSDA,SPACE=(TRK,(50,50),RLSE),
//         DCB=(RECFM=FB,LRECL=200,BLKSIZE=0,DSORG=PS)
//SORTCNTL DD DSN=HOM.JV1.SYSIN(SORTCNTL),DISP=SHR
//SORTWK01 DD UNIT=SYSALLDA,SPACE=(CYL,(50,100),RLSE)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG0010B),DISP=SHR
//SYSIN    DD DUMMY
//         ENDIF
//*
//********************************************************************
//         IF E0310010.RC NE 0 THEN
//E031CRIA EXEC PPCRIA,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0010B.ABEND
//         ENDIF
//*********************************************************************
//E0320040 EXEC PGM=IKJEFT01,DYNAMNBR=20,
//         COND=((00,NE,E028LIST),(00,NE,E0291610),(00,NE,E0301600),
//         (00,NE,E0310010))
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG0040B),DISP=SHR
//SYSIN    DD DUMMY
//*
//********************************************************************
//E033LIST EXEC PPEXIST,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0020B.ABEND
//********************************************************************
//         IF E033LIST.E001LIST.RC = 02 AND E028LIST.RC = 00 AND
//            E0291610.RC = 00 AND E0301600.RC = 00  AND
//            E0310010.RC = 00 AND E0320040.RC = 00  THEN
//E0330020 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG0020B),DISP=SHR
//SYSIN    DD DUMMY
//         ENDIF
//********************************************************************
//         IF E0330020.RC NE 0 THEN
//E033CRIA EXEC PPCRIA,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0020B.ABEND
//         ENDIF
//********************************************************************
//E0341601 EXEC PGM=IKJEFT01,DYNAMNBR=20,
//         COND=((00,NE,E028LIST),(00,NE,E0291610),(00,NE,E0301600),
//         (00,NE,E0310010),(00,NE,E0320040),(00,NE,E0330020))
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//ARQGRAV  DD DISP=SHR,
//         DSN=HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610C.CADSEG03
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG1601B),DISP=SHR
//SYSIN    DD DUMMY
//*
//********************************************************************
//E035LIST EXEC PPEXIST,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0030B.ABEND
//********************************************************************
//         IF E035LIST.E001LIST.RC = 02 AND E028LIST.RC = 00 AND
//            E0291610.RC = 00 AND E0301600.RC = 00  AND
//            E0310010.RC = 00 AND E0320040.RC = 00  AND
//            E0330020.RC = 00 AND E0341601.RC = 00  THEN
//E0350030 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG0030B),DISP=SHR
//SYSIN    DD DUMMY
//         ENDIF
//********************************************************************
//         IF E0350030.RC NE 0 THEN
//E012CRIA EXEC PPCRIA,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0030B.ABEND
//         ENDIF
//********************************************************************
//*********************************************************************
//E039LIST EXEC PGM=IKJEFT01,DYNAMNBR=20,
//          PARM=('PRDEXIST HOM.VG.DDATA_MOVIMENTO.CADSEG04')
//SYSTSPRT DD SYSOUT=*
//SYSPROC  DD DISP=SHR,DSN=HOM.JV1.CLIST
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSTSIN  DD DUMMY
//SYSIN    DD DUMMY
//*
//**
//*********************************************************************
//E0401610 EXEC PGM=IKJEFT01,DYNAMNBR=20,
//         COND=(00,NE,E039LIST)
//SYSTSPRT DD  SYSOUT=*
//SYSPRINT DD  SYSOUT=*
//SYSUDUMP DD  SYSOUT=Z
//SYSOUT   DD  SYSOUT=*
//DVG1610B DD  DISP=SHR,DSN=HOM.VG.DDATA_MOVIMENTO.CADSEG04
//DVG1610C DD  DSN=HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610C.CADSEG04,
//         DISP=(,CATLG),SPACE=(TRK,(50,50),RLSE),UNIT=SYSDA,
//         DCB=(LRECL=400,BLKSIZE=0,RECFM=FB,DSORG=PS)
//DVG1610D DD  DSN=HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610D.CADSEG04,
//         DISP=(,CATLG),SPACE=(TRK,(50,50),RLSE),UNIT=SYSDA,
//         DCB=(LRECL=200,BLKSIZE=0,RECFM=FB,DSORG=PS)
//DVG1610S DD  DSN=HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610S.CADSEG04,
//         DISP=(,CATLG),SPACE=(TRK,(50,50),RLSE),UNIT=SYSDA,
//         DCB=(LRECL=250,BLKSIZE=0,RECFM=FB,DSORG=PS)
//SYSDBOUT DD  SYSOUT=*
//SYSABOUT DD  SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG1610B),DISP=SHR
//SYSIN    DD  DUMMY
//*
//**
//*********************************************************************
//E0411600 EXEC PGM=IKJEFT01,DYNAMNBR=20,
//         COND=((00,NE,E039LIST),(00,NE,E0401610))
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//ARQGRAV  DD DISP=SHR,
//         DSN=HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610C.CADSEG04
//DVG1600D DD  DSN=HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG04,
//         DISP=(,CATLG),SPACE=(TRK,(50,50),RLSE),UNIT=SYSDA,
//         DCB=(LRECL=200,BLKSIZE=0,RECFM=FB,DSORG=PS)
//DVG1600S DD  DSN=HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG04,
//         DISP=(,CATLG),SPACE=(TRK,(50,50),RLSE),UNIT=SYSDA,
//         DCB=(LRECL=250,BLKSIZE=0,RECFM=FB,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG1600B),DISP=SHR
//SYSIN    DD DUMMY
//*
//********************************************************************
//E042LIST EXEC PPEXIST,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0010B.ABEND
//********************************************************************
//         IF E042LIST.E001LIST.RC = 02 AND E039LIST.RC = 00 AND
//            E0401610.RC = 00 AND E0411600.RC = 00  THEN
//E0420010 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//DVG0010S DD DSN=HOM.VG.DDATA_MOVIMENTO.VG0010B1.VGD09.EXE05,
//         DISP=(,CATLG,DELETE),
//         UNIT=SYSDA,SPACE=(TRK,(50,50),RLSE),
//         DCB=(RECFM=FB,LRECL=250,BLKSIZE=0,DSORG=PS)
//DVG0010D DD DSN=HOM.VG.DDATA_MOVIMENTO.VG0010B2.VGD09.EXE05,
//         DISP=(,CATLG,DELETE),
//         UNIT=SYSDA,SPACE=(TRK,(50,50),RLSE),
//         DCB=(RECFM=FB,LRECL=200,BLKSIZE=0,DSORG=PS)
//SORTCNTL DD DSN=HOM.JV1.SYSIN(SORTCNTL),DISP=SHR
//SORTWK01 DD UNIT=SYSALLDA,SPACE=(CYL,(50,100),RLSE)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG0010B),DISP=SHR
//SYSIN    DD DUMMY
//         ENDIF
//*
//********************************************************************
//         IF E0420010.RC NE 0 THEN
//E042CRIA EXEC PPCRIA,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0010B.ABEND
//         ENDIF
//*********************************************************************
//E0430040 EXEC PGM=IKJEFT01,DYNAMNBR=20,
//         COND=((00,NE,E039LIST),(00,NE,E0401610),(00,NE,E0411600),
//         (00,NE,E0420010))
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG0040B),DISP=SHR
//SYSIN    DD DUMMY
//*
//********************************************************************
//E044LIST EXEC PPEXIST,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0020B.ABEND
//********************************************************************
//         IF E044LIST.E001LIST.RC = 02 AND E039LIST.RC = 00 AND
//            E0401610.RC = 00 AND E0411600.RC = 00  AND
//            E0420010.RC = 00 AND E0430040.RC = 00  THEN
//E0440020 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG0020B),DISP=SHR
//SYSIN    DD DUMMY
//         ENDIF
//********************************************************************
//         IF E0440020.RC NE 0 THEN
//E044CRIA EXEC PPCRIA,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0020B.ABEND
//         ENDIF
//*********************************************************************
//E0451601 EXEC PGM=IKJEFT01,DYNAMNBR=20,
//         COND=((00,NE,E039LIST),(00,NE,E0401610),(00,NE,E0411600),
//         (00,NE,E0420010),(00,NE,E0430040),(00,NE,E0440020))
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//ARQGRAV  DD DISP=SHR,
//         DSN=HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610C.CADSEG04
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG1601B),DISP=SHR
//SYSIN    DD DUMMY
//*
//********************************************************************
//E046LIST EXEC PPEXIST,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0030B.ABEND
//********************************************************************
//         IF E046LIST.E001LIST.RC = 02 AND E039LIST.RC = 00 AND
//            E0401610.RC = 00 AND E0411600.RC = 00  AND
//            E0420010.RC = 00 AND E0430040.RC = 00  AND
//            E0440020.RC = 00 AND E0451601.RC = 00  THEN
//*********************************************************************
//E0460030 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG0030B),DISP=SHR
//SYSIN    DD DUMMY
//         ENDIF
//********************************************************************
//         IF E0460030.RC NE 0 THEN
//E046CRIA EXEC PPCRIA,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0030B.ABEND
//         ENDIF
//********************************************************************
//*********************************************************************
//E050LIST EXEC PGM=IKJEFT01,DYNAMNBR=20,
//          PARM=('PRDEXIST HOM.VG.DDATA_MOVIMENTO.CADSEG05')
//SYSTSPRT DD SYSOUT=*
//SYSPROC  DD DISP=SHR,DSN=HOM.JV1.CLIST
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSTSIN  DD DUMMY
//SYSIN    DD DUMMY
//*
//**
//*********************************************************************
//E0511610 EXEC PGM=IKJEFT01,DYNAMNBR=20,
//         COND=(00,NE,E050LIST)
//SYSTSPRT DD  SYSOUT=*
//SYSPRINT DD  SYSOUT=*
//SYSUDUMP DD  SYSOUT=Z
//SYSOUT   DD  SYSOUT=*
//DVG1610B DD  DISP=SHR,DSN=HOM.VG.DDATA_MOVIMENTO.CADSEG05
//DVG1610C DD  DSN=HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610C.CADSEG05,
//         DISP=(,CATLG),SPACE=(TRK,(50,50),RLSE),UNIT=SYSDA,
//         DCB=(LRECL=400,BLKSIZE=0,RECFM=FB,DSORG=PS)
//DVG1610D DD  DSN=HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610D.CADSEG05,
//         DISP=(,CATLG),SPACE=(TRK,(50,50),RLSE),UNIT=SYSDA,
//         DCB=(LRECL=200,BLKSIZE=0,RECFM=FB,DSORG=PS)
//DVG1610S DD  DSN=HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610S.CADSEG05,
//         DISP=(,CATLG),SPACE=(TRK,(50,50),RLSE),UNIT=SYSDA,
//         DCB=(LRECL=250,BLKSIZE=0,RECFM=FB,DSORG=PS)
//SYSDBOUT DD  SYSOUT=*
//SYSABOUT DD  SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG1610B),DISP=SHR
//SYSIN    DD  DUMMY
//*
//**
//*********************************************************************
//E0521600 EXEC PGM=IKJEFT01,DYNAMNBR=20,
//         COND=((00,NE,E050LIST),(00,NE,E0511610))
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//ARQGRAV  DD DISP=SHR,
//         DSN=HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610C.CADSEG05
//DVG1600D DD  DSN=HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG05,
//         DISP=(,CATLG),SPACE=(TRK,(50,50),RLSE),UNIT=SYSDA,
//         DCB=(LRECL=200,BLKSIZE=0,RECFM=FB,DSORG=PS)
//DVG1600S DD  DSN=HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG05,
//         DISP=(,CATLG),SPACE=(TRK,(50,50),RLSE),UNIT=SYSDA,
//         DCB=(LRECL=250,BLKSIZE=0,RECFM=FB,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG1600B),DISP=SHR
//SYSIN    DD DUMMY
//*
//********************************************************************
//E053LIST EXEC PPEXIST,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0010B.ABEND
//********************************************************************
//         IF E053LIST.E001LIST.RC = 02 AND E050LIST.RC = 00 AND
//            E0511610.RC = 00 AND E0521600.RC = 00  THEN
//E0530010 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//DVG0010S DD DSN=HOM.VG.DDATA_MOVIMENTO.VG0010B1.VGD09.EXE06,
//         DISP=(,CATLG,DELETE),
//         UNIT=SYSDA,SPACE=(TRK,(50,50),RLSE),
//         DCB=(RECFM=FB,LRECL=250,BLKSIZE=0,DSORG=PS)
//DVG0010D DD DSN=HOM.VG.DDATA_MOVIMENTO.VG0010B2.VGD09.EXE06,
//         DISP=(,CATLG,DELETE),
//         UNIT=SYSDA,SPACE=(TRK,(50,50),RLSE),
//         DCB=(RECFM=FB,LRECL=200,BLKSIZE=0,DSORG=PS)
//SORTCNTL DD DSN=HOM.JV1.SYSIN(SORTCNTL),DISP=SHR
//SORTWK01 DD UNIT=SYSALLDA,SPACE=(CYL,(50,100),RLSE)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG0010B),DISP=SHR
//SYSIN    DD DUMMY
//         ENDIF
//********************************************************************
//         IF E0530010.RC NE 0 THEN
//E053CRIA EXEC PPCRIA,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0010B.ABEND
//         ENDIF
//*********************************************************************
//E0540040 EXEC PGM=IKJEFT01,DYNAMNBR=20,
//         COND=((00,NE,E050LIST),(00,NE,E0511610),(00,NE,E0521600),
//         (00,NE,E0530010))
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG0040B),DISP=SHR
//SYSIN    DD DUMMY
//*
//********************************************************************
//E055LIST EXEC PPEXIST,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0020B.ABEND
//********************************************************************
//         IF E055LIST.E001LIST.RC = 02 AND E050LIST.RC = 00 AND
//            E0511610.RC = 00 AND E0521600.RC = 00  AND
//            E0530010.RC = 00 AND E0540040.RC = 00  THEN
//E0550020 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG0020B),DISP=SHR
//SYSIN    DD DUMMY
//         ENDIF
//********************************************************************
//         IF E0550020.RC NE 0 THEN
//E055CRIA EXEC PPCRIA,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0020B.ABEND
//         ENDIF
//*********************************************************************
//E0561601 EXEC PGM=IKJEFT01,DYNAMNBR=20,
//         COND=((00,NE,E050LIST),(00,NE,E0511610),(00,NE,E0521600),
//         (00,NE,E0530010),(00,NE,E0540040),(00,NE,E0550020))
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//ARQGRAV  DD DISP=SHR,
//         DSN=HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610C.CADSEG05
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG1601B),DISP=SHR
//SYSIN    DD DUMMY
//*
//********************************************************************
//E057LIST EXEC PPEXIST,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0030B.ABEND
//********************************************************************
//         IF E057LIST.E001LIST.RC = 02 AND E050LIST.RC = 00 AND
//            E0511610.RC = 00 AND E0521600.RC = 00  AND
//            E0530010.RC = 00 AND E0540040.RC = 00  AND
//            E0550020.RC = 00 AND E0561601.RC = 00  THEN
//E0570030 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG0030B),DISP=SHR
//SYSIN    DD DUMMY
//         ENDIF
//********************************************************************
//         IF E0570030.RC NE 0 THEN
//E057CRIA EXEC PPCRIA,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0030B.ABEND
//         ENDIF
//********************************************************************
//*********************************************************************
//E061LIST EXEC PGM=IKJEFT01,DYNAMNBR=20,
//          PARM=('PRDEXIST HOM.VG.DDATA_MOVIMENTO.CADSEG06')
//SYSTSPRT DD SYSOUT=*
//SYSPROC  DD DISP=SHR,DSN=HOM.JV1.CLIST
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSTSIN  DD DUMMY
//SYSIN    DD DUMMY
//*
//**
//*********************************************************************
//E0621610 EXEC PGM=IKJEFT01,DYNAMNBR=20,
//         COND=(00,NE,E061LIST)
//SYSTSPRT DD  SYSOUT=*
//SYSPRINT DD  SYSOUT=*
//SYSUDUMP DD  SYSOUT=Z
//SYSOUT   DD  SYSOUT=*
//DVG1610B DD  DISP=SHR,DSN=HOM.VG.DDATA_MOVIMENTO.CADSEG06
//DVG1610C DD  DSN=HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610C.CADSEG06,
//         DISP=(,CATLG),SPACE=(TRK,(50,50),RLSE),UNIT=SYSDA,
//         DCB=(LRECL=400,BLKSIZE=0,RECFM=FB,DSORG=PS)
//DVG1610D DD  DSN=HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610D.CADSEG06,
//         DISP=(,CATLG),SPACE=(TRK,(50,50),RLSE),UNIT=SYSDA,
//         DCB=(LRECL=200,BLKSIZE=0,RECFM=FB,DSORG=PS)
//DVG1610S DD  DSN=HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610S.CADSEG06,
//         DISP=(,CATLG),SPACE=(TRK,(50,50),RLSE),UNIT=SYSDA,
//         DCB=(LRECL=250,BLKSIZE=0,RECFM=FB,DSORG=PS)
//SYSDBOUT DD  SYSOUT=*
//SYSABOUT DD  SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG1610B),DISP=SHR
//SYSIN    DD  DUMMY
//*
//**
//*********************************************************************
//E0631600 EXEC PGM=IKJEFT01,DYNAMNBR=20,
//         COND=((00,NE,E061LIST),(00,NE,E0621610))
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//ARQGRAV  DD DISP=SHR,
//         DSN=HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610C.CADSEG06
//DVG1600D DD  DSN=HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG06,
//         DISP=(,CATLG),SPACE=(TRK,(50,50),RLSE),UNIT=SYSDA,
//         DCB=(LRECL=200,BLKSIZE=0,RECFM=FB,DSORG=PS)
//DVG1600S DD  DSN=HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG06,
//         DISP=(,CATLG),SPACE=(TRK,(50,50),RLSE),UNIT=SYSDA,
//         DCB=(LRECL=250,BLKSIZE=0,RECFM=FB,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG1600B),DISP=SHR
//SYSIN    DD DUMMY
//*
//********************************************************************
//E064LIST EXEC PPEXIST,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0010B.ABEND
//********************************************************************
//         IF E064LIST.E001LIST.RC = 02 AND E050LIST.RC = 00 AND
//            E0621610.RC = 00 AND E0631600.RC = 00  THEN
//E0640010 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//DVG0010S DD DSN=HOM.VG.DDATA_MOVIMENTO.VG0010B1.VGD09.EXE07,
//         DISP=(,CATLG,DELETE),
//         UNIT=SYSDA,SPACE=(TRK,(50,50),RLSE),
//         DCB=(RECFM=FB,LRECL=250,BLKSIZE=0,DSORG=PS)
//DVG0010D DD DSN=HOM.VG.DDATA_MOVIMENTO.VG0010B2.VGD09.EXE07,
//         DISP=(,CATLG,DELETE),
//         UNIT=SYSDA,SPACE=(TRK,(50,50),RLSE),
//         DCB=(RECFM=FB,LRECL=200,BLKSIZE=0,DSORG=PS)
//SORTCNTL DD DSN=HOM.JV1.SYSIN(SORTCNTL),DISP=SHR
//SORTWK01 DD UNIT=SYSALLDA,SPACE=(CYL,(50,100),RLSE)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG0010B),DISP=SHR
//SYSIN    DD DUMMY
//         ENDIF
//********************************************************************
//         IF E0640010.RC NE 0 THEN
//E064CRIA EXEC PPCRIA,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0010B.ABEND
//         ENDIF
//*********************************************************************
//E0650040 EXEC PGM=IKJEFT01,DYNAMNBR=20,
//         COND=((00,NE,E061LIST),(00,NE,E0621610),(00,NE,E0631600),
//         (00,NE,E0640010))
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG0040B),DISP=SHR
//SYSIN    DD DUMMY
//*
//********************************************************************
//E066LIST EXEC PPEXIST,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0020B.ABEND
//********************************************************************
//         IF E066LIST.E001LIST.RC = 02 AND E061LIST.RC = 00 AND
//            E0621610.RC = 00 AND E0631600.RC = 00  AND
//            E0640010.RC = 00 AND E0650040.RC = 00  THEN
//E0660020 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG0020B),DISP=SHR
//SYSIN    DD DUMMY
//         ENDIF
//********************************************************************
//         IF E0660020.RC NE 0 THEN
//E066CRIA EXEC PPCRIA,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0020B.ABEND
//         ENDIF
//*********************************************************************
//E0671601 EXEC PGM=IKJEFT01,DYNAMNBR=20,
//         COND=((00,NE,E061LIST),(00,NE,E0621610),(00,NE,E0631600),
//         (00,NE,E0640010),(00,NE,E0650040),(00,NE,E0660020))
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//ARQGRAV  DD DISP=SHR,
//         DSN=HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610C.CADSEG06
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG1601B),DISP=SHR
//SYSIN    DD DUMMY
//*
//********************************************************************
//E068LIST EXEC PPEXIST,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0030B.ABEND
//********************************************************************
//         IF E068LIST.E001LIST.RC = 02 AND E061LIST.RC = 00 AND
//            E0621610.RC = 00 AND E0631600.RC = 00  AND
//            E0640010.RC = 00 AND E0650040.RC = 00  AND
//            E0660020.RC = 00 AND E0671601.RC = 00  THEN
//E0680030 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG0030B),DISP=SHR
//SYSIN    DD DUMMY
//         ENDIF
//********************************************************************
//         IF E0680030.RC NE 0 THEN
//E068CRIA EXEC PPCRIA,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0030B.ABEND
//         ENDIF
//*********************************************************************
//*********************************************************************
//E072LIST EXEC PGM=IKJEFT01,DYNAMNBR=20,
//          PARM=('PRDEXIST HOM.VG.DDATA_MOVIMENTO.CADSEG07')
//SYSTSPRT DD SYSOUT=*
//SYSPROC  DD DISP=SHR,DSN=HOM.JV1.CLIST
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSTSIN  DD DUMMY
//SYSIN    DD DUMMY
//*
//**
//*********************************************************************
//E0731610 EXEC PGM=IKJEFT01,DYNAMNBR=20,
//         COND=(00,NE,E072LIST)
//SYSTSPRT DD  SYSOUT=*
//SYSPRINT DD  SYSOUT=*
//SYSUDUMP DD  SYSOUT=Z
//SYSOUT   DD  SYSOUT=*
//DVG1610B DD  DISP=SHR,DSN=HOM.VG.DDATA_MOVIMENTO.CADSEG07
//DVG1610C DD  DSN=HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610C.CADSEG07,
//         DISP=(,CATLG),SPACE=(TRK,(50,50),RLSE),UNIT=SYSDA,
//         DCB=(LRECL=400,BLKSIZE=0,RECFM=FB,DSORG=PS)
//DVG1610D DD  DSN=HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610D.CADSEG07,
//         DISP=(,CATLG),SPACE=(TRK,(50,50),RLSE),UNIT=SYSDA,
//         DCB=(LRECL=200,BLKSIZE=0,RECFM=FB,DSORG=PS)
//DVG1610S DD  DSN=HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610S.CADSEG07,
//         DISP=(,CATLG),SPACE=(TRK,(50,50),RLSE),UNIT=SYSDA,
//         DCB=(LRECL=250,BLKSIZE=0,RECFM=FB,DSORG=PS)
//SYSDBOUT DD  SYSOUT=*
//SYSABOUT DD  SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG1610B),DISP=SHR
//SYSIN    DD  DUMMY
//*
//**
//*********************************************************************
//E0741600 EXEC PGM=IKJEFT01,DYNAMNBR=20,
//         COND=((00,NE,E072LIST),(00,NE,E0731610))
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//ARQGRAV  DD DISP=SHR,
//         DSN=HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610C.CADSEG07
//DVG1600D DD  DSN=HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG07,
//         DISP=(,CATLG),SPACE=(TRK,(50,50),RLSE),UNIT=SYSDA,
//         DCB=(LRECL=200,BLKSIZE=0,RECFM=FB,DSORG=PS)
//DVG1600S DD  DSN=HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG07,
//         DISP=(,CATLG),SPACE=(TRK,(50,50),RLSE),UNIT=SYSDA,
//         DCB=(LRECL=250,BLKSIZE=0,RECFM=FB,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG1600B),DISP=SHR
//SYSIN    DD DUMMY
//*
//********************************************************************
//E075LIST EXEC PPEXIST,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0010B.ABEND
//********************************************************************
//         IF E075LIST.E001LIST.RC = 02 AND E072LIST.RC = 00 AND
//            E0731610.RC = 00 AND E0741600.RC = 00  THEN
//E0750010 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//DVG0010S DD DSN=HOM.VG.DDATA_MOVIMENTO.VG0010B1.VGD09.EXE08,
//         DISP=(,CATLG,DELETE),
//         UNIT=SYSDA,SPACE=(TRK,(50,50),RLSE),
//         DCB=(RECFM=FB,LRECL=250,BLKSIZE=0,DSORG=PS)
//DVG0010D DD DSN=HOM.VG.DDATA_MOVIMENTO.VG0010B2.VGD09.EXE08,
//         DISP=(,CATLG,DELETE),
//         UNIT=SYSDA,SPACE=(TRK,(50,50),RLSE),
//         DCB=(RECFM=FB,LRECL=200,BLKSIZE=0,DSORG=PS)
//SORTCNTL DD DSN=HOM.JV1.SYSIN(SORTCNTL),DISP=SHR
//SORTWK01 DD UNIT=SYSALLDA,SPACE=(CYL,(50,100),RLSE)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG0010B),DISP=SHR
//SYSIN    DD DUMMY
//         ENDIF
//*
//********************************************************************
//         IF E0750010.RC NE 0 THEN
//E075CRIA EXEC PPCRIA,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0010B.ABEND
//         ENDIF
//********************************************************************
//E0760040 EXEC PGM=IKJEFT01,DYNAMNBR=20,
//         COND=((00,NE,E072LIST),(00,NE,E0731610),(00,NE,E0741600),
//         (00,NE,E0750010))
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG0040B),DISP=SHR
//SYSIN    DD DUMMY
//*
//********************************************************************
//E077LIST EXEC PPEXIST,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0020B.ABEND
//********************************************************************
//         IF E077LIST.E001LIST.RC = 02 AND E072LIST.RC = 00 AND
//            E0731610.RC = 00 AND E0741600.RC = 00  AND
//            E0750010.RC = 00 AND E0760040.RC = 00  THEN
//E0770020 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG0020B),DISP=SHR
//SYSIN    DD DUMMY
//         ENDIF
//********************************************************************
//         IF E0770020.RC NE 0 THEN
//E077CRIA EXEC PPCRIA,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0020B.ABEND
//         ENDIF
//*********************************************************************
//E0781601 EXEC PGM=IKJEFT01,DYNAMNBR=20,
//         COND=((00,NE,E072LIST),(00,NE,E0731610),(00,NE,E0741600),
//         (00,NE,E0750010),(00,NE,E0760040),(00,NE,E0770020))
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//ARQGRAV  DD DISP=SHR,
//         DSN=HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610C.CADSEG07
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG1601B),DISP=SHR
//SYSIN    DD DUMMY
//*
//********************************************************************
//E079LIST EXEC PPEXIST,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0030B.ABEND
//********************************************************************
//         IF E079LIST.E001LIST.RC = 02 AND E072LIST.RC = 00 AND
//            E0731610.RC = 00 AND E0741600.RC = 00  AND
//            E0750010.RC = 00 AND E0760040.RC = 00  AND
//            E0770020.RC = 00 AND E0781601.RC = 00  THEN
//E0790030 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG0030B),DISP=SHR
//SYSIN    DD DUMMY
//         ENDIF
//********************************************************************
//         IF E0790030.RC NE 0 THEN
//E079CRIA EXEC PPCRIA,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0030B.ABEND
//         ENDIF
//*********************************************************************
//*********************************************************************
//E083LIST EXEC PGM=IKJEFT01,DYNAMNBR=20,
//          PARM=('PRDEXIST HOM.VG.DDATA_MOVIMENTO.CADSEG08')
//SYSTSPRT DD SYSOUT=*
//SYSPROC  DD DISP=SHR,DSN=HOM.JV1.CLIST
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSTSIN  DD DUMMY
//SYSIN    DD DUMMY
//*
//**
//*********************************************************************
//E0841610 EXEC PGM=IKJEFT01,DYNAMNBR=20,
//         COND=(00,NE,E083LIST)
//SYSTSPRT DD  SYSOUT=*
//SYSPRINT DD  SYSOUT=*
//SYSUDUMP DD  SYSOUT=Z
//SYSOUT   DD  SYSOUT=*
//DVG1610B DD  DISP=SHR,DSN=HOM.VG.DDATA_MOVIMENTO.CADSEG08
//DVG1610C DD  DSN=HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610C.CADSEG08,
//         DISP=(,CATLG),SPACE=(TRK,(50,50),RLSE),UNIT=SYSDA,
//         DCB=(LRECL=400,BLKSIZE=0,RECFM=FB,DSORG=PS)
//DVG1610D DD  DSN=HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610D.CADSEG08,
//         DISP=(,CATLG),SPACE=(TRK,(50,50),RLSE),UNIT=SYSDA,
//         DCB=(LRECL=200,BLKSIZE=0,RECFM=FB,DSORG=PS)
//DVG1610S DD  DSN=HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610S.CADSEG08,
//         DISP=(,CATLG),SPACE=(TRK,(50,50),RLSE),UNIT=SYSDA,
//         DCB=(LRECL=250,BLKSIZE=0,RECFM=FB,DSORG=PS)
//SYSDBOUT DD  SYSOUT=*
//SYSABOUT DD  SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG1610B),DISP=SHR
//SYSIN    DD  DUMMY
//*
//**
//*********************************************************************
//E0851600 EXEC PGM=IKJEFT01,DYNAMNBR=20,
//         COND=((00,NE,E083LIST),(00,NE,E0841610))
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//ARQGRAV  DD DISP=SHR,
//         DSN=HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610C.CADSEG08
//DVG1600D DD  DSN=HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG08,
//         DISP=(,CATLG),SPACE=(TRK,(50,50),RLSE),UNIT=SYSDA,
//         DCB=(LRECL=200,BLKSIZE=0,RECFM=FB,DSORG=PS)
//DVG1600S DD  DSN=HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG08,
//         DISP=(,CATLG),SPACE=(TRK,(50,50),RLSE),UNIT=SYSDA,
//         DCB=(LRECL=250,BLKSIZE=0,RECFM=FB,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG1600B),DISP=SHR
//SYSIN    DD DUMMY
//*
//********************************************************************
//E086LIST EXEC PPEXIST,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0010B.ABEND
//********************************************************************
//         IF E086LIST.E001LIST.RC = 02 AND E083LIST.RC = 00 AND
//            E0841610.RC = 00 AND E0851600.RC = 00  THEN
//E0860010 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//DVG0010S DD DSN=HOM.VG.DDATA_MOVIMENTO.VG0010B1.VGD09.EXE09,
//         DISP=(,CATLG,DELETE),
//         UNIT=SYSDA,SPACE=(TRK,(50,50),RLSE),
//         DCB=(RECFM=FB,LRECL=250,BLKSIZE=0,DSORG=PS)
//DVG0010D DD DSN=HOM.VG.DDATA_MOVIMENTO.VG0010B2.VGD09.EXE09,
//         DISP=(,CATLG,DELETE),
//         UNIT=SYSDA,SPACE=(TRK,(50,50),RLSE),
//         DCB=(RECFM=FB,LRECL=200,BLKSIZE=0,DSORG=PS)
//SORTCNTL DD DSN=HOM.JV1.SYSIN(SORTCNTL),DISP=SHR
//SORTWK01 DD UNIT=SYSALLDA,SPACE=(CYL,(50,100),RLSE)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG0010B),DISP=SHR
//SYSIN    DD DUMMY
//         ENDIF
//********************************************************************
//         IF E0860010.RC NE 0 THEN
//E086CRIA EXEC PPCRIA,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0010B.ABEND
//         ENDIF
//*********************************************************************
//E0870040 EXEC PGM=IKJEFT01,DYNAMNBR=20,
//         COND=((00,NE,E083LIST),(00,NE,E0841610),(00,NE,E0851600),
//         (00,NE,E0860010))
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG0040B),DISP=SHR
//SYSIN    DD DUMMY
//*
//********************************************************************
//E088LIST EXEC PPEXIST,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0020B.ABEND
//********************************************************************
//         IF E088LIST.E001LIST.RC = 02 AND E083LIST.RC = 00 AND
//            E0841610.RC = 00 AND E0851600.RC = 00  AND
//            E0860010.RC = 00 AND E0870040.RC = 00  THEN
//E0880020 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG0020B),DISP=SHR
//SYSIN    DD DUMMY
//         ENDIF
//********************************************************************
//         IF E0880020.RC NE 0 THEN
//E088CRIA EXEC PPCRIA,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0020B.ABEND
//         ENDIF
//*********************************************************************
//E0891601 EXEC PGM=IKJEFT01,DYNAMNBR=20,
//         COND=((00,NE,E083LIST),(00,NE,E0841610),(00,NE,E0851600),
//         (00,NE,E0860010),(00,NE,E0870040),(00,NE,E0880020))
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//ARQGRAV  DD DISP=SHR,
//         DSN=HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610C.CADSEG08
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG1601B),DISP=SHR
//SYSIN    DD DUMMY
//*
//********************************************************************
//E090LIST EXEC PPEXIST,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0030B.ABEND
//********************************************************************
//         IF E090LIST.E001LIST.RC = 02 AND E083LIST.RC = 00 AND
//            E0841610.RC = 00 AND E0851600.RC = 00  AND
//            E0860010.RC = 00 AND E0870040.RC = 00  AND
//            E0880020.RC = 00 AND E0891601.RC = 00  THEN
//E0900030 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG0030B),DISP=SHR
//SYSIN    DD DUMMY
//         ENDIF
//********************************************************************
//         IF E0900030.RC NE 0 THEN
//E090CRIA EXEC PPCRIA,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0030B.ABEND
//         ENDIF
//********************************************************************
//*********************************************************************
//E094LIST EXEC PGM=IKJEFT01,DYNAMNBR=20,
//          PARM=('PRDEXIST HOM.VG.DDATA_MOVIMENTO.CADSEG09')
//SYSTSPRT DD SYSOUT=*
//SYSPROC  DD DISP=SHR,DSN=HOM.JV1.CLIST
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSTSIN  DD DUMMY
//SYSIN    DD DUMMY
//*
//**
//*********************************************************************
//E0951610 EXEC PGM=IKJEFT01,DYNAMNBR=20,
//         COND=(00,NE,E094LIST)
//SYSTSPRT DD  SYSOUT=*
//SYSPRINT DD  SYSOUT=*
//SYSUDUMP DD  SYSOUT=Z
//SYSOUT   DD  SYSOUT=*
//DVG1610B DD  DISP=SHR,DSN=HOM.VG.DDATA_MOVIMENTO.CADSEG09
//DVG1610C DD  DSN=HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610C.CADSEG09,
//         DISP=(,CATLG),SPACE=(TRK,(50,50),RLSE),UNIT=SYSDA,
//         DCB=(LRECL=400,BLKSIZE=0,RECFM=FB,DSORG=PS)
//DVG1610D DD  DSN=HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610D.CADSEG09,
//         DISP=(,CATLG),SPACE=(TRK,(50,50),RLSE),UNIT=SYSDA,
//         DCB=(LRECL=200,BLKSIZE=0,RECFM=FB,DSORG=PS)
//DVG1610S DD  DSN=HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610S.CADSEG09,
//         DISP=(,CATLG),SPACE=(TRK,(50,50),RLSE),UNIT=SYSDA,
//         DCB=(LRECL=250,BLKSIZE=0,RECFM=FB,DSORG=PS)
//SYSDBOUT DD  SYSOUT=*
//SYSABOUT DD  SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG1610B),DISP=SHR
//SYSIN    DD  DUMMY
//*
//**
//*********************************************************************
//E0961600 EXEC PGM=IKJEFT01,DYNAMNBR=20,
//         COND=((00,NE,E094LIST),(00,NE,E0951610))
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//ARQGRAV  DD DISP=SHR,
//         DSN=HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610C.CADSEG09
//DVG1600D DD  DSN=HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG09,
//         DISP=(,CATLG),SPACE=(TRK,(50,50),RLSE),UNIT=SYSDA,
//         DCB=(LRECL=200,BLKSIZE=0,RECFM=FB,DSORG=PS)
//DVG1600S DD  DSN=HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG09,
//         DISP=(,CATLG),SPACE=(TRK,(50,50),RLSE),UNIT=SYSDA,
//         DCB=(LRECL=250,BLKSIZE=0,RECFM=FB,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG1600B),DISP=SHR
//SYSIN    DD DUMMY
//*
//********************************************************************
//E097LIST EXEC PPEXIST,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0010B.ABEND
//********************************************************************
//         IF E097LIST.E001LIST.RC = 02 AND E094LIST.RC = 00 AND
//            E0951610.RC = 00 AND E0961600.RC = 00  THEN
//E0970010 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//DVG0010S DD DSN=HOM.VG.DDATA_MOVIMENTO.VG0010B1.VGD09.EXE10,
//         DISP=(,CATLG,DELETE),
//         UNIT=SYSDA,SPACE=(TRK,(50,50),RLSE),
//         DCB=(RECFM=FB,LRECL=250,BLKSIZE=0,DSORG=PS)
//DVG0010D DD DSN=HOM.VG.DDATA_MOVIMENTO.VG0010B2.VGD09.EXE10,
//         DISP=(,CATLG,DELETE),
//         UNIT=SYSDA,SPACE=(TRK,(50,50),RLSE),
//         DCB=(RECFM=FB,LRECL=200,BLKSIZE=0,DSORG=PS)
//SORTCNTL DD DSN=HOM.JV1.SYSIN(SORTCNTL),DISP=SHR
//SORTWK01 DD UNIT=SYSALLDA,SPACE=(CYL,(50,100),RLSE)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG0010B),DISP=SHR
//SYSIN    DD DUMMY
//         ENDIF
//********************************************************************
//         IF E0970010.RC NE 0 THEN
//E097CRIA EXEC PPCRIA,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0010B.ABEND
//         ENDIF
//********************************************************************
//E0980040 EXEC PGM=IKJEFT01,DYNAMNBR=20,
//         COND=((00,NE,E094LIST),(00,NE,E0951610),(00,NE,E0961600),
//         (00,NE,E0970010))
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG0040B),DISP=SHR
//SYSIN    DD DUMMY
//*
//********************************************************************
//E099LIST EXEC PPEXIST,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0020B.ABEND
//********************************************************************
//         IF E099LIST.E001LIST.RC = 02 AND E094LIST.RC = 00 AND
//            E0951610.RC = 00 AND E0961600.RC = 00  AND
//            E0970010.RC = 00 AND E0980040.RC = 00  THEN
//E0990020 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG0020B),DISP=SHR
//SYSIN    DD DUMMY
//         ENDIF
//********************************************************************
//         IF E0990020.RC NE 0 THEN
//E012CRIA EXEC PPCRIA,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0020B.ABEND
//         ENDIF
//*********************************************************************
//E1001601 EXEC PGM=IKJEFT01,DYNAMNBR=20,
//         COND=((00,NE,E094LIST),(00,NE,E0951610),(00,NE,E0961600),
//         (00,NE,E0970010),(00,NE,E0980040),(00,NE,E0990020))
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//ARQGRAV  DD DISP=SHR,
//         DSN=HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610C.CADSEG09
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG1601B),DISP=SHR
//SYSIN    DD DUMMY
//*
//********************************************************************
//E101LIST EXEC PPEXIST,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0030B.ABEND
//********************************************************************
//         IF E101LIST.E001LIST.RC = 02 AND E094LIST.RC = 00 AND
//            E0951610.RC = 00 AND E0961600.RC = 00  AND
//            E0970010.RC = 00 AND E0980040.RC = 00  AND
//            E0990020.RC = 00 AND E1001601.RC = 00  THEN
//E1010030 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG0030B),DISP=SHR
//SYSIN    DD DUMMY
//         ENDIF
//********************************************************************
//         IF E1010030.RC NE 0 THEN
//E101CRIA EXEC PPCRIA,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0030B.ABEND
//         ENDIF
//*********************************************************************
//*********************************************************************
//E105LIST EXEC PGM=IKJEFT01,DYNAMNBR=20,
//          PARM=('PRDEXIST HOM.VG.DDATA_MOVIMENTO.CADSEG10')
//SYSTSPRT DD SYSOUT=*
//SYSPROC  DD DISP=SHR,DSN=HOM.JV1.CLIST
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSTSIN  DD DUMMY
//SYSIN    DD DUMMY
//*
//**
//*********************************************************************
//E1061610 EXEC PGM=IKJEFT01,DYNAMNBR=20,
//         COND=(00,NE,E105LIST)
//SYSTSPRT DD  SYSOUT=*
//SYSPRINT DD  SYSOUT=*
//SYSUDUMP DD  SYSOUT=Z
//SYSOUT   DD  SYSOUT=*
//DVG1610B DD  DISP=SHR,DSN=HOM.VG.DDATA_MOVIMENTO.CADSEG10
//DVG1610C DD  DSN=HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610C.CADSEG10,
//         DISP=(,CATLG),SPACE=(TRK,(50,50),RLSE),UNIT=SYSDA,
//         DCB=(LRECL=400,BLKSIZE=0,RECFM=FB,DSORG=PS)
//DVG1610D DD  DSN=HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610D.CADSEG10,
//         DISP=(,CATLG),SPACE=(TRK,(50,50),RLSE),UNIT=SYSDA,
//         DCB=(LRECL=200,BLKSIZE=0,RECFM=FB,DSORG=PS)
//DVG1610S DD  DSN=HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610S.CADSEG10,
//         DISP=(,CATLG),SPACE=(TRK,(50,50),RLSE),UNIT=SYSDA,
//         DCB=(LRECL=250,BLKSIZE=0,RECFM=FB,DSORG=PS)
//SYSDBOUT DD  SYSOUT=*
//SYSABOUT DD  SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG1610B),DISP=SHR
//SYSIN    DD  DUMMY
//*
//**
//*********************************************************************
//E1071600 EXEC PGM=IKJEFT01,DYNAMNBR=20,
//         COND=((00,NE,E105LIST),(00,NE,E1061610))
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//ARQGRAV  DD DISP=SHR,
//         DSN=HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610C.CADSEG10
//DVG1600D DD  DSN=HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG10,
//         DISP=(,CATLG),SPACE=(TRK,(50,50),RLSE),UNIT=SYSDA,
//         DCB=(LRECL=200,BLKSIZE=0,RECFM=FB,DSORG=PS)
//DVG1600S DD  DSN=HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG10,
//         DISP=(,CATLG),SPACE=(TRK,(50,50),RLSE),UNIT=SYSDA,
//         DCB=(LRECL=250,BLKSIZE=0,RECFM=FB,DSORG=PS)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG1600B),DISP=SHR
//SYSIN    DD DUMMY
//*
//********************************************************************
//E108LIST EXEC PPEXIST,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0010B.ABEND
//********************************************************************
//         IF E108LIST.E001LIST.RC = 02 AND E105LIST.RC = 00 AND
//            E1061610.RC = 00 AND E1071600.RC = 00  THEN
//*********************************************************************
//E1080010 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//DVG0010S DD DSN=HOM.VG.DDATA_MOVIMENTO.VG0010B1.VGD09.EXE11,
//         DISP=(,CATLG,DELETE),
//         UNIT=SYSDA,SPACE=(TRK,(50,50),RLSE),
//         DCB=(RECFM=FB,LRECL=250,BLKSIZE=0,DSORG=PS)
//DVG0010D DD DSN=HOM.VG.DDATA_MOVIMENTO.VG0010B2.VGD09.EXE11,
//         DISP=(,CATLG,DELETE),
//         UNIT=SYSDA,SPACE=(TRK,(50,50),RLSE),
//         DCB=(RECFM=FB,LRECL=200,BLKSIZE=0,DSORG=PS)
//SORTCNTL DD DSN=HOM.JV1.SYSIN(SORTCNTL),DISP=SHR
//SORTWK01 DD UNIT=SYSALLDA,SPACE=(CYL,(50,100),RLSE)
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG0010B),DISP=SHR
//SYSIN    DD DUMMY
//         ENDIF
//********************************************************************
//         IF E1080010.RC NE 0 THEN
//E108CRIA EXEC PPCRIA,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0010B.ABEND
//         ENDIF
//*********************************************************************
//E1090040 EXEC PGM=IKJEFT01,DYNAMNBR=20,
//         COND=((00,NE,E105LIST),(00,NE,E1061610),(00,NE,E1071600),
//         (00,NE,E1080010))
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG0040B),DISP=SHR
//SYSIN    DD DUMMY
//*
//********************************************************************
//E110LIST EXEC PPEXIST,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0020B.ABEND
//********************************************************************
//         IF E110LIST.E001LIST.RC = 02 AND E105LIST.RC = 00 AND
//            E1061610.RC = 00 AND E1071600.RC = 00  AND
//            E1080010.RC = 00 AND E1090040.RC = 00  THEN
//*********************************************************************
//E1100020 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG0020B),DISP=SHR
//SYSIN    DD DUMMY
//         ENDIF
//********************************************************************
//         IF E1100020.RC NE 0 THEN
//E110CRIA EXEC PPCRIA,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0020B.ABEND
//         ENDIF
//*********************************************************************
//E1111601 EXEC PGM=IKJEFT01,DYNAMNBR=20,
//         COND=((00,NE,E105LIST),(00,NE,E1061610),(00,NE,E1071600),
//         (00,NE,E1080010),(00,NE,E1090040),(00,NE,E1100020))
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//ARQGRAV  DD DISP=SHR,
//         DSN=HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610C.CADSEG10
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG1601B),DISP=SHR
//SYSIN    DD DUMMY
//*
//********************************************************************
//E112LIST EXEC PPEXIST,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0030B.ABEND
//********************************************************************
//         IF E112LIST.E001LIST.RC = 02 AND E105LIST.RC = 00 AND
//            E1061610.RC = 00 AND E1071600.RC = 00  AND
//            E1080010.RC = 00 AND E1090040.RC = 00  AND
//            E1100020.RC = 00 AND E1111601.RC = 00  THEN
//*********************************************************************
//E1120030 EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Z
//SYSOUT   DD SYSOUT=*
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSTSIN  DD DSN=HOM.JV1.SYSIN(VG0030B),DISP=SHR
//SYSIN    DD DUMMY
//         ENDIF
//********************************************************************
//         IF E1120030.RC NE 0 THEN
//E112CRIA EXEC PPCRIA,ARQ=HOM.VG.DDATA_MOVIMENTO.VG0030B.ABEND
//         ENDIF
//********************************************************************
//*
//*********************************************************************
//** STEP DE ENVIO DE MENSAGEM SOBRE JOB COM  ERRO NO ZEKE.          **
//*********************************************************************
//*   IF (RC EQ 99 | RC EQ 09 | RC EQ 08 | RC EQ 12) THEN
//* ABEND EXEC PPSEND,N=JPVGD09
//*   ENDIF
//*
//**
//F001LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610D.CADSEG01')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//**
//         IF F001LIST.RC = 00 THEN
//F002FTP  EXEC PGM=FTP,REGION=0M,PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610D.CADSEG01' +
     20DATA_MOVIMENTO_JPVGD09_VG1610B_CADSEG01_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610D.CADSEG02' +
     20DATA_MOVIMENTO_JPVGD09_VG1610B_CADSEG02_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610D.CADSEG03' +
     20DATA_MOVIMENTO_JPVGD09_VG1610B_CADSEG03_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610D.CADSEG04' +
     20DATA_MOVIMENTO_JPVGD09_VG1610B_CADSEG04_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610D.CADSEG05' +
     20DATA_MOVIMENTO_JPVGD09_VG1610B_CADSEG05_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610D.CADSEG06' +
     20DATA_MOVIMENTO_JPVGD09_VG1610B_CADSEG06_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610D.CADSEG07' +
     20DATA_MOVIMENTO_JPVGD09_VG1610B_CADSEG07_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610D.CADSEG08' +
     20DATA_MOVIMENTO_JPVGD09_VG1610B_CADSEG08_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610D.CADSEG09' +
     20DATA_MOVIMENTO_JPVGD09_VG1610B_CADSEG09_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610D.CADSEG10' +
     20DATA_MOVIMENTO_JPVGD09_VG1610B_CADSEG10_DADOS.TXT
QUIT
//*
//  ENDIF
//**********************************************************************
//F004LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610S.CADSEG01')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//*********************************************************************
//         IF F004LIST.RC = 00 THEN
//F005FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610S.CADSEG01' +
     20DATA_MOVIMENTO_JPVGD09_VG1610B_CADSEG01_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610S.CADSEG02' +
     20DATA_MOVIMENTO_JPVGD09_VG1610B_CADSEG02_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610S.CADSEG03' +
     20DATA_MOVIMENTO_JPVGD09_VG1610B_CADSEG03_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610S.CADSEG04' +
     20DATA_MOVIMENTO_JPVGD09_VG1610B_CADSEG04_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610S.CADSEG05' +
     20DATA_MOVIMENTO_JPVGD09_VG1610B_CADSEG05_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610S.CADSEG06' +
     20DATA_MOVIMENTO_JPVGD09_VG1610B_CADSEG06_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610S.CADSEG07' +
     20DATA_MOVIMENTO_JPVGD09_VG1610B_CADSEG07_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610S.CADSEG08' +
     20DATA_MOVIMENTO_JPVGD09_VG1610B_CADSEG08_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610S.CADSEG09' +
     20DATA_MOVIMENTO_JPVGD09_VG1610B_CADSEG09_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1610B.DVG1610S.CADSEG10' +
     20DATA_MOVIMENTO_JPVGD09_VG1610B_CADSEG10_SISTEMA.TXT
QUIT
//*
//  ENDIF
//**********************************************************************
//F007LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG02')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//*********************************************************************
//         IF F007LIST.RC = 00 THEN
//F008FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG01' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG01_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG02' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG02_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG03' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG03_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG04' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG04_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG05' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG05_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG06' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG06_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG07' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG07_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG08' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG08_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG09' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG09_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG10' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG10_DADOS.TXT
QUIT
//*
//  ENDIF
//**********************************************************************
//F010LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG02')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//*********************************************************************
//         IF F010LIST.RC = 00 THEN
//F011FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG01' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG01_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG02' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG02_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG03' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG03_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG04' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG04_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG05' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG05_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG06' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG06_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG07' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG07_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG08' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG08_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG09' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG09_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG10' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG10_SISTEMA.TXT
QUIT
//*
//  ENDIF
//*
//*
//**********************************************************************
//F013LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG03')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//*********************************************************************
//         IF F013LIST.RC = 00 THEN
//F014FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG01' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG01_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG02' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG02_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG03' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG03_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG04' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG04_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG05' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG05_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG06' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG06_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG07' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG07_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG08' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG08_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG09' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG09_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG10' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG10_DADOS.TXT
QUIT
//*
//  ENDIF
//*
//**********************************************************************
//F016LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG03')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//*********************************************************************
//         IF F016LIST.RC = 00 THEN
//F017FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG01' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG01_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG02' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG02_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG03' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG03_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG04' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG04_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG05' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG05_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG06' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG06_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG07' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG07_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG08' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG08_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG09' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG09_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG10' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG10_SISTEMA.TXT
QUIT
//*
//  ENDIF
//*
//*
//**********************************************************************
//F019LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG04')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//*********************************************************************
//         IF F019LIST.RC = 00 THEN
//F020FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG01' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG01_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG02' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG02_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG03' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG03_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG04' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG04_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG05' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG05_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG06' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG06_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG07' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG07_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG08' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG08_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG09' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG09_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG10' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG10_DADOS.TXT
QUIT
//*
//  ENDIF
//*
//**********************************************************************
//F022LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG04')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//*********************************************************************
//         IF F022LIST.RC = 00 THEN
//F023FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG01' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG01_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG02' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG02_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG03' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG03_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG04' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG04_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG05' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG05_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG06' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG06_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG07' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG07_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG08' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG08_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG09' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG09_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG10' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG10_SISTEMA.TXT
QUIT
//*
//  ENDIF
//*
//*
//**********************************************************************
//F025LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG05')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//*********************************************************************
//         IF F025LIST.RC = 00 THEN
//F026FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG01' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG01_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG02' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG02_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG03' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG03_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG04' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG04_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG05' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG05_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG06' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG06_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG07' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG07_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG08' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG08_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG09' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG09_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG10' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG10_DADOS.TXT
QUIT
//*
//  ENDIF
//*
//**********************************************************************
//F028LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG05')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//*********************************************************************
//         IF F028LIST.RC = 00 THEN
//F029FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG01' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG01_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG02' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG02_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG03' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG03_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG04' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG04_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG05' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG05_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG06' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG06_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG07' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG07_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG08' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG08_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG09' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG09_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG10' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG10_SISTEMA.TXT
QUIT
//*
//  ENDIF
//*
//*
//**********************************************************************
//F031LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG06')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//*********************************************************************
//         IF F031LIST.RC = 00 THEN
//F032FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG01' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG01_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG02' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG02_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG03' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG03_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG04' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG04_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG05' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG05_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG06' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG06_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG07' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG07_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG08' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG08_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG09' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG09_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG10' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG10_DADOS.TXT
QUIT
//*
//  ENDIF
//*
//**********************************************************************
//F034LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG06')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//*********************************************************************
//         IF F034LIST.RC = 00 THEN
//F035FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG01' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG01_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG02' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG02_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG03' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG03_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG04' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG04_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG05' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG05_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG06' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG06_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG07' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG07_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG08' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG08_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG09' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG09_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG10' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG10_SISTEMA.TXT
QUIT
//*
//  ENDIF
//*
//*
//**********************************************************************
//F037LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG07')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//*********************************************************************
//         IF F037LIST.RC = 00 THEN
//F038FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG01' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG01_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG02' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG02_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG03' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG03_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG04' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG04_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG05' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG05_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG06' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG06_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG07' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG07_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG08' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG08_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG09' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG09_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG10' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG10_DADOS.TXT
QUIT
//*
//  ENDIF
//*
//**********************************************************************
//F040LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG07')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//*********************************************************************
//         IF F040LIST.RC = 00 THEN
//F041FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG01' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG01_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG02' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG02_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG03' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG03_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG04' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG04_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG05' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG05_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG06' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG06_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG07' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG07_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG08' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG08_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG09' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG09_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG10' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG10_SISTEMA.TXT
QUIT
//*
//  ENDIF
//*
//*
//**********************************************************************
//F043LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG08')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//*********************************************************************
//         IF F043LIST.RC = 00 THEN
//F044FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG01' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG01_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG02' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG02_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG03' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG03_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG04' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG04_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG05' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG05_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG06' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG06_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG07' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG07_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG08' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG08_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG09' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG09_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG10' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG10_DADOS.TXT
QUIT
//*
//  ENDIF
//*
//**********************************************************************
//F046LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG08')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//*********************************************************************
//         IF F046LIST.RC = 00 THEN
//F047FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG01' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG01_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG02' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG02_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG03' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG03_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG04' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG04_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG05' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG05_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG06' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG06_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG07' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG07_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG08' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG08_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG09' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG09_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG10' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG10_SISTEMA.TXT
QUIT
//*
//  ENDIF
//*
//*
//**********************************************************************
//F049LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG09')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//*********************************************************************
//         IF F049LIST.RC = 00 THEN
//F050FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG01' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG01_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG02' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG02_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG03' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG03_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG04' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG04_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG05' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG05_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG06' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG06_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG07' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG07_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG08' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG08_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG09' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG09_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG10' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG10_DADOS.TXT
QUIT
//*
//  ENDIF
//*
//**********************************************************************
//F052LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG09')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//*********************************************************************
//         IF F052LIST.RC = 00 THEN
//F053FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG01' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG01_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG02' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG02_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG03' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG03_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG04' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG04_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG05' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG05_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG06' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG06_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG07' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG07_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG08' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG08_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG09' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG09_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG10' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG10_SISTEMA.TXT
QUIT
//*
//  ENDIF
//*
//*
//**********************************************************************
//F055LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG10')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//*********************************************************************
//         IF F055LIST.RC = 00 THEN
//F056FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG01' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG01_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG02' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG02_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG03' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG03_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG04' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG04_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG05' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG05_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG06' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG06_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG07' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG07_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG08' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG08_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG09' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG09_DADOS.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600D.CADSEG10' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG10_DADOS.TXT
QUIT
//*
//  ENDIF
//*
//**********************************************************************
//F058LIST EXEC  PGM=IKJEFT01,
//         PARM=('PRDFULL HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG10')
//SYSPROC  DD DSN=HOM.JV1.CLIST,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//*
//*********************************************************************
//         IF F058LIST.RC = 00 THEN
//F059FTP  EXEC PGM=FTP,REGION=4096K,TIME=NOLIMIT,
//         PARM='10.100.2.144'
//*STEPLIB DD DSN=TCPIP.SEZALOAD,DISP=SHR
//SYSTCPD  DD DSN=HOM1.TCPPARMS(TCPDATA),DISP=SHR
//SYSFTPD  DD DSN=HOM1.TCPPARMS(FTPSDATA),DISP=SHR
//SYSMDUMP DD SYSOUT=Z
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//INPUT    DD *
USERPROD USRPRD
CD \UPLOAD\JV1-SIAS\OUTROS\GERADOS
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG01' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG01_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG02' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG02_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG03' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG03_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG04' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG04_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG05' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG05_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG06' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG06_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG07' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG07_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG08' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG08_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG09' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG09_SISTEMA.TXT
PUT 'HOM.VG.DDATA_MOVIMENTO.VG1600B.DVG1600S.CADSEG10' +
     20DATA_MOVIMENTO_JPVGD09_VG1600B_CADSEG10_SISTEMA.TXT
QUIT
//*
//  ENDIF
//*
//**
//*
//*


