//JOB_NAME JOB (,PN),'ID_EXECUTOR',CLASS=X,MSGCLASS=T,MSGLEVEL=(1,1),
//       REGION=0M
//*PROGRAMA: ID_PROGRAMA
//*COMPILACAO: CB2
/*ROUTE PRINT JES2PRD1
//{0}    EXEC VERCOB2P,MEM=ID_PROGRAMA,WSPC=30
//BIND    EXEC BINDPRD
//SYSTSIN  DD *
DSN SYSTEM(DB2P)
BIND PACKAGE(SIASBAT) OWNER(SEGUROS) QUALIFIER(SEGUROS)  +
MEMBER(ID_PROGRAMA) LIB('PRD.SIA.V00.DBRMLIB.DATA')    +
DEGREE(1) ENABLE(BATCH) EXPLAIN(NO) ISOLATION(CS) +
RELEASE(COMMIT) VALIDATE(BIND) ACT(REP)
END
/*
