//JOB_NAME JOB (,PN),'ID_EXECUTOR',CLASS=S,MSGCLASS=T,MSGLEVEL=(1,1),
//     REGION=0M,NOTIFY=&SYSUID
//*PROGRAM: ID_PROGRAMA
//ID_PROGRAMA EXEC VERCOB2S,MEM=ID_PROGRAMA,REGION=0M
//LKED.SYSIN    DD *
  INCLUDE SYSLIB(DFHEAI,DSNCLI)
  NAME ID_PROGRAMA(R)
/*
//NEWCOPY  EXEC PGM=SUPCMD,COND=(4,LT)
//STEPLIB  DD DISP=SHR,DSN=SUP.MVS.LINKLIB
//CMD DD *
F CICSP,CEMT S PROG(ID_PROGRAMA) PH
//*
