//JOB_NAME JOB (,PN),'ID_EXECUTOR',CLASS=X,MSGCLASS=T,MSGLEVEL=(1,1),
//       REGION=0M
//*PROGRAMA: ID_PROGRAMA
//*COMPILACAO: CSN
/*ROUTE PRINT JES2PRD1
//ID_PROGRAMA EXEC COB2PRD,MEM=ID_PROGRAMA,
//         FONTELIB=PRD.GE.A.PGMLIB.COB2P
//*
