//JOB_NAME JOB (,PN),'ID_EXECUTOR',CLASS=A,MSGCLASS=T,MSGLEVEL=(1,1),
//      REGION=0M
//*PROGRAM: ID_PROGRAMA
//*COMPILACAO: CSN
//ID_PROGRAMA  EXEC RZUNI,MEM=ID_PROGRAMA,
//         FONTELIB='PRD.GE.A.PGMLIB.COB2P'
//LKED.SYLMOD DD DISP=SHR,DSN=PRD.V01.LOAD
/*
