//JOB_NAME JOB (,PN),'ID_EXECUTOR',CLASS=S,MSGCLASS=T,MSGLEVEL=(1,1),
//      REGION=0M,NOTIFY=&SYSUID
/*ROUTE PRINT JES2PRD1
//*PROGRAM: ID_PROGRAMA
//NEWCOPY  EXEC PGM=SUPCMD,COND=(4,LT)
//STEPLIB  DD DISP=SHR,DSN=SUP.MVS.LINKLIB
//CMD DD *
  F CICSIAS,CEMT S PROG(CICS_CEMT*) PH
//*
//
