//JOB_NAME JOB (,PN),'ID_EXECUTOR',CLASS=S,MSGCLASS=T,MSGLEVEL=(1,1),
//      REGION=0M,NOTIFY=&SYSUID
/*ROUTE PRINT JES2PRD1
//*PROGRAM: CICSCEMT
//NEWCOPY  EXEC PGM=SUPCMD,COND=(4,LT)
//STEPLIB  DD DISP=SHR,DSN=SUP.MVS.LINKLIB
//CMD DD *
F CICSJV1,CEMT S PROG(SIGC*) PH
F CICSJV1,CEMT S PROG(SIGE*) PH
//*
//
