//JOB_NAME JOB (,PN),'ID_EXECUTOR',CLASS=S,MSGCLASS=T,MSGLEVEL=(1,1),
//      REGION=0M,NOTIFY=&SYSUID
/*ROUTE PRINT JES2PRD1
//*PROGRAM: ID_PROGRAMA
//ID_PROGRAMA EXEC VEZCOBSS,MEM=ID_PROGRAMA,REGION=0M
//LKED.SYSIN    DD *
   INCLUDE SYSLIB(DFHEAI)
   NAME ID_PROGRAMA(R)
/*
//NEWCOPY  EXEC PGM=SUPCMD,COND=(4,LT)
//STEPLIB  DD DISP=SHR,DSN=SUP.MVS.LINKLIB
//CMD DD *
F CICSJV1,CEMT S PROG(ID_PROGRAMA) PH
//*
//
