//JHINSERT JOB (00,PN),'PRODUCAO-MVS',TIME=1440,
//*        TYPRUN=SCAN,
//         CLASS=A,MSGCLASS=T,MSGLEVEL=(1,1),COND=(00,NE)
//*
/*ROUTE PRINT JES2PRD1
//* 
//JOBLIB   DD DISP=SHR,DSN=DSNC10.DB2M.SDSNLOAD         
//         DD DISP=SHR,DSN=HOM.V01.LOAD        
//*
//E001UPD  EXEC PGM=IKJEFT01,DYNAMNBR=50
//SYSTSPRT DD  SYSOUT=*
//SYSPRINT DD  SYSOUT=*
//SYSUDUMP DD  SYSOUT=Z
//SYSTSIN  DD  *
  DSN SYSTEM(DB2M)
  RUN PROGRAM(DSNTEP2) PLAN(DSNTEP10) LIB('DSNC10.DB2M.RUNLIB.LOAD')
//SYSIN    DD  *
 INSERT INTO SEGUROS.RCAPS
select 
21,
substr(a.NUM_sicob,2,9),
0,
' ',
A.VAL_PAGO,
A.VAL_PAGO,
A.data_proposta,
A.data_proposta,
'0',
110,
0,
CURRENT TIMESTAMP,
0,
0,
0,
A.NUM_SICOB,
A.COD_PLANO,
4031,
' ',
0.00,
A.NUM_PROPOSTA_SIVPF
  from seguros.proposta_fideliz a   
 where a.num_proposta_sivpf in (
80029090031673,
80035090016253,
80227090003781,
80354090008957,
80354090008965,
80490090021689,
80490090021697,
80655090046139,
80655090046147,
80655090046155,
80655090046163,
80655090046171,
80655090046181,
80855090014612,
80855090014621,
80974090003834,
80974090003842,
81307090014713,
81371090043774,
81371090043782,
81530090005789,
81563090027495,
81576090036372,
81576090036381,
81576090036399,
81576090036402,
81576090036411,
81607090006787,
81644090004479,
81644090004487,
81887090014161,
81888090005593,
81953090003781,
81987090026742,
81987090026751,
81987090026769,
81987090026777,
81987090026785,
81987090026793,
82010090030332,
83017090010067,
83017090010075,
83017090010083,
83140090003193,
83140090003207,
83189090016662,
83189090016671,
83389090010462,
84070090003275,
84070090003283,
84087090032921,
84291090004803,
84946090006961);
//E002INSE  EXEC PGM=IKJEFT01,DYNAMNBR=50
//SYSTSPRT DD  SYSOUT=*
//SYSPRINT DD  SYSOUT=*
//SYSUDUMP DD  SYSOUT=Z
//SYSTSIN  DD  *
  DSN SYSTEM(DB2M)
  RUN PROGRAM(DSNTEP2) PLAN(DSNTEP10) LIB('DSNC10.DB2M.RUNLIB.LOAD')
//SYSIN    DD  *
 INSERT into seguros.rcap_complementar
select 
COD_FONTE, 
NUM_RCAP,
0,
cod_operacao,
data_movimento,
'22:07:58',
'0',
104,
AGE_COBRANCA,
400001427,
VAL_RCAP,
data_movimento,
data_cadastramento,
'0',
0,
timestamp
from seguros.rcaps   
where  num_certificado in (
80029090031673,
80035090016253,
80227090003781,
80354090008957,
80354090008965,
80490090021689,
80490090021697,
80655090046139,
80655090046147,
80655090046155,
80655090046163,
80655090046171,
80655090046181,
80855090014612,
80855090014621,
80974090003834,
80974090003842,
81307090014713,
81371090043774,
81371090043782,
81530090005789,
81563090027495,
81576090036372,
81576090036381,
81576090036399,
81576090036402,
81576090036411,
81607090006787,
81644090004479,
81644090004487,
81887090014161,
81888090005593,
81953090003781,
81987090026742,
81987090026751,
81987090026769,
81987090026777,
81987090026785,
81987090026793,
82010090030332,
83017090010067,
83017090010075,
83017090010083,
83140090003193,
83140090003207,
83189090016662,
83189090016671,
83389090010462,
84070090003275,
84070090003283,
84087090032921,
84291090004803,
84946090006961);