//JDSZCOMP JOB (,PN),'ID_EXECUTOR',CLASS=S,MSGCLASS=T,MSGLEVEL=(1,1),
//        REGION=0M,NOTIFY=&SYSUID
//*       ***************************************************
//*       * JOB PARA COMPILAR PROGRAMAS:                    *
//*       *     1. ONLINE (STORED PROCEDURES)               *
//*       *     2. SUB-ROTINAS NORMAIS                      *
//*       ***************************************************
//STEP1   EXEC SLUSPB2,MEM=ID_PROGRAMA,
//        FONTELIB='SHRDES.GE.A.NEWSEG.PGMLIB.COB2.SMART'
//STEPLIB DD DSN=SHRDES.GE.A.BOOKLIB,DISP=SHR
//LKED.SYLMOD DD DISP=SHR,DSN=DES.V01.LOAD
//LKED.SYSIN DD *
 INCLUDE SYSLIB(DSNHLI)
 NAME ID_PROGRAMA(R)
//**
//STEP2   EXEC BINDDES
//SYSTSIN DD *
  DSN SYSTEM(DB2D)
  BIND PACKAGE(NULLID) OWNER(SEGUROS) QUALIFIER(SEGUROS) +
       MEMBER(ID_PROGRAMA) LIB('DES.SIA.V00.DBRMLIB.DATA') +
       DEGREE(1) ENABLE(*) EXPLAIN(NO) ISOLATION(CS) +
       RELEASE(COMMIT) VALIDATE(BIND) ACT(REP)
  END
/*
//STEP3   EXEC BINDDES
//SYSTSIN DD *
  DSN SYSTEM(DB2D)
  BIND PACKAGE(SIASBAT) OWNER(SEGUROS) QUALIFIER(SEGUROS) +
       MEMBER(ID_PROGRAMA) LIB('DES.SIA.V00.DBRMLIB.DATA') +
       DEGREE(1) ENABLE(*) EXPLAIN(NO) ISOLATION(CS) +
       RELEASE(COMMIT) VALIDATE(BIND) ACT(REP)
  END
//
