//JDSZCOMP  JOB (,PN),'ID_EXECUTOR',CLASS=S,MSGCLASS=T,MSGLEVEL=(1,1),
//      REGION=0M,NOTIFY=&SYSUID
//*       ******************************************************
//*       *  JOB PARA COMPILAR PROGRAMAS COBOL BATCH COM DB2   *
//*       ******************************************************
//STEP1   EXEC SLUCOB2,MEM=ID_PROGRAMA,
//        FONTELIB='SHRDES.GE.A.NEWSEG.PGMLIB.COB2.SMART'
//STEPLIB DD DSN=SHRDES.GE.A.BOOKLIB,DISP=SHR
//LKED.SYLMOD DD DISP=SHR,DSN=DES.V01.LOAD
//LKED.SYSIN DD *
 INCLUDE SYSLIB(DSNHLI)
 NAME ID_PROGRAMA(R)
//**
//STEP3   EXEC BINDDES
//SYSTSIN DD *
  DSN SYSTEM(DB2D)
  BIND PACKAGE(SIASBAT) OWNER(SEGUROS) QUALIFIER(SEGUROS) +
       MEMBER(ID_PROGRAMA) LIB('DES.SIA.V00.DBRMLIB.DATA') +
       DEGREE(1) ENABLE(BATCH) EXPLAIN(NO) ISOLATION(CS) +
       RELEASE(COMMIT) VALIDATE(BIND) ACT(REP)
  RUN  PROGRAM(DSNTIAD) PLAN(DSNTIA12) +
       LIB('DSNC10.DB2D.RUNLIB.LOAD')
  END
//*
