//JDSZCOMA JOB (,PN),'RDZ',CLASS=A,MSGCLASS=T,MSGLEVEL=(1,1),
//       REGION=0M,NOTIFY=&SYSUID
//*
//JOBLIB   DD  DSN=SHRDES.GE.A.NEWSEG.BOOKLIB,DISP=SHR
//         DD  DISP=SHR,DSN=DSNC10.DB2D.SDSNLOAD
//         DD  DISP=SHR,DSN=DES.V01.LOAD
//*
//STEP1    EXEC SLUCOB2,MEM=ID_PROGRAMA,
//       FONTELIB='SHRDES.GE.A.NEWSEG.PGMLIB.COB2.SMART'
//STEPLIB  DD DSN=SHRDES.GE.A.NEWSEG.BOOKLIB,DISP=SHR
//STEP2    EXEC BINDDES
//*
//SYSTSIN  DD *
 DSN SYSTEM(DB2D)
 BIND PACKAGE(SIASBAT) OWNER(SEGUROS) QUALIFIER(SEGUROS)  +
      MEMBER(ID_PROGRAMA) LIB('DES.SIA.V00.DBRMLIB.DATA') +
      DEGREE(1) ENABLE(*) EXPLAIN(NO) ISOLATION(CS)   +
      RELEASE(COMMIT) VALIDATE(BIND) ACT(REP)
 END
/*

SU:

//JDSZCOMA JOB (,PN),'RDZ',CLASS=S,MSGCLASS=T,MSGLEVEL=(1,1),
//      REGION=0M,NOTIFY=&SYSUID
//*
//STEP1   EXEC SLUSPB2,MEM=ID_PROGRAMA,
//        FONTELIB='SHRDES.GE.A.NEWSEG.PGMLIB.COB2.SMART'
//STEPLIB DD DSN=SHRDES.GE.A.NEWSEG.BOOKLIB,DISP=SHR
//LKED.SYLMOD DD DISP=SHR,DSN=DES.V01.LOAD
//LKED.SYSIN DD *
 INCLUDE SYSLIB(DSNHLI)
 NAME ID_PROGRAMA(R)
//STEP2    EXEC BINDDES
//SYSTSIN  DD *
 DSN SYSTEM(DB2D)
 BIND PACKAGE(NULLID) OWNER(SEGUROS) QUALIFIER(SEGUROS)   +
      MEMBER(ID_PROGRAMA) LIB('DES.SIA.V00.DBRMLIB.DATA') +
      DEGREE(1) ENABLE(*) EXPLAIN(NO) ISOLATION(CS)       +
      RELEASE(COMMIT) VALIDATE(BIND) ACT(REP)
 END
/*
//STEP3   EXEC BINDDES
//SYSTSIN  DD *
 DSN SYSTEM(DB2D)
 BIND PACKAGE(SIASBAT) OWNER(SEGUROS) QUALIFIER(SEGUROS)  +
      MEMBER(ID_PROGRAMA) LIB('DES.SIA.V00.DBRMLIB.DATA') +
      DEGREE(1) ENABLE(*) EXPLAIN(NO) ISOLATION(CS)       +
      RELEASE(COMMIT) VALIDATE(BIND) ACT(REP)
 END
//*
//REFRESH EXEC PGM=SUPCMD,COND=(4,LT)
//STEPLIB DD DISP=SHR,DSN=SUP.MVS.LINKLIB
//CMD DD *
  V WLM,APPLENV=WLM_PROGRAMA,REFRESH
//*

DB2 UNICO:

//JDSZCOMA JOB (,PN),'SZ',CLASS=A,MSGCLASS=T,MSGLEVEL=(1,1),
//       REGION=0M
//COMPILA  EXEC SLUCOB2,MEM=ID_PROGRAMA,
//         FONTELIB='SHRDES.GE.A.NEWSEG.PGMLIB.COB2.SMART'
//STEPLIB  DD DSN=SHRDES.GE.A.NEWSEG.BOOKLIB,DISP=SHR
//*
//LKED.SYSIN DD *
 INCLUDE SYSLIB(DSNHLI)
 NAME ID_PROGRAMA(R)
/*
//BIND     EXEC BINDDES,COND=(04,LT)
//SYSTSIN  DD *
  DSN SYSTEM(DB2D)
      BIND PACKAGE (SIASBAT) OWNER(SEGUROS) QUALIFIER(SEGUROS) +
           MEMBER(ID_PROGRAMA) LIB('DES.SIA.V00.DBRMLIB.DATA') +
           DEGREE(1) ENABLE(*) EXPLAIN(NO) ISOLATION(CS)   +
           RELEASE(COMMIT) VALIDATE(BIND) ACT(REP)
 END
/*
//BIND     EXEC BINDDES
//SYSTSIN  DD *
  DSN SYSTEM(DB2D)
      BIND PACKAGE (NULLID) OWNER(SEGUROS) QUALIFIER(SEGUROS)  +
           MEMBER(ID_PROGRAMA) LIB('DES.SIA.V00.DBRMLIB.DATA')         +
           DEGREE(1) ENABLE(*) EXPLAIN(NO) ISOLATION(CS) +
           RELEASE(COMMIT) VALIDATE(BIND) ACT(REP)
 END
/*
//*
