//JHSSVIDA JOB (,PN),'RDZ',CLASS=A,MSGCLASS=T,MSGLEVEL=(1,1),
//      REGION=0M
//*PROGRAM: PRGCS201 ----------------------------------------------
//*ROUTE PRINT JES2PRD1
//PRGCS201  EXEC DB2SUBML,MEM=PRGCS201,
//         FONTELIB='HOM.GE.A.PGMLIB.COB2H'
//LKED.SYLMOD DD DISP=SHR,DSN=HOM.V01.LOAD
//STEP2    EXEC BINDHOM
//SYSTSIN  DD *
 DSN SYSTEM(DB2M)
 BIND PACKAGE(SIASBAT) OWNER(SEGUROS) QUALIFIER(SEGUROS) +
      MEMBER(PRGCS201) LIB('HOM.SIA.V00.DBRMLIB.DATA') +
      DEGREE(1) ENABLE(BATCH) EXPLAIN(NO) ISOLATION(CS) +
      RELEASE(COMMIT) VALIDATE(BIND) ACT(REP)
 END
/*
//STEP3   EXEC BINDHOM
//SYSTSIN  DD *
 DSN SYSTEM(DB2M)
 BIND PACKAGE(NULLID) OWNER(SEGUROS) QUALIFIER(SEGUROS) +
      MEMBER(PRGCS201) LIB('HOM.SIA.V00.DBRMLIB.DATA') +
      DEGREE(ANY) ENABLE(REMOTE) EXPLAIN(NO) ISOLATION(CS) +
      RELEASE(COMMIT) VALIDATE(BIND) ACT(REP)
 END
/*
//*
